{"source": "telegraph.co.uk", "language": "en", "localpath": "/home/soeren/news-please//data/2016/12/02/telegraph.co.uk/formula-1_2016_11_13__1480676696.html", "image": "http://www.telegraph.co.uk/content/dam/formula-1/2016/11/13/113617880_lewis-hamilton-sport-xlarge_trans++pVlberWd9EgFPZtcLiMQf1X_50byq9Ah3wJAV0YS_Ms.jpg", "modifiedDate": "2016-12-02 11:04:56", "url": "http://www.telegraph.co.uk/formula-1/2016/11/13/brazilian-grand-prix-live/", "title": "Lewis Hamilton masters drenched chaos in Brazil to set up desert showdown", "description": "Scything through the curtains of spray like a silver bullet, Lewis Hamilton won a chaotic, fragmented and confounding Brazilian Grand Prix with the type of brio that suggested this year’", "content": "Though the cars exact less of a physical toll than they used to, this undulating and anti-clockwise circuit is still the same one that saw 1991 racewinner Ayrton Senna have to be pulled from his car after the race, so painful were the muscle spasms in his neck and shoulders.\nThrow in the likelihood of rain - and the chaos we have seen wet weather cause in the not-too-distant past in Brazil - and the environment is set to play much more of an active role in proceedings than your average championship weekend.\nWhat happened in qualifying?\nHere's Oliver Brown's report:Â\nLewis Hamiltonâ\u0080\u0099s inspiration this weekend is writ large in the vivid yellow helmet he has brought to Brazil as a tribute to Ayrton Senna, whose grave lies just a few miles from the fabled, sinuous circuit here at Interlagos.\nOnce more, he proved on Saturday that he had mastered Sennaâ\u0080\u0099s gift for producing the perfect flying lap, recording the 60th pole of his career to ensure that his title duel with Mercedes team-mate Nico Rosberg heads for a dramatic moment of reckoning on Sunday.\nâ\u0080\u009cIâ\u0080\u0099m ready for whatever,â\u0080\u009d Hamilton said, brushing aside worries that the rain forecast for SundayÂ afternoonâ\u0080\u0099s grand prix could create chaos in his efforts to reel in Rosbergâ\u0080\u0099s 19-point championship lead. That much is evident from the formidable resolve he has displayed so far in Sao Paulo, in leading two of the three practice sessions and then unleashing a late burst of brilliance to out-qualify his German rival by one tenth of a second. â\u0080\u009cI have honestly felt quite comfortable,â\u0080\u009d he explained. â\u0080\u009cNico has been going quicker and quicker, but I have had it covered.â\u0080\u009dÂ\nPrepare, then, for a captivating drag race to the first corner. Rosberg, conscious of Hamiltonâ\u0080\u0099s susceptibilities off the start line this season, intends to give ferocious chase, desperate as he is to make the pass that would propel him towards a maiden first world title. A win, as he is only too well aware, would be enough to claim the prize. Anything less, and he would risk the tussle with Hamilton rolling on to Abu Dhabi in a fortnight.\nThe worry for Rosberg is that Hamilton is the man with momentum. Buoyed by consecutive victories in the United States and Mexico, the three-time world champion is acting as if he would regard the loss of his status to Rosberg, a demonstrably slower driver, as an affront. His title prospects were damaged by mid-season engineering issues out of his control, and he is so fixated on making up the lost ground that he appears to believe his legend depends on it.\nRosberg was ebullient enough about making the front row, refusing to represent his shading by Hamilton as a setback. â\u0080\u009cThatâ\u0080\u0099s a very grim view of that,â\u0080\u009d he said. â\u0080\u009cI am still optimistic for the race. I was missing a little on my last lap, but Iâ\u0080\u0099m going to try to get Lewis into Turn One.â\u0080\u009dÂ", "downloadDate": "2016-12-02 11:04:56", "publish_date": "2016-11-14 10:37:08", "year":2016, "month":11,"day":14, "hour":10, "min":37,"author": "['Oliver', 'Brown', 'Victoria Monk', 'Chief Sports Feature Writer', 'Mick Cleary', 'David Coulthard', 'Tom Cary']", "pageTitle": "Lewis Hamilton masters drenched chaos in Brazil to set up desert showdown", "rss_title": "NULL", "descendant": false}