{
  "author": "['Gregory Krieg']",
  "descendant": false,
  "description": "Barely four months after taking office, President Donald Trump is up to his elbows in alleged misdeeds and potentially devastating scandal. Trump's political agenda is at a standstill and fellow Republicans, who had previously lined up as a bulwark against any meaningful oversight, are beginning to hint at a willingness to probe his behavior.",
  "downloadDate": "2017-05-18 12:47:26",
  "filename": "2017_05_18_politics__1495111646.html",
  "image": "http://i2.cdn.cnn.com/cnnnext/dam/assets/160618195550-oval-office-empty-super-tease.jpg",
  "language": "",
  "localpath": "/Users/felix/news-please//data/2017/05/18/edition.cnn.com/2017_05_18_politics__1495111646.html",
  "modifiedDate": "2017-05-18 12:47:26",
  "pageTitle": "How the Trump mess could change the presidency - CNNPolitics.com",
  "publish_date": "2017-05-18 10:00:48",
  "rss_title": "NULL",
  "sourceDomain": "edition.cnn.com",
  "text": "(CNN) Barely four months after taking office, President Donald Trump is up to his elbows in alleged misdeeds and potentially devastating scandal. Trump's political agenda is at a standstill and fellow Republicans, who had previously lined up as a bulwark against any meaningful oversight, are beginning to hint at a willingness to probe his behavior.\nThe prospect of impeachment, until a week ago mostly dismissed as a pipe dream among frustrated liberals, suddenly seems like a feasible outcome. On Wednesday evening, the Justice Department appointed a special counsel to run the federal investigation into potential ties between Trump associates and Russia. Still, there is a long road ahead and little indication that Republicans would consider turning on the President.\nBut should it come to pass, the consequences would be almost impossible to predict. There is only one guarantee: Both parties would be likely be willing, and perhaps compelled, to consider measures they'd laugh at today.\nSo it is not simply Trump's fate at stake in the coming days and weeks (and, likely, months and years). The presidency itself -- the way Americans perceive the office, the power it imbues and how candidates pursue it -- could be altered dramatically if the current situation explodes into a full-scale crisis.\nHere are four ways Trump's removal from office could dramatically reorder the balance of power in political life.\n1. New checks on expansive executive power?\nTry not to laugh.\nConcerns about the boundaries of executive authority date back to the earliest days of the republic. But in the years after 9/11, as Congress increasingly deferred to the White House on matters related to military action abroad, the office has added power while shedding accountability.\nThis is not a uniquely partisan issue.\nPresident Barack Obama's drone program, in particular his \"kill list,\" drew criticism from Republicans, Democrats, constitutional law scholars and human rights activists. Trump during his brief tenure has continued George W. Bush and Obama era policies. Most members of Congress have been happy enough to allow the President increasingly wide latitude to launch airstrikes (like in Syria) and other, more mysterious operations, without formally weighing in.\nJUST WATCHED Obama in 2016: 'No doubt' U.S. drones have killed civilians Replay More Videos ... MUST WATCH Obama in 2016: 'No doubt' U.S. drones have killed civilians 01:04\nStill, It's hard to imagine either party pulling back the reins -- unless a crisis put them in a position where Americans, and political expedience, demanded it.\nThis is how it happens: If the Trump fiasco escalates and more damning evidence of alleged overreach surfaces, prematurely ending his presidency, officials on Capitol Hill might be compelled to reverse the trend. More clearly stated checks on the executive could have prevented a number of recent controversies.\nFor example: The debate over whether the Emoluments Clause applies to Trump's business interests has been tons of fun for the wonks, but for most people, it's been a confusing slog. Any transparently crafted bipartisan legislation, written in the language of 2017, seems absurd in the current environment. But the US, after impeachment, would be in a very different one.\n2. Political parties employing stricter controls on their nominating processes?\nThe GOP was not always the \"party of Trump.\" In the early days of its 2016 primary process, establishment figures -- like former RNC boss turned White House chief of staff Reince Priebus! -- fretted over the businessman candidate and where his rhetoric would take the party.\nWhen it became more apparent that the answer might be \"1600 Pennsylvania Avenue,\" most Republicans rushed to embrace Trump. The idea then was that, with their support, he would \"pivot\" both on policy and personality. And while Trump has mostly come around to GOP legislative orthodoxy, his personal issues now threaten have thrown their majorities on Capitol Hill and in statehouses around the country into doubt.\nWhile both parties want their nominating contests to at least appear open and accessible, and there is law that helps advance the cause, the fall of Trump could be used to sell restrictive measures. Closed primaries often have the effect of sealing off paths for insurgent candidates. There could be more. The RNC, for example, could alter its bylaws to make it more difficult for any candidates who haven't been registered Republicans for, say, 10 years, to take part in GOP-sponsored events.\nThe bottom line here: It's difficult to imagine that Republicans (and Democrats) will pass up using Trump's example, should things fall apart, as evidence they need to create more exacting standards and vetting for potential nominees.\n3. New laws or customs regarding incoming presidents' finances?\nAfter Watergate, lawmakers pursued a so-called \"good government\" agenda, fast-tracking ethics bill and bulking up existing laws in an effort to restore the public's trust in its elected leaders. Still, many of Trump's troubles are rooted in questions of transparency and influence. If they lead to his impeachment, a similar correction could become more politically appealing.\nJUST WATCHED McCain says Trump scandal is 'Watergate size' Replay More Videos ... MUST WATCH McCain says Trump scandal is 'Watergate size' 00:42\nDuring his campaign, Trump either rejected or made a mockery of the customs -- unwritten rules, essentially -- that demanded candidates make public their tax returns and (some) medical information. The absence of the former have made it nearly impossible to parse his potential business connections in Russia.\nIf Congress ever had the juice to pass a bill codifying the disclosure of some minimum of financial information by White House aspirants, this would the time. It's not a completely crazy idea. Lawmakers in 26 states are considering or promoting legislation that would require would-be candidates exchange several years of tax returns for a place on the ballot. New Jersey Gov. Christie recently vetoed a bill passed by his state's legislators that would have barred ballot access for presidential and vice presidential candidates who did not make public five years of returns.\nIn the wake of Trump, implementing those requirements could be an easy way for elected officials to curry good favor with the public. (And it wouldn't cost them much: Trump, after all, was the first nominee in decades to keep his under wraps.)\n4. A less 'awesome' office\nUnlike other democracies we typically perceive as offering similar rights and protections, the American presidential system, unlike the parliamentary governments of Western Europe, focuses immense power in the White House -- on a single person, in a single office.\nIn the UK, for example, prime ministers depend on their parties' success assume or retain power. The US, of course, frequently offers divided government. In that way, presidents -- like Obama for the last two years of his presidency -- can gain outsize influence in a government otherwise dominated by political opponents.\nThat Trump now has majorities in both chambers of Congress is beside the point. He, like his recent predecessors, is the beneficiary of decades of expanding executive power. The questions that follow are as relevant to government as popular culture: Should Americans have such reverence for \"the office of the presidency?\"\nIf nothing else, Trump has already damaged the belief, pushed unerringly by establishment figures across the political establishment, that the presidency by its very nature changes that of its inhabitant. Simply put: Presidents are people, too. The country would be wise not to lose track of that.",
  "title": "How the Trump mess could change the presidency",
  "url": "http://edition.cnn.com/2017/05/18/politics/how-trump-could-change-presidency/"
}