{
  "author": "['Tom Lobianco', 'Ted Barrett', 'Manu Raju']",
  "descendant": false,
  "description": "Deputy Attorney General Rod Rosenstein will face up to 100 of the most scrutinizing stares in Washington when he briefs the US Senate on Thursday afternoon, just one day after he turned the political world on its head by appointing a special counsel to investigate possible collusion between the campaign of President Donald Trump and Russian officials meddling in last year's election.",
  "downloadDate": "2017-05-18 12:47:28",
  "filename": "2017_05_18_politics__1495111648.html",
  "image": "http://i2.cdn.cnn.com/cnnnext/dam/assets/170510190351-rod-rosenstein-lichtblau-super-tease.jpg",
  "language": "",
  "localpath": "/Users/felix/news-please//data/2017/05/18/edition.cnn.com/2017_05_18_politics__1495111648.html",
  "modifiedDate": "2017-05-18 12:47:28",
  "pageTitle": "Rosenstein faces Senate day after upending political world - CNNPolitics.com",
  "publish_date": "2017-05-18 10:08:05",
  "rss_title": "NULL",
  "sourceDomain": "edition.cnn.com",
  "text": "Story highlights Deputy Attorney General to brief Senate Thursday afternoon\nDemocrats had planned to press about a special prosecutor\n(CNN) Deputy Attorney General Rod Rosenstein will face up to 100 of the most scrutinizing stares in Washington when he briefs the US Senate on Thursday afternoon, just one day after he turned the political world on its head by appointing a special counsel to investigate possible collusion between the campaign of President Donald Trump and Russian officials meddling in last year's election.\nRosenstein was originally invited by the two Senate leaders, Republican Mitch McConnell of Kentucky and Democrat Chuck Schumer of New York, to explain Trump's firing of FBI Director James Comey. But that changed on Wednesday evening when Rosenstein announced that he had appointed another former FBI director, Robert Mueller, to conduct an independent investigation into Russia's interference in the 2016 campaign.\nA House Republican aide said Wednesday that House Speaker Paul Ryan of Wisconsin invited Rosenstein to brief all House members on the investigation Friday morning.\nRosenstein's announcement followed more than a week of chaos emanating from the White House, starting with Comey's firing last Tuesday and continuing through the news Monday that Trump divulged classified information to Russian officials and Tuesday's stunning report that Trump asked Comey in a private meeting to stop his investigation into former national security adviser Michael Flynn.\nRead More",
  "title": "Rosenstein faces Senate day after upending political world",
  "url": "http://edition.cnn.com/2017/05/18/politics/rod-rosenstein-senate-briefing/"
}