{
  "author": "['Carrie Johnson', 'Miles Parks']",
  "descendant": false,
  "description": "Robert Mueller led arguably the biggest FBI overhaul in the bureau's history during his 12-year term as director. Now, he'll investigate Russian interference in the 2016 election.",
  "downloadDate": "2017-05-18 12:47:28",
  "filename": "2017_05_18_528848132_who-is-robert-mueller-special-counsel-overseeing-russia-investigation_1495111648.html",
  "image": "https://media.npr.org/assets/img/2017/05/17/gettyimages-170444431_wide-af1cacc7e0c119f3f2751ba120bf2df9f9fde387.jpg?s=1400",
  "language": "en",
  "localpath": "/Users/felix/news-please//data/2017/05/18/npr.org/2017_05_18_528848132_who-is-robert-mueller-special-counsel-overseeing-russia-investigation_1495111648.html",
  "modifiedDate": "2017-05-18 12:47:28",
  "pageTitle": "Who Is Robert Mueller, Former FBI Director, Now Overseeing Russia Investigation? : NPR",
  "publish_date": "2017-05-18 00:00:00",
  "rss_title": "NULL",
  "sourceDomain": "npr.org",
  "text": "Who Is Robert Mueller, Special Counsel Overseeing Russia Investigation?\nEnlarge this image toggle caption Alex Wong/Getty Images Alex Wong/Getty Images\nRobert Mueller, who has been appointed to handle the investigation into Russian meddling in the 2016 election, took the reins as FBI director a week before the attacks on Sept. 11, 2001. That day would influence his entire 12-year run leading the agency.\nMueller oversaw arguably the most significant changes the century-old FBI had ever gone through, and he received praise from lawmakers in both parties on Wednesday for his commitment to justice.\n\"I had been a prosecutor before, so I anticipated spending time on public corruption cases and narcotics cases and bank robberies and the like,\" he told NPR in 2013. \"And Sept. 11 changed all of that.\"\nPolitics Former FBI Director Robert Mueller Appointed To Lead Russia Inquiry Former FBI Director Robert Mueller Appointed To Lead Russia Inquiry Listen · 3:47 3:47\nMueller overhauled the agency to prioritize, first, the threat of terrorism from groups like al-Qaida and the Taliban, and then later, the threat from individuals not affiliated with any particular group, like the Tsarnaev brothers.\nHe moved thousands of agents from criminal investigations into counterterrorism and national security. He detailed the changes in 2003, at an American Civil Liberties Union conference:\n\"The September 11 attacks against New York and Washington changed the course of history. \"They changed the meaning of national security for the United States and dramatically shifted FBI priorities so that the prevention of terrorist attacks became the FBI's top priority and overriding focus. \"While we remain committed to our other important national security and law enforcement responsibilities, the prevention of terrorism takes precedence in our thinking and planning; in our hiring and staffing; in our training and technologies; and, most importantly, in our investigations.\"\nAs his 12-year run as director was coming to a close, Mueller also began prioritizing cyber threats.\nJohn Pistole, Mueller's former deputy director at the FBI, told NPR near the end of Mueller's term that it was hard to overstate the director's footprint on the agency.\n\"He directed and implemented what is arguably the most significant change in the FBI's (entire) history,\" Pistole said.\nStill, despite enjoying broad support from both sides of the aisle, his tenure with the FBI wasn't without its issues. In the mid-2000s, there were calls to break up the FBI, and in 2007, the Justice Department's Office of Inspector General blasted the agency for its data-gathering practices.\nIn a glowing editorial in 2011, The Washington Post editorial board praised Mueller's response to those critiques, saying he moved \"assertively to fix the problems.\"\n\"It was not the first time Mr. Mueller showed character under fire,\" the board wrote. \"In 2002, after learning of other agencies' possible interrogation abuses at the U.S. naval base at Guantanamo Bay, Cuba, Mr. Mueller ordered FBI agents to stay clear of such techniques. And in 2004, he joined other high-level law enforcement officials in threatening to resign if the administration failed to address legal problems with the terrorist surveillance program.\"\nPolitics Former Attorney General Alberto Gonzales On Comey's Firing And The FBI Former Attorney General Alberto Gonzales On Comey's Firing And The FBI Listen · 5:43 5:43\nAmong the other officials threatening to resign from the Justice Department at that time was James Comey. Comey did in fact resign as deputy attorney general in 2005 and seven years later, he was confirmed as director of the FBI. His firing from that position on May 9 led Congress, mostly Democrats, to ratchet up calls for the special investigator role Mueller is taking on. Comey's dismissal cut short the traditional 10-year term.\nMueller ultimately served 12 years, after President Obama asked Congress to extend his term for two extra years in 2011. The president argued that the country's national security agencies needed consistency, as the Pentagon and CIA were also getting new leaders at the time.\nIn a vote that showed Mueller's broad appeal to Republicans and Democrats, Congress voted unanimously at the time to approve the request.\n\"The fact that some are playing politics does not mean that he'll cease being law enforcement,\" said former Attorney General John Ashcroft on Wednesday. \"Frankly, the barking dogs or the clamor of politics won't affect what he does.\"\nAshcroft, who worked closely with Mueller, added that he used to call Mueller \"Square-Jaw McGraw\" because of his even-handedness. Within the FBI, Mueller became known for his gruff taciturnity.\nEarlier in life, Mueller served as a U.S. Marine officer, and an assistant U.S. attorney in three different offices. He graduated from Princeton University in 1966, and received his law degree from the University of Virginia in 1973.\nFormer Justice Department prosecutor David Margolis once joked that Mueller could've been perfect for a different, lower-profile job.\n\"A job he was born for, and has spent his whole life preparing for, drill instructor at Parris Island,\" Margolis said at an awards ceremony near the time Mueller left the FBI.\nEven the normally stoic Mueller broke into a laugh at that one.",
  "title": "Who Is Robert Mueller, Special Counsel Overseeing Russia Investigation?",
  "url": "http://www.npr.org/2017/05/18/528848132/who-is-robert-mueller-special-counsel-overseeing-russia-investigation"
}