{
  "author": "['Lucia Walinchus', 'Richard Pérez-Peña']",
  "descendant": false,
  "description": "The shooting of Terence Crutcher by Officer Betty Jo Shelby is one of several cases that have prompted a national debate about race relations and the police’s use of force.",
  "downloadDate": "2017-05-18 12:47:46",
  "filename": "2017_05_17_us_white-tulsa-officer-is-acquitted-in-fatal-shooting-of-black-driver.html__r=0_1495111666.html",
  "image": "https://static01.nyt.com/images/2017/05/18/us/00tulsa1/00tulsa1-facebookJumbo.jpg",
  "language": "en",
  "localpath": "/Users/felix/news-please//data/2017/05/18/nytimes.com/2017_05_17_us_white-tulsa-officer-is-acquitted-in-fatal-shooting-of-black-driver.html__r=0_1495111666.html",
  "modifiedDate": "2017-05-18 12:47:46",
  "pageTitle": "White Tulsa Officer Is Acquitted in Fatal Shooting of Black Driver - The New York Times",
  "publish_date": "2017-05-17 23:02:39",
  "rss_title": "NULL",
  "sourceDomain": "nytimes.com",
  "text": "Mr. Crutcher’s father, Joseph Crutcher, said after the verdict: “I have four grandchildren that are at home that has lost their daddy. I said I would accept whatever the verdict was, and I’m going to do that. But let it be known that I believe in my heart that Betty Shelby got away with murder.”\nAdvertisement Continue reading the main story\nPolice cameras captured the scene on Sept. 16, 2016, when Officer Shelby, 43, fired a single bullet into the chest of Mr. Crutcher, 40, as he stood next to his S.U.V. on a tree-lined street. The case did not lead to the level of anger and scrutiny that some other police shootings have drawn, but the video added to the growing list of recordings that have been watched and dissected by millions of people who otherwise would never have had such graphic views of deaths at the hands of law enforcement.\nOfficer Shelby, who has been on unpaid leave from the Tulsa Police Department since she was charged, took the potentially risky step of testifying in her own defense, calmly asserting that she had a reasonable fear that Mr. Crutcher was reaching for a gun and that she simply followed her training.\nBoth sides made closing arguments Wednesday before a crowd so large it spilled out of the courtroom and into the halls.\nAdvertisement Continue reading the main story\nDistrict Attorney Steve Kunzweiler told the jury to ask whether there was really any such movement by Mr. Crutcher, or if he was “simply going to the car with his hands up, and making the turn and pivoting to put his hands on the car when the shot is fired.” Prosecutors also argued that Officer Shelby fired several seconds before the gesture the defense cited as the basis for her fear.\nMs. McMurray said the prosecution was a response to media hysteria, and she accused Mr. Kunzweiler of hypocrisy in attacking the credibility of officers who testified for the defense. The district attorney routinely calls officers as witnesses in other cases, yet “he has the audacity to come in here and tell you that law enforcement officers, after he tells you how brave they are and have a difficult a job to do, will come in here and lie to protect Officer Shelby,” Ms. McMurray said.\nAdvertisement Continue reading the main story\nThe last three years have brought intense protests over lethal use of force by law enforcement, and mounting public pressure to punish officers, particularly when race is a factor and video recordings offer grounds to second-guess the police. But convictions remain unusual.\nIn the deaths of Eric Garner on Staten Island, Tamir Rice in Cleveland and Michael Brown in Ferguson, Mo., grand juries declined to charge the officers, leading to renewed protests and allegations that prosecutors had not pressed hard enough for indictments. Prosecutors charged six officers in the death of Freddie Gray in Baltimore, but three were acquitted, one officer’s trial ended in a hung jury and the remaining charges were dropped. In the killings of Samuel DuBose in Cleveland and Walter Scott in North Charleston, S.C., the officers were charged, but their trials ended in hung juries; the officer who shot Mr. Scott later pleaded guilty to related charges.\nNewsletter Sign Up Continue reading the main story Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up Receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\nIn the fatal shootings of Laquan McDonald in Chicago and Philando Castile in Falcon Heights, Minn., the officers have been charged but have not yet gone on trial. In the McDonald case, a prosecutor waited more than a year to file charges, and did so only after a judge ordered the release of video of the killing.\nShortly before he died, Mr. Crutcher stopped his S.U.V. in the middle of a North Tulsa street and got out, behaving erratically and prompting 911 calls from other motorists. An autopsy later showed that he was high on PCP, and Officer Shelby testified that she could smell the drug.\nAdvertisement Continue reading the main story\nOfficer Shelby said he ignored her commands to stop, walking away from her and toward his vehicle, his arms raised. She said Mr. Crutcher repeatedly reached into his pocket, and, on the video, he can be seen lowering one hand. Another officer shocked him with a Taser at the same moment that the fatal shot was fired.\nAdvertisement Continue reading the main story\nOfficer Shelby said she shot him when he appeared to be reaching into the driver’s window of the S.U.V., fearing that he was getting a gun, though no weapon was found in the vehicle or on Mr. Crutcher. She contended that the window was open, but his family has insisted that it was closed; the video does not make it clear.\n“I fired my gun at Mr. Crutcher because I was fearing for my life,” she testified on Monday.\nCross-examining her, Kevin Gray, an assistant district attorney, said repeatedly that Officer Shelby had responded to “a guess about a gun with a gun.”\nWhen she shot him, Officer Shelby was not aware of Mr. Crutcher’s previous run-ins with the police, or his criminal record, which included a conviction on a drug charge. But District Judge Doug Drummond allowed the defense to present testimony about incidents when Mr. Crutcher did not comply with police commands and officers used force to subdue him.\nAdvertisement Continue reading the main story\nMr. Crutcher’s twin sister, Tiffany Crutcher, described the testimony as nauseating.\n“We felt that Terence, someone who can’t speak for himself, was on trial and she was a victim,” Ms. Crutcher said.",
  "title": "White Tulsa Officer Is Acquitted in Fatal Shooting of Black Driver",
  "url": "https://www.nytimes.com/2017/05/17/us/white-tulsa-officer-is-acquitted-in-fatal-shooting-of-black-driver.html?_r=0"
}