{
  "author": "['Charlie Savage']",
  "descendant": false,
  "description": "Early chatter has heightened interest in the process, even though experts caution that such talk is premature while the facts are still in question.",
  "downloadDate": "2017-05-18 12:47:42",
  "filename": "2017_05_17_us_politics_how-the-impeachment-process-works-trump-clinton.html__r=0_1495111662.html",
  "image": "https://static01.nyt.com/images/2017/05/18/us/18impeach-web/18impeach-web-facebookJumbo.jpg",
  "language": "en",
  "localpath": "/Users/felix/news-please//data/2017/05/18/nytimes.com/2017_05_17_us_politics_how-the-impeachment-process-works-trump-clinton.html__r=0_1495111662.html",
  "modifiedDate": "2017-05-18 12:47:42",
  "pageTitle": "How the Impeachment Process Works - The New York Times",
  "publish_date": "2017-05-17 19:17:23",
  "rss_title": "NULL",
  "sourceDomain": "nytimes.com",
  "text": "Only three presidents have been subjected to impeachment proceedings. Two were impeached but acquitted and stayed in office: Andrew Johnson in 1868 and Bill Clinton in 1998 and 1999. A third, Richard M. Nixon in 1974, resigned to avoid being impeached.\nAdvertisement Continue reading the main story\nWhat is the process?\nFirst, the House of Representatives votes on one or more articles of impeachment. If at least one gets a majority vote, the president is impeached — which essentially means being indicted. (In both the Nixon and the Clinton cases, the House Judiciary Committee considered the matter first.)\nNext, the proceedings move to the Senate, which holds a trial overseen by the chief justice of the Supreme Court.\nA team of lawmakers from the House, known as managers, play the role of prosecutors. The president has defense lawyers, and the Senate serves as the jury.\nAdvertisement Continue reading the main story\nIf at least two-thirds of the senators find the president guilty, he is removed, and the vice president takes over as president.\nPhoto\nWhat are the rules?\nThere are no standard rules. Rather, the Senate passes a resolution first laying out trial procedures.\nAdvertisement Continue reading the main story\n“When the Senate decided what the rules were going to be for our trial, they really made them up as they went along,” said Greg Craig, who helped defend Mr. Clinton in his impeachment proceeding and later served as White House counsel to President Barack Obama.\nNewsletter Sign Up Continue reading the main story Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up Receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\nFor example, Mr. Craig said, the initial rules in that case gave four days to the Republican managers to make a case for conviction, followed by four days for the president’s legal team to defend him — essentially opening statements. The Senate then decided whether to hear witnesses, and if so, whether it would be live or on videotape. Eventually, the Senate permitted each side to depose several witnesses by videotape.\nThe rules adopted by the Senate in the Clinton trial — including limiting the number of witnesses and the length of depositions — made it harder to prove a case compared with trials in federal court, said former Representative Bob Barr, a Georgia Republican who served as a House manager during the trial and is also a former United States attorney.\n“Impeachment is a creature unto itself,” Mr. Barr said. “The jury in a criminal case doesn’t set the rules for a case and can’t decide what evidence they want to see and what they won’t.”\nAdvertisement Continue reading the main story\nWhat are the standards?\nThe Constitution allows for the impeachment and removal of a president for “treason, bribery, or other high crimes and misdemeanors.” But no controlling authority serves as a check on how lawmakers choose to interpret that standard, which makes it as much a question of political will as of legal analysis.\nAdvertisement Continue reading the main story\nIn the case of Mr. Clinton’s trial, for example, Robert Byrd, a Democratic senator from West Virginia at the time, told his colleagues that he thought Mr. Clinton was clearly guilty of perjury but that removing him from office was a bad idea.\n“To drop the sword of Damocles now, given the bitter political partisanship surrounding this entire matter, would only serve to further undermine a public trust that is too much damaged already,” he said. “Therefore, I will reluctantly vote to acquit.”\nAdvertisement Continue reading the main story\nMr. Clinton was impeached by a Congress in which the opposition party controlled both the House and the Senate. In Mr. Trump’s case, his party controls both chambers, making it more politically unappealing for them to vote to impeach him.\nWhat about the 25th Amendment?\nAdopted in 1967, the 25th Amendment provides another mechanism for removing a president. It is geared toward dealing with a president who becomes too disabled to carry out the duties of the office, as opposed to presidential lawbreaking.\nUnder its procedures, if the vice president and a majority of the cabinet tell Congress that the president is “unable to discharge the powers and duties of his office,” the vice president immediately becomes the acting president. If the president contests that finding, but two-thirds of both chambers of Congress side with the vice president, the vice president remains the acting president for the rest of the term.",
  "title": "How the Impeachment Process Works",
  "url": "https://www.nytimes.com/2017/05/17/us/politics/how-the-impeachment-process-works-trump-clinton.html?_r=0"
}