{
  "author": "['Matt Novak', \"Matt Novak Is The Editor Of Gizmodo'S Paleofuture Blog\"]",
  "descendant": false,
  "description": "Does it feel like every time you wake up there are a dozen new scandals involving the Trump regime? Well, last night was no different. Here’s a breakdown of all the crazy shit that happened last night and early this morning.",
  "downloadDate": "2017-05-18 12:47:15",
  "filename": "_all-the-crazy-shit-we-learned-about-the-trump-regime-wh-1795324507_1495111635.html",
  "image": "https://i.kinja-img.com/gawker-media/image/upload/s--HvqWTOYK--/c_fill,fl_progressive,g_center,h_450,q_80,w_800/lxtrsxdmdsmsfzniv94s.jpg",
  "language": "en",
  "localpath": "/Users/felix/news-please//data/2017/05/18/gizmodo.com/_all-the-crazy-shit-we-learned-about-the-trump-regime-wh-1795324507_1495111635.html",
  "modifiedDate": "2017-05-18 12:47:15",
  "pageTitle": "All the Crazy Shit We Learned About the Trump Regime While You Were Asleep",
  "publish_date": "2017-05-18 07:50:00",
  "rss_title": "NULL",
  "sourceDomain": "gizmodo.com",
  "text": "President Donald Trump at the US Coast Guard Academy amid calls for his impeachment and potential investigations into obstruction of justice on May 17, 2017 (Photo by Drew Angerer/Getty Images)\nDoes it feel like every time you wake up there are a dozen new scandals involving the Trump regime? Well, last night was no different. Here’s a breakdown of all the crazy shit that happened last night and early this morning.\nThe Trump regime had at least 18 contacts with the Russians that went undisclosed\nAccording to a new report this morning from Reuters, there were at least 18 separate contacts between Trump’s team and Russian officials in the seven months leading up to Election Day on November 8, 2016. The various contacts consisted of both emails and phone calls.\nAdvertisement\nFormer national security advisor Michael Flynn was one of the people who made contact with Russian officials, and previous reports have indicated that Jared Kushner hid his own contacts with the Russians from the FBI, but the new report strongly suggests that there may have been other Trump campaign figures involved.\nRussia’s ambassador to the US, Sergey Kislyak, was one of the Russian officials that the Trump team was regularly communicating with. Kislyak was in the Oval Office last week, though the White House didn’t publicize this fact.\nAdvertisement\nFrom Reuters:\nSix of the previously undisclosed contacts described to Reuters were phone calls between Kislyak and Trump advisers, including Flynn, Trump’s first national security adviser, three current and former officials said. Conversations between Flynn and Kislyak accelerated after the Nov. 8 vote as the two discussed establishing a back channel for communication between Trump and Russian President Vladimir Putin that could bypass the U.S. national security bureaucracy, which both sides considered hostile to improved relations, four current U.S. officials said. In January, the Trump White House initially denied any contacts with Russian officials during the 2016 campaign. The White House and advisers to the campaign have since confirmed four meetings between Kislyak and Trump advisers during that time.\nThe Reuters report stresses that there’s no concrete evidence of collusion between the Trump regime and the Russians, but this still doesn’t look good for them.\n[Reuters]\nPhoto tweeted by US Vice President’s Twitter account on May 16, 2017. Trump’s son-in-law Jared Kushner (back left) and Erdogan’s son-in-law Berat Albayrak (back right) made for an awkward comparison to authoritarian regimes\nKushner urged Trump to ‘counterattack’ after learning that Robert Mueller had been appointed as special counsel\nLast night former FBI Director Robert Mueller was appointed special counsel to investigate the Trump regime’s possible collusion with foreign governments in the lead up to the 2016 election. Mueller will also be presumably looking at any possibility of charges against Trump for obstruction of justice for firing Sally Yates, Preet Bahara, and James Comey.\nAdvertisement\nSponsored\nPresident Trump didn’t learn about Mueller’s appointment until just 30 minutes before it was announced publicly. And in the New York Times minute-by-minute account of how Trump learned about it, Jared Kushner was the lone voice inside the Oval Office urging Trump to go on the offensive:\nMost of those gathered recommended that the president adopt a conciliatory stance, and release a statement accepting Mr. Rosenstein’s decision and embracing a swift investigation that would clear the cloud of suspicion hovering over the West Wing. Mr. Kushner — who had urged Mr. Trump to fire James B. Comey, the F.B.I. director — was one of the few dissenting voices, urging the president to counterattack, according to two senior administration officials. After a brief discussion, however, calmer heads prevailed, and Mr. Trump’s staff huddled over a computer just outside the Oval Office to draft the statement that was ultimately released, asserting the president’s innocence and determination to move on. By the end of the process, Mr. Trump was calm, grimly determined to soldier on and uncharacteristically noncombative, according to people close to the president.\nTrump has been unusually quiet on social media in the past 24 hours. We’ll see if this “uncharacteristically noncombative” keeps up, or whether the real Trump comes shining through on Twitter. It seems like only a matter of time before the latter.\nUpdate, 7:52am: It looks like Trump started tweeting this morning just as I was hitting publish on this post:\n[New York Times]\nThen-nominee Trump and Michael Flynn as they speak at a rally in Colorado on October 18, 2016 (Photo by George Frey/Getty Images)\nThe Trump team knew about FBI investigations into Flynn weeks before Inauguration Day\nMichael Flynn told the Trump team that he was under federal investigation on January 4th, weeks before President Trump was sworn in on January 20, 2017. This directly contradicts everything that the Trump White House has said about how they learned about Flynn’s possible acts of treason.\nAdvertisement\nAdvertisement\nFrom the New York Times:\nMr. Flynn’s disclosure, on Jan. 4, was first made to the transition team’s chief lawyer, Donald F. McGahn II, who is now the White House counsel. That conversation, and another one two days later between Mr. Flynn’s lawyer and transition lawyers, shows that the Trump team knew about the investigation of Mr. Flynn far earlier than has been previously reported.\nPerhaps the most damning aspect of this report is that it has the potential to implicate Vice President Mike Pence as having knowledge of Flynn’s actions.\n[New York Times]\nThe latest upcoming cover of Time magazine (left) and President Donald Trump waving at the US Coast Guard Academy graduation ceremony on May 17, 2017 (Photo by Drew Angerer/Getty Images)\nAmerican intelligence officials are very concerned about the future of Russian hacking\nTime’s latest cover story is about not only the ways in which Russian cyber operations may have helped Trump win the presidency, but the ways in which US intelligence officials are worried that Russia might try to influence the future.\nAdvertisement\nCurrent and former officials at the FBI, at the CIA and in Congress now believe the 2016 Russian operation was just the most visible battle in an ongoing information war against global democracy. And they’ve become more vocal about their concern. “If there has ever been a clarion call for vigilance and action against a threat to the very foundation of our democratic political system, this episode is it,” former Director of National Intelligence James Clapper testified before Congress on May 8. If that sounds alarming, it helps to understand the battlescape of this new information war. As they tweet and like and upvote their way through social media, Americans generate a vast trove of data on what they think and how they respond to ideas and arguments–literally thousands of expressions of belief every second on Twitter, Facebook, Reddit and Google. All of those digitized convictions are collected and stored, and much of that data is available commercially to anyone with sufficient computing power to take advantage of it.\nIt’s a fascinating report that really needs to be read in full.\nAdvertisement\n[Time]\nMichael Flynn at Trump Tower before he was ousted as national security advisor (Getty)\nMichael Flynn was paid $500,000 by Turkey while advising Trump about actions that impacted the country\nIt has become increasingly clear that not only did the Trump regime know Michael Flynn was under investigation, but that Flynn was influencing American foreign policy while taking money from foreign governments.\nAdvertisement\nOne of the Trump administration’s first decisions about the fight against the Islamic State was made by Michael Flynn weeks before he was fired – and it conformed to the wishes of Turkey, whose interests, unbeknownst to anyone in Washington, he’d been paid more than $500,000 to represent.\nAn American official acting in the interests of a foreign government (and getting paid to do it, no less) is actually the definition of treason.\n[McClatchy]\nProtesters gather outside of Trump Tower a day after FBI Director James Comey was fired by President Donald Trump on May 10, 2017 Photo by Spencer Platt/Getty Images)\nThe investigation is going ‘well beyond Flynn’\nNBC News reported last night that it wasn’t just Flynn who was under a microscope right now.\nAdvertisement\nAdvertisement\nThe FBI, with the help of the Treasury Department, the CIA and other agencies, is examining evidence of possible contacts, money transfers and business relationships between a variety of Trump associates and Russian officials, the sources say. The investigation goes well beyond Flynn, Manafort and a possible American connection, to include how Russian intelligence services carried out the campaign of fake news and leaking hacked emails that intelligence officials say was meant to hurt Hillary Clinton and benefit Donald Trump.\nIn retrospect, if Trump thought that firing FBI Director James Comey would make this whole thing go away, he was sadly mistaken.\n[NBC News]\nUS House Majority Leader Rep. Kevin McCarthy (right) talks with Rep. Kevin Brady of Texas prior to a news briefing at the headquarters of Republican National Committee May 17, 2017\nHouse Majority Leader caught on tape saying that he believes Putin pays Trump\nLast night the Washington Post broke the story that House Majority Leader Kevin McCarthy told fellow Republicans in a meeting on June 15, 2016 that he believed Trump was getting paid by Vladimir Putin.\nAdvertisement\n“There’s two people I think Putin pays: Rohrabacher and Trump,” the California Republican said.\nHouse Speaker Paul D. Ryan (R-Wis.) immediately interjected, stopping the conversation from further exploring McCarthy’s assertion, and swore the Republicans present to secrecy.\nAt first, McCarthy denied that such a conversation ever took place. But then the Washington Post told them it had audio recordings of the conversation. McCarthy then backtracked and said he was just joking.\n[Washington Post]\nVice President Mike Pence poses for a selfie during an event celebrating National Military Appreciation Month and National Military Spouse Appreciation Day in the Eisenhower Executive Office Building May 9, 2017 (Photo by Chip Somodevilla/Getty Images)\nRepublicans are ready to make Mike Pence president\nPolitico published a piece at 6:50pm Eastern last night that may as well have been from a month ago now. Titled, “Conservatives begin to whisper: President Pence,” the piece argues that Republicans are pinning their hope on a Pence presidency.\nAdvertisement\nAdvertisement\nErick Erickson, a conservative pundit who was a strong Never Trumper but then pledged to give the president a chance, wrote on Wednesday that Republicans should abandon the president because they “have no need for him with Mike Pence in the wings.” And conservative New York Times op-ed writer Ross Douthat, argued that abandoning Trump now should be easier because someone competent is waiting in the wings. “Hillary Clinton will not be retroactively elected if Trump is removed, nor will Neil Gorsuch be unseated,” Douthat wrote in Wednesday’s Times.\nAs we noted above, Mike Pence is almost certainly implicated in the Trump transition team’s knowledge of Flynn acting as a foreign agent. Why? Pence was the head of the transition team. Best of luck making Pence your president, Republicans.\n[Politico]\nFox News continues to tell viewers that there’s nothing to see\nFox News is still in another universe entirely. On his show last night, Sean Hannity insists that the people going after Trump are peddling conspiracy theories. It will be interesting to see just how disconnected from reality Fox News continues to be as the country descends into political chaos.",
  "title": "All the Crazy Shit We Learned About the Trump Regime While You Were Asleep",
  "url": "http://gizmodo.com/all-the-crazy-shit-we-learned-about-the-trump-regime-wh-1795324507"
}