{
  "author": "['Shikha Dalmia', 'Peter Weber', 'Jeva Lange']",
  "descendant": false,
  "description": "Official site of The Week Magazine, offering commentary and analysis of the day's breaking news and current events as well as arts, entertainment, people and gossip, and political cartoons.",
  "downloadDate": "2017-05-18 12:47:22",
  "filename": "articles_699530_trump-control-because-republicans-are-control_1495111642.html",
  "image": "http://api.theweek.com/sites/default/files/styles/tw_image_9_4/public/GettyImages-683871060.jpg?itok=Iu5r0ait",
  "language": "",
  "localpath": "/Users/felix/news-please//data/2017/05/18/theweek.com/articles_699530_trump-control-because-republicans-are-control_1495111642.html",
  "modifiedDate": "2017-05-18 12:47:22",
  "pageTitle": "Trump is out of control because Republicans are in control",
  "publish_date": "2017-05-18 05:37:02",
  "rss_title": "NULL",
  "sourceDomain": "theweek.com",
  "text": "ADVERTISEMENT\nIf the events of this week demonstrate anything at all, it's the pitfalls of united, one-party government.\nIf the Democrats controlled Congress, President Trump would be well on his way to impeachment, saving both the Republicans and the republic from this destructive presidency. But with Republicans in control, lawmakers from the president's party can barely muster the courage to utter the \"I\" word aloud. It's all we can do to get a special prosecutor to look into Trump's Russia connections.\nThe case for Trump's impeachment is overdetermined at this stage. Trump entered the Oval Office in open violation of conflict of interest guidelines and the foreign emoluments clause of the Constitution, which requires certain federal office holders to have no assets that would allow them to benefit from dealings with foreign governments. Past presidents have satisfied that requirement by divesting or putting their assets in a truly blind trust. Trump refused to do that. He supposedly relinquished the management of his vast global empire to his sons, but continued to hold an ownership stake in the Trump Organization. This means that every time a foreign government invests in Trump's business, he personally benefits from it (his charade of handing over all profits to the Treasury Department notwithstanding).\nThen, within weeks of assuming office, he outrageously accused former President Barack Obama, who he mused should be impeached for \"incompetence,\" of bugging Trump Tower — without a shred of evidence.\nLast week, he fired FBI Director James Comey, who was leading an investigation into Russia's meddling in the election, for refusing to wrap up — as he himself put it — the \"Russia thing\" and to pursue the leakers in the intelligence community. These leaks revealed, among other things, that erstwhile National Security Adviser Mike Flynn had improper contacts and conversations with the Russian ambassador and then lied about them, forcing his ouster. As if Comey's firing wasn't bad enough, Trump took to Twitter to intimidate Comey, warning him not to leak his side of the story lest Trump release secret tapes of their conversations.\nThis week, Trump admitted (again, on Twitter) that he revealed intelligence about ISIS plots to the very Russian ambassador at the heart of the Flynn firing. This may not have been technically illegal, since the president has the absolute right to declassify whatever he wants. But this was careless beyond words — not to mention hypocritical after Trump repeatedly questioned Hillary Clinton's right to receive classified briefings because she jeopardized national security given her use of an unsecure email server as secretary of state.\nThen came the most incriminating of all revelations: that Trump allegedly tried to shut down the FBI's investigation of Flynn, telling Comey in a private meeting that he \"hopes you can let this go.\" Rep. Jason Chaffetz (R-Utah) has subpoenaed all the memos that Comey kept documenting these conversations with Trump.\nRegardless of what the memos reveal, Trump's established pattern of behavior has already shown him to be unfit for office. His violation of the emoluments clause is unethical if not outright illegal. His accusations of wiretapping are unhinged. His firing of Comey over the Russia investigation amounts to obstruction of justice. His threats to leak secret tapes of his conversations with Comey are straight out of The Godfather. His casual leaking of highly classified information to a foreign adversary is reckless.\nAnd all of this in just a few months in office. If Republicans allow Trump to serve his full four-year term, they will end up carrying so much dirty water for him that their party will never escape the stench.\nSo why are they dragging their feet? Didn't they impeach Bill Clinton on obstruction of justice charges for far less? In the formal case against him, they resorted to rather bizarre and far-fetched theories about how Clinton lying about his personal affair would jeopardize national security by giving a foreign power that came in possession of the Monica Lewinsky tapes ammunition to blackmail him.\nRepublican recalcitrance has nothing to do with love for Trump. His presidential rivals, such as Florida Sen. Marco Rubio and Texas Sen. Ted Cruz, who were personally vilified by Trump during the campaign, no doubt hate his guts. So why are they mum?\nEssentially, because they are all caught between the proverbial rock that is Trump's loyal base and the hard place that is their own rapidly waning credibility.\nDespite Trump's erratic, even venal, behavior, his approval rating among Republican voters remains a whopping 84 percent. Seventy-five percent are unperturbed by the Comey firing and believe that Trump ousted Comey because he mishandled Hillary Clinton's email investigation.\nIf Republicans in Congress were to try and oust Trump, they'd trigger a base revolt that would regard the impeachment as a soft coup. Furthermore, Republicans haven't fully controlled the federal government since 2006, and they still dream of using their advantage to get things done.\nDemocrats might puff their chests in self-righteous indignation at Republicans' moral bankruptcy right now. But face it: They would act identically if they were similarly charged with holding a Democratic president accountable.\nIt's become conventional wisdom that divided government and gridlock prevents our political classes from accomplishing anything. But Republican helplessness in the face of the obscenity that is the Trump presidency shows that single-party rule doesn't accomplish as much legislative good as it excuses executive abuse. Illegal behavior by the president is only a necessary condition for impeachment. It is not sufficient. For that, you likely need divided government. The politics of impeachment are much more tractable when the same party doesn't control all branches of government.\nRepublicans may well impeach President Trump eventually. But they'll set the bar very high, and they'll need to engage in a painstaking and laborious process to appease their base, none of which would have hamstrung Democrats if they controlled Congress.\nThis means that Trump will probably have to do much more damage before Republicans can finally wash their hands off him. That's a tragedy for their party and this country. This president may well make them rue the day that they won Congress.",
  "title": "Trump is out of control because Republicans are in control",
  "url": "http://theweek.com/articles/699530/trump-control-because-republicans-are-control"
}