{
  "author": "['Gwen Ihnat']",
  "descendant": false,
  "description": "",
  "downloadDate": "2017-05-18 12:47:19",
  "filename": "article_rip-chris-cornell-soundgarden-and-audioslave-255550_utm_medium%3DRSS%26utm_campaign%3Dfeeds_1495111639.html",
  "image": "http://i.onionstatic.com/avclub/6324/92/16x9/1200.jpg",
  "language": "",
  "localpath": "/Users/felix/news-please//data/2017/05/18/avclub.com/article_rip-chris-cornell-soundgarden-and-audioslave-255550_utm_medium%3DRSS%26utm_campaign%3Dfeeds_1495111639.html",
  "modifiedDate": "2017-05-18 12:47:19",
  "pageTitle": "\n  R.I.P. Chris Cornell of Soundgarden and Audioslave\n  \n    · Newswire\n  \n   · The A.V. Club\n",
  "publish_date": "2017-05-18 06:10:00",
  "rss_title": "NULL",
  "sourceDomain": "avclub.com",
  "text": "The AP, NPR, and other news outlets are reporting this morning that Chris Cornell of Soundgarden and Audioslave died last night after playing a Soundgarden show at the Fox Theatre in Detroit. The BBC called him “the architect of grunge.” In a statement to CNN this morning, his representative Brian Bumbery said: “His wife Vicky and family were shocked to learn of his sudden and unexpected passing, and they will be working closely with the medical examiner to determine the cause. They would like to thank his fans for their continuous love and loyalty and ask that their privacy be respected at this time.” Meanwhile, WXYZ Detroit is reporting that police say Cornell died of a possible suicide. He was 52.\nAlong with Nirvana, Pearl Jam, and Alice In Chains, Cornell’s band Soundgarden was one of the cornerstones of the ’90s Seattle grunge movement. The band was also one of the first grunge bands to sign with a major label. Cornell’s distinctive four-octave voice helped push Soundgarden albums like 1994’s Superunknown—which also won Grammys for “Black Hole Sun” and “Spoonman”—to the top of the Billboard 100.\nSoundgarden disbanded in 1997 before reuniting in 2010, and Cornell formed Audioslave with former members of Rage Against The Machine in 2001. Cornell also released five solo albums, and was nominated for a Grammy for the theme song to the James Bond movie Casino Royale, “You Know My Name.”\nThe tour Cornell was currently on with Soundgarden was set to wrap up in Oklahoma on May 27. Before that tour, Cornell tweeted, “What I look forward to the most… is the camaraderie. It’s what we missed when we weren’t a band.” When the news broke before dawn in the U.S. this morning, tributes started pouring in on Twitter:\nRIP Chris Cornell\nIncredibly Talented\nIncredibly Young\nIncredibly Missed. pic.twitter.com/pKNI4tKiXz — Jimmy Page (@JimmyPage) May 18, 2017\nA mutual friend called me and tells me my bro passed away. #RIPChrisCornell You are a great artist Love to Vicki and fam @nilerodgers pic.twitter.com/FhG0fhT0q1 — Nile Rodgers (@nilerodgers) May 18, 2017\nSO SO stunned to hear about Chris Cornell! Such a terrible and sad loss! Thinking of his family tonight! RIP — Dave Navarro (@DaveNavarro) May 18, 2017\nI AM SO SADDENED BY CHRIS CORNELL PASSING. @soundgarden\nTOTAL SHOCK.GREAT MAN.GREAT BAND.GREAT LOSS. LOVE TO EVERYONE IN HIS WORLD. XXX — GAVIN ROSSDALE (@GavinRossdale) May 18, 2017\nSubmit your Newswire tips here.",
  "title": "R.I.P. Chris Cornell of Soundgarden and Audioslave",
  "url": "http://www.avclub.com/article/rip-chris-cornell-soundgarden-and-audioslave-255550?utm_medium%3DRSS%26utm_campaign%3Dfeeds"
}