{
  "author": "['Gil Kaufman']",
  "descendant": false,
  "description": "In his final days late Soundgarden singer Chris Cornell appeared happy and hopeful in a series of tweets about his excitement to be on the road with his band and his love for his wife.",
  "downloadDate": "2017-05-18 12:47:17",
  "filename": "articles_columns_rock_7800827_chris-cornell-recent-tweets-optimism-hope-love_1495111637.html",
  "image": "http://www.billboard.com/files/media/Chris-Cornell-Temple-of-the-Dog-billboard-1548.jpg",
  "language": "",
  "localpath": "/Users/felix/news-please//data/2017/05/18/billboard.com/articles_columns_rock_7800827_chris-cornell-recent-tweets-optimism-hope-love_1495111637.html",
  "modifiedDate": "2017-05-18 12:47:17",
  "pageTitle": "Chris Cornell's Recent Tweets Full of Optimism, Hope, Love | Billboard",
  "publish_date": "2017-05-18 00:00:00",
  "rss_title": "NULL",
  "sourceDomain": "billboard.com",
  "text": "Chris Cornell performs onstage at the Astoria on May 16, 2007 in London.\nThe rock world was devastated on Thursday morning (May 18) by the news that Soundgarden singer Chris Cornell has died at age 52. With no information known about the cause or circumstances of death at press time, one of the only places fans could go to get a glimpse of his final days was the singer's social media feed. There, they might have found evidence that Cornell appeared happy and hopeful in recent days, tweeting about his excitement playing shows with the reunited Soundgarden and pledging his love and devotion to wife Vicky Cornell.\nA look at some of the recent tweets from the band and Cornell:\nJust hours before his death, Cornell enthused about arriving in Detroit for the band's scheduled date at the Fox Theatre. Among the hashtags he included was #nomorebullshit. (Click here for a review of the Fox Theatre show.)\nOn Monday (May 15) night he gushed about the group's show in Kansas City at the Starlight Theatre with a quartet of pictures of the band and that night's hit-packed setlist.\nMuch thanks to Kansas City Mo and all of our friends there for blowing it up! @soundgarden 2017 pic.twitter.com/XOQgCKlub7 — Chris Cornell (@chriscornell) May 16, 2017\nHe celebrated his mother and his wife, Vicky, on Sunday (May 14) with a pair of sweet, thoughtful Mother's Day tweets. \"You are an angel and a lioness. The perfect mother and perfect wife,\" he wrote to Vicky.\nHappy Mother's Day to my mom @ToniKaras you thank for giving me the love of my life... — Chris Cornell (@chriscornell) May 14, 2017\nTo my @vickycornell you are an angel and a lioness. The perfect mother and the perfect wife. I love you! Happy #MothersDay2017 pic.twitter.com/Olv4Wyh1zD — Chris Cornell (@chriscornell) May 14, 2017\nThe group's twitter feed included a reminder about the show just hours before news of Cornell's death was revealed.\nSoundgarden take the stage at 8pm tonight at the @FoxTheatreDet. Doors open 7pm. — Soundgarden (@soundgarden) May 17, 2017\nAnd in a now wistful nod to the brotherhood and love the band seems to have found in middle age, a tweet from Tuesday (May 16) featured a quote from Cornell about what he looks forward to the most now. \"Is the camaraderie. It's what we missed when we weren't a band,\" he wrote over a vintage video of them packed into a touring van together.",
  "title": "Chris Cornell's Recent Tweets Full of Optimism, Hope, Love",
  "url": "http://www.billboard.com/articles/columns/rock/7800827/chris-cornell-recent-tweets-optimism-hope-love"
}