{
  "author": "['Etc Authors T Tom-Sykes', 'Etc Authors M Marlow-Stern', 'Tom Sykes', 'Marlow Stern']",
  "descendant": false,
  "description": "The Soundgarden, Audioslave, and Temple of the Dog singer passed away on Wednesday. His death was “sudden and unexpected,” but his life won’t soon be forgotten.",
  "downloadDate": "2017-05-18 12:47:32",
  "filename": "articles_2017_05_18_chris-cornell-dead-at-52-the-rock-wail-that-shook-the-earth_1495111652.html",
  "image": "http://img.thedailybeast.com/image/upload/v1495103418/GettyImages-483130703_fxjinj.jpg",
  "language": "en",
  "localpath": "/Users/felix/news-please//data/2017/05/18/thedailybeast.com/articles_2017_05_18_chris-cornell-dead-at-52-the-rock-wail-that-shook-the-earth_1495111652.html",
  "modifiedDate": "2017-05-18 12:47:32",
  "pageTitle": "Chris Cornell, Dead at 52: The Rock Wail That Shook the Earth",
  "publish_date": "2017-01-30 07:47:00",
  "rss_title": "NULL",
  "sourceDomain": "thedailybeast.com",
  "text": "His wail, a four-octave fusillade of shrieks dripping with sex, recalled Robert Plant on two packs a day. But Chris Cornell’s unmistakable voice fell silent on Wednesday night, as the singer died suddenly—and under mysterious circumstances—mere hours after performing a show in Detroit. He was 52 years old.\nJust eight hours before his passing was announced, the lead singer of the veteran Seattle rock outfit Soundgarden posted an excited comment to Twitter looking forward to his band’s gig that evening.\nIn a statement provided to media this morning, a rep for the band said Cornell died in Detroit, Michigan, on Wednesday night, and that his death was “sudden and unexpected.”\n“Chris Cornell passed away late last night in Detroit, MI. His wife Vicky and family were shocked to learn of his sudden and unexpected passing, and they will be working closely with the medical examiner to determine the cause,” the statement read. “They would like to thank his fans for their continuous love and loyalty and ask that their privacy be respected at this time.”\nOn Sunday, Cornell had posted an emotional tribute to his second wife to mark Mother’s Day:\nOne of the last great surviving grunge vocalists, Cornell was born in Seattle, Washington, in 1964, and it was there that the hard rock quartet Soundgarden was formed in 1984. Their third album, 1991’s million-selling Badmotorfinger, established the group as a force to be reckoned with in the west coast rock scene, earning the group a Grammy nomination for Best Metal Performance. But it was their fourth album, Superunknown, that propelled the group to rock stardom. On the back of hit singles “Spoonman,” “My Wave,” “Fell on Black Days,” and “Black Hole Sun”—the latter tune taking home an MTV Award for its surreal, eye-popping music video—the album sold 9 million copies, taking home two Grammys along the way.\nCornell’s impact on the ‘80s and ‘90s grunge scene was enormous, as Soundgarden’s fusion of Zeppelin and punk delivered a shot of adrenaline into a moribund rock scene left decimated by hair metal. Kurt Cobain would later credit Soundgarden as the main reason Nirvana signed to their first label, Sub Pop. Soundgarden would, along with Alice in Chains and Pearl Jam frontman Eddie Vedder, cameo in Cameron Crowe’s 1992 film Singles, chronicling intertwining love stories in Seattle’s grunge scene.\nThat wasn’t Cornell’s only connection to Pearl Jam. In 1990, following the loss of his friend and former roommate Andrew Wood to heroin, Cornell approached Wood’s bandmates in Mother Love Bone, Jeff Ament and Stone Gossard, about recording a tribute song. The gang eventually recorded an entire album, and named the project Temple of the Dog—taken from the Mother Love Bone song “Man of Golden Words.” Vedder would provide guest vocals on Temple of the Dog’s hit song “Hunger Strike,” and following the release of the self-titled album in 1991, Vedder, Ament, and Gossard would break off to form Pearl Jam.\nSoundgarden, meanwhile, broke up in 1997. But by 2001, Cornell had joined the remaining members of Rage Against the Machine—following the departure of singer Zack de la Rocha—in creating a new group: Audioslave. Exhibiting a more restrained, melancholic sound from Soundgarden and Rage, the group would go on to release several platinum-selling albums, spawning the radio hits “Be Yourself,” “Like a Stone,” and “Cochise,” with Cornell serving as singer and lyricist. The group broke up acrimoniously in 2007, only to reunite for a performance on January 20th of this year at Prophets of Rage’s Anti-Inaugural Ball—protesting the inauguration of President Donald Trump.\nIn addition to Soundgarden and Audioslave, Cornell released a trio of albums as a solo artist and co-wrote and performed the song “You Know My Name,” which served as the theme song to the 2006 James Bond blockbuster Casino Royale. Cornell also contributed songs to the soundtracks of Great Expectations and Mission: Impossible 2.\nHe was a rock god in every sense, with his distinctive shoulder-length tresses, toned torso, and piercing blue eyes. But like many of his grunge contemporaries, including the late Stone Temple Pilots singer Scott Weiland, the late Alice in Chains singer Layne Staley, and Cobain, who committed suicide in 1994, Cornell was plagued by drug and alcohol abuse.\n“We were all selling drugs by the time we were 12, or doing them,” he once said. “Pot or pills or anything that was easily available.”\nGet The Beast In Your Inbox! Daily Digest Start and finish your day with the top stories from The Daily Beast. Cheat Sheet A speedy, smart summary of all the news you need to know (and nothing you don't). By clicking “Subscribe,” you agree to have read the Terms of Use and Privacy Policy Subscribe Thank You! You are now subscribed to the Daily Digest and Cheat Sheet. We will not share your email with anyone for any reason.\nThe singer struggled during the recording of Audioslave’s 2002 self-titled debut album, eventually checking into drug rehab for several months and separating from his first wife Susan Silver—the manager of Soundgarden and Alice in Chains. He eventually sobered up by 2006.\n“It was a long period of coming to the realization that this way (sober) is better,” said Cornell. “Going through rehab, honestly, did help...it got me away from just the daily drudgery of depression and either trying to not drink or do drugs or doing them. They give you such a simple message, that any idiot can get… you have to want it and to not do that crap anymore or you will never stop and it will just kill you.”\nFollowing Audioslave’s split, Cornell reunited with his Soundgarden bandmates in 2010 for a series of live shows, later accompanied by 2012’s King Animal—their first studio album in 16 years. The group stayed intact and toured up until his death.\nLast year, Cornell opened up to 105.7 The Point radio station about the deaths of fellow grunge icons Weiland, Staley, and Cobain.\n“There’s kind of a history of sort of… not deifying, but glamorizing a little bit the ‘dead guy,’ whether it’s a rock star or a famous actor. Like James Dean, he only made three movies, and he’s one of the best-known actors of all time,” said Cornell. “And granted, I think everyone agreed that he was really talented. And he died in a sort of glamorous badass way, which was in a little race car on his way to a race, driving it himself. I think there’s something to the legend of that, and something to the story of that.”\nIt is not known as of yet how Cornell died, but in the annals of rock ‘n’ roll, it is all but guaranteed that he will go down a legend.\nCornell leaves behind his wife, Vicky, and three children.",
  "title": "Chris Cornell, Dead at 52: The Rock Wail That Shook the Earth",
  "url": "http://www.thedailybeast.com/articles/2017/05/18/chris-cornell-dead-at-52-the-rock-wail-that-shook-the-earth"
}