{
  "author": "['Buzzfeed News', 'Promoted By']",
  "descendant": false,
  "description": "",
  "downloadDate": "2017-05-18 12:47:36",
  "filename": "buzzfeednews_whats-going-on-in-the-news-today-may-18-17_1495111656.html",
  "image": "https://img.buzzfeed.com/buzzfeed-static/static/2017-05/18/6/campaign_images/buzzfeed-prod-fastlane-01/whats-going-on-in-the-news-today-2-16028-1495103301-9_dblbig.jpg",
  "language": "en",
  "localpath": "/Users/felix/news-please//data/2017/05/18/buzzfeed.com/buzzfeednews_whats-going-on-in-the-news-today-may-18-17_1495111656.html",
  "modifiedDate": "2017-05-18 12:47:36",
  "pageTitle": "What's Going On In The News Today?",
  "publish_date": "2017-05-18 00:00:00",
  "rss_title": "NULL",
  "sourceDomain": "buzzfeed.com",
  "text": "Soundgarden singer Chris Cornell has died at age 52. A special counsel has been been named to oversee the investigation into Russian interference in the 2016 US presidential election. And US Army whistleblower Chelsea Manning has been freed from prison after seven years.\nHERE ARE THE TOP STORIES Deputy Attorney General Rod Rosenstein has named former FBI director Robert Mueller to oversee the investigation into Russian influence in the 2016 election. The appointment ends widespread speculation about how Rosenstein would respond to the growing chorus of lawmakers and advocacy groups calling for such a move. President Trump’s decision to fire James Comey as FBI director on May 9 reignited pressure on Rosenstein to appoint a special counsel. Trump’s critics charged that the firing was rooted in Comey’s pursuit of the Russia probe — a claim the administration has denied — and a series of damaging news reports this week about Trump’s interactions with Russian officials and his exchanges with Comey focused the spotlight on Rosenstein. Trump issued a statement on Wednesday evening that didn’t directly mention Mueller or the special counsel appointment, saying only that he “looked forward to this matter concluding quickly.”\nMore from Washington, DC\nThe White House is in constant crisis mode 118 days into Donald Trump’s presidency — and Republicans on the outside are worrying about their panicked friends on the inside. Why don’t people quit now? For various reasons, they don’t see a mass exodus — voluntary or involuntary — coming anytime soon. Here’s why. President Donald J. Trump apparently only reads memos if his name — Donald J. Trump — is mentioned a lot. (Donald J. Trump) The president is leaving for his first international trip on Friday. He will travel to Saudi Arabia, Israel, Vatican City, Belgium, and Italy. And Trump is letting the nuclear deal with Iran live after months of uncertainty, but imposing new missile-related sanctions. Army whistleblower Chelsea Manning has been freed from prison after seven years. Her 35-year sentence was commuted by Obama. Manning, who announced she was transgender while in prison, leaked more than 700,000 military intelligence reports and documents to WikiLeaks in 2010. In 2010, when she went by the name Bradley Manning, the soldier downloaded hundreds of thousands of documents relating to the wars in Iraq and Afghanistan and then smuggled them out of her intelligence unit. It was reported that one of the CDs she used was disguised as a music disc labeled “Lady Gaga.” “Thank you to everyone for ensuring her safe release and respecting her privacy as she starts to adjust to life outside of prison and rebuild her life following seven years of confinement,” Manning’s lawyers said.\nFirst steps of freedom!! 😄 https://t.co/kPPWV5epwa #ChelseaIsFree\nWE’RE KEEPING AN EYE ON\nThe US has declined to grant visas to gay Chechens fleeing a wave of kidnappings, torture, and disappearances in the Russian region. A group of around 40 people from Chechnya are now in hiding in other parts of Russia, Russia LGBT Network spokesperson Svetlana Zakharova told BuzzFeed News, and are having difficulty securing visas that would allow them to flee the country. A US State Department spokesperson said in a statement provided on background that the department could not comment on the visa denials. The strongman who rules Chechnya with near impunity, Ramzan Kadyrov, is accused of having his critics hunted down both in other parts of Russia and outside Russia’s borders. More LGBT crackdown Activists are “really scared” after two Indonesian men were each sentenced to 85 lashes for having sex in Indonesia’s Aceh province. The two men — aged 20 and 23 — were allegedly caught having sex on March 28 when a group of vigilante enforcers entered a house and filmed them. Aceh has a special legal status allowing it to insert Sharia bylaws into the criminal code. In the province, ordinances criminalizing drinking alcohol, sex outside of marriage, and gay sex can be enforced against Muslims and non-Muslims. DID YOU HEAR ABOUT THIS? Soundgarden singer Chris Cornell has died at age 52. In a statement provided to BuzzFeed News, the rocker’s representative Brian Bumbery said Cornell died in Detroit on Wednesday night, and that it was “sudden and unexpected.” Cornell rose to prominence as the singer of Soundgarden, who became one of the seminal bands in the Seattle grunge scene in the late 1980s and early 1990s. He was famed for having one of the biggest rock vocal ranges of the era. Cornell had been on tour with Soundgarden and had tweeted about the concert in Detroit just eight hours before his death was announced.\nFor the latest news and updates, download the BuzzFeed News app for iOS and Android (available in Canadian, UK, Australian, and U.S. app stores).\nThis letter was edited and brought to you by BuzzFeed News. You can always reach us here.",
  "title": "What's Going On In The News Today?",
  "url": "https://www.buzzfeed.com/buzzfeednews/whats-going-on-in-the-news-today-may-18-17"
}