{
  "author": null,
  "descendant": false,
  "description": "During the last seven months of the 2016 presidential election.",
  "downloadDate": "2017-05-18 12:47:33",
  "filename": "cheats_2017_05_18_report-trump-campaign-had-18-undisclosed-contacts-with-russians_1495111653.html",
  "image": "http://img.thedailybeast.com/image/upload/v1495102258/170518-michael-flynn_fzbyp5.jpg",
  "language": "en",
  "localpath": "/Users/felix/news-please//data/2017/05/18/thedailybeast.com/cheats_2017_05_18_report-trump-campaign-had-18-undisclosed-contacts-with-russians_1495111653.html",
  "modifiedDate": "2017-05-18 12:47:33",
  "pageTitle": "Report: Trump Campaign Had 18 Undisclosed Contacts With Russians - The Daily Beast",
  "publish_date": "2017-01-30 07:47:00",
  "rss_title": "NULL",
  "sourceDomain": "thedailybeast.com",
  "text": "Former National Security Adviser Michael Flynn, along with other advisers to Donald Trump's presidential campaign, were in contact with Russians in at least 18 calls or emails during the last seven months of the election, according to records now under review by the FBI and congressional investigators. Reuters reports that at least six of the contacts were phone calls between Russian Ambassador to the U.S. Sergey Kislyak and Trump advisers—including Flynn. The news agency reports the interactions between Kislyak and Flynn increased during Trump's transition period, while the two men allegedly planned a method of communication between Russian President Vladimir Putin and President Trump, which could bypass national-security bureaucracy in the U.S.—both sides, according to Reuters, considered such bureaucracy hostile to improved relations. Those with knowledge of the contacts, who described them to Reuters, said there was not yet any evidence of collusion or wrongdoing in the records.",
  "title": "Report: Trump Campaign Had 18 Undisclosed Contacts With Russians",
  "url": "http://www.thedailybeast.com/cheats/2017/05/18/report-trump-campaign-had-18-undisclosed-contacts-with-russians"
}