{
  "author": null,
  "descendant": false,
  "description": "Six of the previously undisclosed contacts were phone calls between advisers of Russian diplomat Sergey Kislyak and Trump.",
  "downloadDate": "2017-05-18 12:47:19",
  "filename": "entry_trump-campaign-russia-ties_us_591d6dbfe4b03b485caebb05_1495111639.html",
  "image": "http://img.huffingtonpost.com/asset/1910_1000/591d7032270000520090ea53.jpeg?cache=lpqliur1fs",
  "language": "en",
  "localpath": "/Users/felix/news-please//data/2017/05/18/huffingtonpost.com/entry_trump-campaign-russia-ties_us_591d6dbfe4b03b485caebb05_1495111639.html",
  "modifiedDate": "2017-05-18 12:47:19",
  "pageTitle": "Trump Campaign Had At Least 18 Undisclosed Contacts With Russians, Sources Say | HuffPost",
  "publish_date": "2017-05-18 10:03:22",
  "rss_title": "NULL",
  "sourceDomain": "huffingtonpost.com",
  "text": "Michael Flynn and other advisers to Donald Trump’s campaign were in contact with Russian officials and others with Kremlin ties in at least 18 calls and emails during the last seven months of the 2016 presidential race, current and former U.S. officials familiar with the exchanges told Reuters.\nThe previously undisclosed interactions form part of the record now being reviewed by FBI and congressional investigators probing Russian interference in the U.S. presidential election and contacts between Trump’s campaign and Russia.\nSix of the previously undisclosed contacts described to Reuters were phone calls between advisers of Russian diplomat Sergey Kislyak and Trump, including Flynn, Trump’s first national security adviser, three current and former officials said.\nMario Tama via Getty Images After Vice President Mike Pence and others had denied in January that Trump campaign representatives had any contact with Russian officials, the White House later confirmed that Russian diplomat Sergey Kislyak had met then-Senator Jeff Sessions and National Security Adviser Michael Flynn.\nConversations between Flynn and Kislyak accelerated after the Nov. 8 vote as the two discussed establishing a back channel for communication between Trump and Russian President Vladimir Putin that could bypass the U.S. national security bureaucracy, which both sides considered hostile to improved relations, four current U.S. officials said.\nIn January, the Trump White House initially denied any contacts with Russian officials during the 2016 campaign. The White House and advisers to the campaign have since confirmed four meetings between Kislyak and Trump advisers during that time.\nThe people who described the contacts to Reuters said they had seen no evidence of wrongdoing or collusion between the campaign and Russia in the communications reviewed so far. But the disclosure could increase the pressure on Trump and his aides to provide the FBI and Congress with a full account of interactions with Russian officials and others with links to the Kremlin during and immediately after the 2016 election.\nThe White House did not respond to requests for comment. Flynn’s lawyer declined to comment. In Moscow, a Russian foreign ministry official declined to comment on the contacts and referred Reuters to the Trump administration.\nSeparately, a spokesman for the Russian embassy in Washington said: “We do not comment on our daily contacts with the local interlocutors.”\nThe 18 calls and electronic messages took place between April and November 2016 as hackers engaged in what U.S. intelligence concluded in January was part of a Kremlin campaign to discredit the vote and influence the outcome of the election in favor of Trump over his Democratic challenger, former secretary of state Hillary Clinton.\nThose discussions focused on mending U.S.-Russian economic relations strained by sanctions imposed on Moscow, cooperating in fighting Islamic State in Syria and containing a more assertive China, the sources said.\nJoshua Roberts / Reuters In January, Trump's White House denied any contacts with Russian officials during the 2016 campaign. The White House and advisers to the campaign have since confirmed four meetings.\nMembers of the Senate and House intelligence committees have gone to the CIA and the National Security Agency to review transcripts and other documents related to contacts between Trump campaign advisers and associates and Russian officials and others with links to Putin, people with knowledge of those investigations told Reuters.\nThe U.S. Justice Department said on Wednesday it had appointed former FBI Director Robert Mueller as special counsel to investigate alleged Russian meddling in the U.S. presidential campaign and possible collusion between Trump’s campaign and Russia. Mueller will now take charge of the FBI investigation that began last July. Trump and his aides have repeatedly denied any collusion with Russia.\n‘IT’S RARE’\nIn addition to the six phone calls involving Kislyak, the communications described to Reuters involved another 12 calls, emails or text messages between Russian officials or people considered to be close to Putin and Trump campaign advisers.\nOne of those contacts was by Viktor Medvedchuk, a Ukrainian oligarch and politician, according to one person with detailed knowledge of the exchange and two others familiar with the issue.\nIt was not clear with whom Medvedchuk was in contact within the Trump campaign but the themes included U.S.-Russia cooperation, the sources said. Putin is godfather to Medvedchuk’s daughter.\nMedvedchuk denied having any contact with anyone in the Trump campaign.\n“I am not acquainted with any of Donald Trump’s close associates, therefore no such conversation could have taken place,” he said in an email to Reuters.\nIn the conversations during the campaign, Russian officials emphasized a pragmatic, business-style approach and stressed to Trump associates that they could make deals by focusing on common economic and other interests and leaving contentious issues aside, the sources said.\nVeterans of previous election campaigns said some contact with foreign officials during a campaign was not unusual, but the number of interactions between Trump aides and Russian officials and others with links to Putin was exceptional.\n“It’s rare to have that many phone calls to foreign officials, especially to a country we consider an adversary or a hostile power,” Richard Armitage, a Republican and former deputy secretary of state, told Reuters.\nFLYNN FIRED\nBeyond Medvedchuk and Kislyak, the identities of the other Putin-linked participants in the contacts remain classified and the names of Trump advisers other than Flynn have been “masked” in intelligence reports on the contacts because of legal protections on their privacy as American citizens. However, officials can request that they be revealed for intelligence purposes.\nU.S. and allied intelligence and law enforcement agencies routinely monitor communications and movements of Russian officials.\nAfter Vice President Mike Pence and others had denied in January that Trump campaign representatives had any contact with Russian officials, the White House later confirmed that Kislyak had met twice with then-Senator Jeff Sessions, who later became attorney general.\nKislyak also attended an event in April where Trump said he would seek better relations with Russia. Senior White House adviser Jared Kushner, Trump’s son-in-law, also attended that event in Washington. In addition, Kislyak met with two other Trump campaign advisers in July on the sidelines of the Republican convention.",
  "title": "Trump Campaign Had At Least 18 Undisclosed Contacts With Russians, Sources Say",
  "url": "http://www.huffingtonpost.com/entry/trump-campaign-russia-ties_us_591d6dbfe4b03b485caebb05"
}