{
  "author": null,
  "descendant": false,
  "description": "",
  "downloadDate": "2017-05-18 12:47:16",
  "filename": "homenews_administration_334001-trump-camp-had-at-least-18-undisclosed-contacts-with-russians-report_1495111636.html",
  "image": "http://thehill.com/sites/default/files/trumpdonald_051717getty2.jpg",
  "language": "",
  "localpath": "/Users/felix/news-please//data/2017/05/18/thehill.com/homenews_administration_334001-trump-camp-had-at-least-18-undisclosed-contacts-with-russians-report_1495111636.html",
  "modifiedDate": "2017-05-18 12:47:16",
  "pageTitle": "Trump campaign had at least 18 undisclosed contacts with Russians: report | TheHill",
  "publish_date": "2017-05-18 07:16:30",
  "rss_title": "NULL",
  "sourceDomain": "thehill.com",
  "text": "Advisers to President Trump's campaign reportedly had at least 18 undisclosed contacts with Russian officials and those with ties to Moscow.\nReuters reported that former national security adviser Michael Flynn, along with other advisers to Trump, had contact with Russians in at least 18 calls or emails during the last seven months of Trump's 2016 presidential campaign.\nOf the 18 undisclosed contacts, six were phone calls between Russia's ambassador to the U.S., Sergey Kislyak, and advisers to Trump, Reuters reported, citing current and former officials.\nADVERTISEMENT\nThe calls and messages happened between April 2016 and November 2016, according to Reuters. The communications covered issues such as improving the U.S.-Russia economic relations and fighting the Islamic State in Iraq and Syria (ISIS).\nOfficials said Flynn talked with Kislyak ahead of the president's inauguration about creating a back channel for communication between Trump and Russia.\nOfficials said they had no evidence of collusion between the Trump campaign and Russia.\nThe report comes after the Justice Department on Wednesday appointed former FBI Director Robert Mueller as special counsel to investigation Russia's involvement in the 2016 presidential election.\nDemocrats had clamored for Deputy Attorney General Rod Rosenstein to appoint a special prosecutor in the wake of reports that fired FBI Director James Comey penned a memo documenting a request from trump that he \"let go\" of the investigation into Flynn.\nRosenstein is overseeing the Russia probe in the wake of the recusal of Attorney General Jeff Sessions, who stepped aside over his failure to disclose a meeting with Kislyak.\nThe president has many times dismissed the investigation into his campaign's ties with Russia. The Trump White House in January said it had not had any contacts with the Russians.",
  "title": "Trump campaign had at least 18 undisclosed contacts with Russians: report",
  "url": "http://thehill.com/homenews/administration/334001-trump-camp-had-at-least-18-undisclosed-contacts-with-russians-report"
}