{
  "author": null,
  "descendant": false,
  "description": "Rod Rosenstein is expected to be grilled Thursday on back-to-back political bombshells that have rattled the nation’s capital.",
  "downloadDate": "2017-05-18 12:47:17",
  "filename": "homenews_senate_333972-rosenstein-to-be-grilled-today-on-trump-bombshells_1495111637.html",
  "image": "http://thehill.com/sites/default/files/rosensteinrod_051117getty_lead.jpg",
  "language": "",
  "localpath": "/Users/felix/news-please//data/2017/05/18/thehill.com/homenews_senate_333972-rosenstein-to-be-grilled-today-on-trump-bombshells_1495111637.html",
  "modifiedDate": "2017-05-18 12:47:17",
  "pageTitle": "Rosenstein to be grilled today on Trump bombshells | TheHill",
  "publish_date": "2017-05-18 06:00:25",
  "rss_title": "NULL",
  "sourceDomain": "thehill.com",
  "text": "Rod Rosenstein is expected to be grilled Thursday on back-to-back political bombshells that have rattled the nation’s capital.\nThe deputy attorney general will brief all senators on Thursday afternoon behind closed doors, giving many lawmakers their first face-to-face meeting with an administration official since President Trump’s surprise decision to fire former FBI Director James Comey.\nADVERTISEMENT\nIn the wake of intense pressure from Democrats, Rosenstein announced Wednesday evening that former FBI Director Robert Mueller will serve as special counsel to probe any election collusion between Russia and the Trump campaign. Rosenstein had previously declined to appoint a special counsel.\nSenators will lob questions at the newly minted deputy attorney general, who recommended Comey’s firing in a memo to Trump before the FBI chief was terminated last week. The timing of Rosenstein’s decision to tap Mueller will surely come up on Thursday and whether Rosenstein consulted the White House before making his decision.\nAsked on what he wanted to hear from Rosenstein, Sen. Lindsey Graham Lindsey GrahamRosenstein to be grilled today on Trump bombshells Second Senate committee invites Comey to publicly testify Committees clamor for Comey's testimony MORE (R-S.C.) said, “It’s pretty simple: Did you support the decision to fire [Comey] and tell us about the letter and how it came about.”\nAnother issue that is likely to come up is whether Rosenstein was aware of the memo that Comey reportedly wrote after Trump allegedly suggested that the FBI director back off in the probe of former national security adviser Michael Flynn.\nRosenstein became a lightning rod over Comey’s firing when the White House initially tried to hang the decision on a memo from Rosenstein that criticized Comey’s handling of the investigation into Democratic presidential nominee Hillary Clinton Hillary Rodham ClintonTrump: I’m victim of 'single greatest witch hunt' Sinclair deal puts heat on FCC Rosenstein to be grilled today on Trump bombshells MORE’s use of a private email server while secretary of State.\nRosenstein’s memo stated that “the FBI’s reputation and credibility have suffered substantial damage” since 2016. Trump later told NBC News that he was prepared to fire Comey no matter the recommendation from Rosenstein and Attorney General Jeff Sessions Jeff SessionsNew policies perpetuate mass incarceration Congress should reverse Sessions on criminal justice and drug war Trump campaign had at least 18 undisclosed contacts with Russians: report MORE.\nThe political landmines awaiting Rosenstein are a dramatic shift from the bipartisan praise he received during his confirmation hearing. Democrats lauded him as a potential check on Sessions, whom they don’t trust with the Russia investigation and worry will steer the administration to the hard right.\nOnly six Democrats — four of whom are viewed as potential 2020 presidential candidates — voted against Rosenstein’s nomination. By comparison, only one — Sen. Joe Manchin Joe ManchinRosenstein to be grilled today on Trump bombshells Heitkamp breaks with Dems on regulations Convicted ex-coal boss asks Trump to ‘get to the truth’ on mine disaster MORE (W.Va.) — voted for Sessions. All Republicans backed Rosenstein in the 94-6 roll call.\nRosenstein, 52, has been involved in many high-profile cases at the Justice Department. For example, then-Attorney General Eric Holder Eric H. HolderRosenstein to be grilled today on Trump bombshells California proposes budget increase to fight Trump Rand Paul: Sessions's sentencing plan would ruin lives MORE tapped Rosenstein to find out who was leaking classified information about the U.S. cyberattack efforts against Iran. Retired Marine Gen. James Cartright subsequently pleaded guilty.\nSenate Minority Leader Charles Schumer Charles SchumerThe Democrats can be great again, here’s how Five things to know about the Justice Department’s choice for special counsel Overnight Defense: Justice Department appoints special counsel for Russia probe | Fallout from Comey memo continues | Trump admin renews Iran sanctions relief MORE (D-N.Y.) voted to confirm Rosenstein, saying the nominee had a “reputation for integrity.”\nSen. Dianne Feinstein Dianne FeinsteinRosenstein to be grilled today on Trump bombshells Second Senate committee invites Comey to publicly testify Committees clamor for Comey's testimony MORE (D-Calif.), the ranking member on the Judiciary Committee, also backed Rosenstein because of his “impressive credentials” while also warning against the danger of the Justice Department becoming politicized.\nBut that admiration for Rosenstein has dissolved into frustration and confusion for many Democrats, who had been irritated with Rosenstein’s initial reluctance to appoint a special counsel.\nFeinstein and Sen. Dick Durbin Dick DurbinCongress should reverse Sessions on criminal justice and drug war Rosenstein to be grilled today on Trump bombshells Dem lawmakers voice shock, outrage on Comey memo MORE (Ill.), the No. 2 Senate Democrat, had explicitly called for Rosenstein to resign if he refused to name a special counsel.\nWhile Thursday’s briefing is not open to the press, it’s likely that details of the meeting will be leaked.\nSenate Republicans had suggested a special counsel wasn’t necessary, noting ongoing investigations had already begun — including one by the Senate Intelligence Committee. However, a handful of moderate GOP lawmakers had left the door open to a special counsel.\nThe push for Rosenstein to testify is the first of a growing list of Democratic demands in the wake of Comey’s firing. Democrats also want Sessions to meet with senators, Trump to release any potential recordings of his conversations and Comey to testify publicly.\nThe Senate Intelligence Committee has issued an invitation to Comey to testify before the committee, and the Senate Judiciary Committee is expected to issue a similar invitation.\nSen. Sheldon Whitehouse Sheldon WhitehouseRosenstein to be grilled today on Trump bombshells Second Senate committee invites Comey to publicly testify Second Senate panel to invite Comey to testify MORE (D-R.I.) called the briefing with Rosenstein an “important step” before pivoting to the importance of having Comey himself come and speak to members about the reported memo.\nAsked if he is hopeful that Rosenstein would be able to provide clarity, Sen. John Thune John ThuneRosenstein to be grilled today on Trump bombshells Key chairman open to delaying repeal of ObamaCare mandate Senate GOP warms to larger insurance subsidies for older and low-income people MORE (R-S.D.) responded: “I would like to think he is in the position to know the answer to a lot our questions, so I think that would be helpful. But I also think it’s important that Comey appear here and speak to members of Congress in an open setting.”",
  "title": "Rosenstein to be grilled today on Trump bombshells",
  "url": "http://thehill.com/homenews/senate/333972-rosenstein-to-be-grilled-today-on-trump-bombshells"
}