{
  "author": null,
  "descendant": false,
  "description": "Democratic leaders have a message for those members of their caucus beating the drum to impeach President Trump: not so fast.",
  "downloadDate": "2017-05-18 12:47:18",
  "filename": "homenews_house_333982-dems-walk-tightrope-on-impeachment_1495111638.html",
  "image": "http://thehill.com/sites/default/files/greenal_051717gn_lead.jpg",
  "language": "",
  "localpath": "/Users/felix/news-please//data/2017/05/18/thehill.com/homenews_house_333982-dems-walk-tightrope-on-impeachment_1495111638.html",
  "modifiedDate": "2017-05-18 12:47:18",
  "pageTitle": "Dems walk tightrope on impeachment | TheHill",
  "publish_date": "2017-05-17 23:08:24",
  "rss_title": "NULL",
  "sourceDomain": "thehill.com",
  "text": "Democratic leaders have a message for those members of their caucus beating the drum to impeach President Trump: not so fast.\n“I would suggest … there needs to be a full investigation first,” Rep. Joseph Crowley (N.Y.), chairman of the House Democratic Caucus, said Wednesday. “We need to get to the facts, and let the facts lead where they may.”\nIn the eyes of several Democrats, however, the facts already lead to impeachment.\nThe Justice Department on Wednesday night announced it was naming a special counsel to investigate Russia’s involvement in the 2016 presidential election, a response to longstanding calls from Democrats.\nADVERTISEMENT\nFormer FBI Director Robert Mueller, a former prosecutor who served a 12-year term at the helm of the bureau, was named to the position by deputy attorney general Rod Rosenstein.\nBefore that news broke, Democrats took steps Wednesday to express their case for impeachment following new reports suggesting Trump tried to block an FBI probe into his former national security adviser, Michael Flynn.\nRep. Maxine Waters (D-Calif.) spoke out at a closed-door House Democratic Caucus meeting Wednesday morning to highlight the urgency of removing Trump, whom the Democrats increasingly see as a national security liability.\nAlmost simultaneously, Rep. Al Green Al GreenDems walk tightrope on impeachment Overnight Defense: Justice Department appoints special counsel for Russia probe | Fallout from Comey memo continues | Trump admin renews Iran sanctions relief McCain: Talk of impeaching Trump not ‘rational’ MORE (D-Texas) took to the House floor to trumpet the impeachment call he’d sounded earlier in the week. He characterized his decision as a “position of conscience.”\n“There is a belief in this country that no one is above the law, and that includes the president,” Green said. “This is where I stand; I will not be moved.”\nThe impeachment debate is forcing Democratic leaders to walk a fine line in their approach to the ongoing Russia-Trump saga. On one hand, the Democrats want to keep the pressure on the White House and tap the energy the remarkable story is generating among members of their base, many of whom support the impeachment route. On the other, they don’t want to politicize their calls for an independent investigation.\n“We have to be circumspect as we look at this tale of horrors,” said Rep. Emanuel Cleaver (D-Mo.). “Because we should not give the impression that we are obsessed with removing Donald Trump Donald TrumpThe Democrats can be great again, here’s how The Memo: GOP talk of impeachment highlights Trump’s troubles Sherrod Brown looks to defy Trump trend in Ohio MORE from office — it will only harden his supporters.\n“Based on what I’ve read and heard, Mr. Trump is in trouble, and he doesn’t need any help to get into deeper trouble.”\nTop Democratic leaders insist they’re not putting any pressure on their troops to shy away from impeachment calls.\n“Members can come to their own conclusions, and we don’t pretend to stand here and speak on behalf of every single individual member of our caucus,” Crowley said.\nBut leaders are also making clear they don’t support impeachment.\nHouse Minority Leader Nancy Pelosi (D-Calif.) this week downplayed any impeachment calls as “a reflection” of what a few lawmakers “are hearing in their own constituencies.”\n“They know I don’t subscribe to that,” she said during a CNN town hall event.\nRep. Steny Hoyer (D-Md.), the Democratic whip, said Tuesday that any talk of impeachment is premature.\n“We need to get the facts first.”\nAnd during Wednesday’s caucus meeting, Rep. Adam Schiff Adam SchiffDems walk tightrope on impeachment Intel panels: House, Senate Russia probes to proceed Special prosecutor appointment gets bipartisan praise MORE (Calif.), the senior Democrat on the House Intelligence Committee, addressed the group in an effort to discourage the impeachment push.\n“We ought to keep our focus on finding out the facts in the first instance. And no one ought to, in my view, rush to embrace the most extraordinary remedy that involves the removal of the president from office,” Schiff told reporters afterward.\n“It cannot be perceived as an effort to nullify the election by other means.”\nIt’s not the first time Democratic leaders have tamped down the efforts of angry caucus members seeking to impeach a Republican president. In 2006, several Democrats, including veteran Rep. John Conyers (D-Mich.), launched a bid to impeach then-President George W. Bush over his handling of the Iraq War and the administration’s warrantless surveillance programs.\nPelosi, who was then, as now, minority leader, quashed that effort out of concern that Republicans would use it on the campaign trail to energize GOP voters with warnings that Bush would be imperiled if the Democrats won the Speaker’s gavel. She did, and no impeachment process followed.\nStill, Green said Wednesday that, while he hasn’t introduced the articles of impeachment that would start the process, “I will do that if it is not done by others.”\nHe didn’t say when.\nBefore the Mueller announcement, Democratic leaders were pressing ahead with their investigative strategy. On Wednesday, they unveiled a discharge petition on legislation creating an independent, outside panel — similar to the 9/11 Commission — to take the lead in the Russia investigation.\nRep. Elijah Cummings (D-Md.), a lead sponsor of the bill, said such a panel might dig up information that eventually leads to impeachment proceedings, though Democrats need to be patient and take the process one step at a time.\n“I just want to get the information,” he said. “Will it lead to impeachment? I don’t know.”\nThere’s no denying, however, that more and more Democrats are mentioning impeachment since Trump’s decision last week to fire former FBI Director James Comey, who was leading a probe into Russia’s ties to the White House. And Tuesday’s New York Times report saying Trump pressed Comey to drop the Flynn probe seems to have accelerated the trend.\n“We are rapidly approaching an impeachment process,” Rep. Hank Johnson (D-Ga.) said Wednesday.\nRep. John Yarmuth John YarmuthDems walk tightrope on impeachment House Budget chair to push for Medicaid changes Pelosi: New ObamaCare repeal bill is a ‘a very sad, deadly joke’ MORE (D-Ky.) said this week’s revelation of the Comey memo “was a game-changer.”\nAnd Rep. John Lewis (D-Ga.) said he is getting closer to supporting impeachment with each new development.\n“We’re coming very, very close,” Lewis said.\n“The drip-drip just cannot continue,” he added. “We’ve got to save the country.”",
  "title": "Dems walk tightrope on impeachment",
  "url": "http://thehill.com/homenews/house/333982-dems-walk-tightrope-on-impeachment"
}