{
  "author": "['Buzzfeed News Reporter', 'Promoted By']",
  "descendant": false,
  "description": "",
  "downloadDate": "2017-05-18 12:47:39",
  "filename": "mbvd_a-tulsa-police-officer-who-fatally-shot-unarmed-black-man_1495111659.html",
  "image": "https://img.buzzfeed.com/buzzfeed-static/static/2017-05/18/7/campaign_images/buzzfeed-prod-fastlane-01/the-tulsa-police-officer-who-fatally-shot-terence-2-19545-1495108774-0_dblbig.jpg",
  "language": "en",
  "localpath": "/Users/felix/news-please//data/2017/05/18/buzzfeed.com/mbvd_a-tulsa-police-officer-who-fatally-shot-unarmed-black-man_1495111659.html",
  "modifiedDate": "2017-05-18 12:47:39",
  "pageTitle": "The Tulsa Police Officer Who Fatally Shot Terence Crutcher Was Found Not Guilty",
  "publish_date": "2017-05-18 00:00:00",
  "rss_title": "NULL",
  "sourceDomain": "buzzfeed.com",
  "text": "After deliberating for more than nine hours, a jury found Tulsa Police Department Officer Betty Shelby not guilty of manslaughter.\nAfter more than nine hours of deliberation, a jury found a Tulsa police officer charged in the fatal shooting of an unarmed black man not guilty Wednesday. Officer Betty Shelby, a white woman, was charged with manslaughter in September 2016 for fatally shooting an unarmed black man, Terence Crutcher, after his car stalled. The shooting was captured on dashcam footage and in an aerial video.\nAccording to an affidavit, Crutcher did not respond to a question from Shelby, and instead walked towards his car with his hands in the air. Shelby followed him with her gun drawn, while another officer arrived and told her he had his taser ready. As Crutcher reached into his car through the driver-side window, the other officer deployed his taser. Shelby then fired her gun.\nProsecutors argued that Shelby overreacted, given that Crutcher had his arms up and was not combative. Shelby testified in district court that she shot the 40-year-old out of fear because he failed to obey her commands and she believed he was reaching into his car for a gun, the Associated Press reported. Shelby testified that she also suspected Crutcher was under the influence of PCP, or phencyclidine, a powerful hallucinogenic that often makes people act in unpredictable ways. An autopsy showed PCP was in Crutcher's system and police said they found evidence of it in his vehicle, according to the AP.\nCrutcher's family has said that police have attempted to \"demonize\" Crutcher for having drugs and distract from the fact that he did not have a gun at the time of the encounter.\nSpeaking to reporters Wednesday night, Tiffany Crutcher, Terence's twin sister, called the verdict “a tough pill to swallow,” according to KFOR. “Now we have to go home and hug on his kids,” she added. Tulsa District Attorney Stephen Kunzweiler focused on the fact that the \"case had to be tried by a jury\" in a statement sent to BuzzFeed News. \"It was, is and will continue to be a difficult issue to discuss for my community.\" \"There can be no doubt that the decision rendered by this jury was only after a long and deliberative process,\" the statement continued. The shooting was one of a series of recent incidents involving white police officers killing unarmed black men that have prompted calls for police reform and garnered attention from the Black Lives Matter movement. Following the acquittal, Oklahoma Governor Mary Fallin issued a statement calling for calm. \"Those who disagree with the verdict have the right to express their opinions,\" she said. \"I just ask that they do so in a peaceful manner.\"\nStill, by late Wednesday night, protesters had started to gather near the courthouse and blocked a road.\nProtestors have blocked the intersection at 5th & Denver. @TulsaPolice keeping distance #BettyShelby… https://t.co/X1yDeHTBzc\nProtesters could be heard yelling \"No justice, no peace,\" in one video posted to social media.\nProtesters blocking the road outside the courtroom. #TerenceCrutcher #BettyShelby",
  "title": "The Tulsa Police Officer Who Fatally Shot Terence Crutcher Was Found Not Guilty",
  "url": "https://www.buzzfeed.com/mbvd/a-tulsa-police-officer-who-fatally-shot-unarmed-black-man"
}