{
  "author": "['Jason Newman', 'Kory Grow']",
  "descendant": false,
  "description": "Chris Cornell, lead singer for Soundgarden, has died at age 52.",
  "downloadDate": "2017-05-18 12:47:30",
  "filename": "music_news_soundgardens-chris-cornell-dead-at-52-w482882_1495111650.html",
  "image": "http://img.wennermedia.com/social/chris-cornell-dead-2017-eead7a36-ceb6-4dfb-afe6-98f47ca1f886.jpg",
  "language": "",
  "localpath": "/Users/felix/news-please//data/2017/05/18/rollingstone.com/music_news_soundgardens-chris-cornell-dead-at-52-w482882_1495111650.html",
  "modifiedDate": "2017-05-18 12:47:30",
  "pageTitle": "Soundgarden's Chris Cornell Dead at 52 - Rolling Stone",
  "publish_date": "2017-05-18 10:54:00",
  "rss_title": "NULL",
  "sourceDomain": "rollingstone.com",
  "text": "Chris Cornell, a dynamic vocalist and guitarist whose versatile showmanship as Soundgarden and Temple of the Dog's frontman was a signpost of the grunge era, died Wednesday night. Detroit police are investigating the death as a possible suicide, according to The Associated Press. He was 52.\nRelated Chris Cornell: The Rolling Stone Interview The Soundgarden singer on the Seattle rock scene's end of innocence\nThe singer was in Detroit at the time of his death, having played a show with Soundgarden, who were on tour, earlier in the evening. \"His wife, Vicky, and family were shocked to learn of his sudden and unexpected passing, and they will be working closely with the medical examiner to determine the cause,\" his publicist said in a statement. They also asked for fans to respect their privacy.\nCornell's artistry was marked by his impressive multi-octave vocal range and a rare sensitivity for heavy music. With Soundgarden, he could shift between raging metal declarations (\"Jesus Christ Pose\"), somber mood pieces (\"Fell on Black Days\") and psychedelia (\"Black Hole Sun\") with ease.\nAfter years of playing generally aggressive music in the Eighties, his full range of musical expression showed in 1991 when he created Temple of the Dog – a supergroup featuring Soundgarden and eventual Pearl Jam members – to pay tribute to late Mother Love Bone frontman Andrew Wood. He later explored heavier territory with members of Rage Against the Machine in the supergroup Audioslave and his sensitive side as a solo artist, with frequent acoustic shows in recent years.\nThe band formed in 1984 after a period where Cornell and bassist Hiro Yamamoto played together in a band called the Shemps, eventually inviting guitarist Kim Thayil to play with them. They chose the name Soundgarden in tribute to a public organ-pipe sculpture that created sounds in the wind. With the arrival of drummer Scott Sundquist, Cornell moved to singing full-time and the next year they recorded three songs for the pivotal Deep Six compilation, which placed them alongside fellow grunge architects Melvins and Green River, the latter of which contained future Pearl Jam and Mudhoney members. Soundgarden put out their debut single, the trippy, ominous \"Hunted Down,\" and EP, Screaming Life, in 1987.\nAfter the release of another EP – 1988's Fopp, whose title track is improbably an Ohio Players cover and marked the arrival of drummer Matt Cameron – Soundgarden came into their own on their first full-length, 1990's Ultramega OK. That record featured the brooding, dramatic Cornell standout \"Beyond the Wheel,\" which showed off his impressive vocal ability and the band's proclivity for coupling heavy-metal riffing with shuddering noise affectations, foreshadowing grunge. They would later streamline this sound on 1989's more metallic Louder Than Love, a locomotive onslaught of chunky riffs, alpha-male fantasies and quirky humor.\nOn March 19th, 1990, Cornell's former roommate, Andrew Wood, died of a heroin overdose and the death shook the Soundgarden frontman. He wrote the songs \"Reach Down\" and \"Say Hello 2 Heaven\" as a visceral reaction to his friend's death and asked Wood's Mother Love Bone bandmates, Stone Gossard and Jeff Ament, if they would record the songs with him. With the addition of local guitarist Mike McCready, an unknown guest vocalist at the time named Eddie Vedder and Soundgarden's Cameron, the group became Temple of the Dog. Their self-titled album came out in 1991 and eventually went platinum; the group, sans the Soundgarden members, subsequently re-formed as Pearl Jam and issued their debut, Ten, the same year.\nMeanwhile, Cornell and his bandmates were picking themselves up after the exit of Yamamoto, whom they replaced with bassist Ben Shepherd. Feeling energized creatively from Temple of the Dog, Cornell wrote a number of songs that would become singles on their 1991 album, Badmotorfinger.\nThe group's follow-up, 1994's Superunknown, would be their biggest release: a Number One album that would go on to be certified five-times platinum thanks to a string of hits. A creepy video for the especially psychedelic number \"Black Hole Sun\" helped the tune become the group's most enduring song, while \"Spoonman,\" \"The Day I Tried to Live,\" \"My Wave\" and \"Fell on Black Days\" dominated both the mainstream-rock and alternative charts that year.\nBut Cornell's musical identity extended well past the band. The singer would release five solo albums and three with Audioslave, the latter formed with Rage Against the Machine's Tom Morello, Tim Commerford and Brad Wilk.\nHe most recently released \"The Promise,\" for the upcoming movie about the Armenian genocide of the same name.\nThis story is developing",
  "title": "Soundgarden's Chris Cornell Dead at 52",
  "url": "http://www.rollingstone.com/music/news/soundgardens-chris-cornell-dead-at-52-w482882"
}