{
  "author": "['Susan Hogan Is Deputy Editor Of The Morning Mix Team. Follow Her']",
  "descendant": false,
  "description": "The shooting generated protests by Black Lives Matter.",
  "downloadDate": "2017-05-18 12:47:41",
  "filename": "news_morning-mix_wp_2017_05_18__1495111661.html",
  "image": "https://images.washingtonpost.com/?url=http://img.washingtonpost.com/news/morning-mix/wp-content/uploads/sites/21/2017/05/crop_358KILLINGS_BY_POLICE-TULSA_31044-84714.jpg&w=1484&op=resize&opt=1&filter=antialias",
  "language": "en",
  "localpath": "/Users/felix/news-please//data/2017/05/18/washingtonpost.com/news_morning-mix_wp_2017_05_18__1495111661.html",
  "modifiedDate": "2017-05-18 12:47:41",
  "pageTitle": "Tulsa officer acquitted in fatal shooting of unarmed black man - The Washington Post",
  "publish_date": "2017-05-18 00:00:00",
  "rss_title": "NULL",
  "sourceDomain": "washingtonpost.com",
  "text": "Tulsa Police officer Betty Shelby arrives at the Tulsa County Courthouse (Mike Simons/Tulsa World via AP)\nAn Oklahoma jury on Wednesday acquitted a white police officer in the fatal shooting of an unarmed black man in Tulsa last year.\nTulsa officer Betty Shelby was found not guilty in the Sept. 16 shooting of 40-year-old Terence Crutcher in a case that garnered national attention and widespread protest from Black Lives Matter.\nJurors deliberated more than nine hours before delivering the verdict. Afterword, Gov. Mary Fallin called for calm as dozens of protesters outside the courthouse chanted: “No justice. No peace. No racist police,” the Associated Press reported.\nThe verdict drew a sharp response from the Crutcher’s father. “Let it be known that I believe in my heart that Betty Shelby got away with murder,” the Rev. Joey Crutcher said.\n[Photo gallery: The scene after an unarmed black man was fatally shot by a Tulsa police officer]\nBetty Shelby (Tulsa Police Department)\nShelby, then a five-year veteran of the Tulsa Police Department, said she had ordered Crutcher to lie on the ground, and fired her weapon out of fear when he didn’t obey and appeared to reach inside his vehicle for what she thought was a gun.\nCrutcher, a father of four and aspiring gospel singer, was shot as he stood by his stalled SUV. At about the same time, another officer fired a stun gun.\nInstead of checking on Crutcher after the shooting, Shelby walked to the back of a patrol car, where another police officer attempted to comfort her, police video footage showed.\nShelby said she thought Crutcher was under the influence of PCP, a hallucinogenic drug that can make people aggressive. An autopsy showed PCP was in Crutcher’s system. Police also found a vial of PCP in Crutcher’s vehicle.\nHer lawyers argued that Crutcher was combative in the two minutes before police cameras began rolling.\nBut prosecutors told jurors that Crutcher had his hands in the air and did not resist. That argument was partly confirmed in a police video taken by dashboard camera and another taken from a police helicopter that showed Crutcher walking away from Shelby with his hands above his head. They said Crutcher overreacted.\n[Black man shot by Tulsa police had hands ‘in the air,’ says pastor who reviewed video of the shooting]\nShelby was charged six days after the shooting by Tulsa County District Attorney Steve Kunzweiler. The affidavit said Shelby “reacted unreasonably” and become “emotionally involved to the point that she overreacted.”\nCrutcher’s family said that police had “demonized” their son and played up the PCP angle, while downplaying the fact that he was not armed. In the moments before Crutcher was shot, an officer in a police helicopter was overhead referring to Crutcher as a “big bad dude” — a description the family found particularly offensive.\n[‘He was my compassionate son,’ Terence Crutcher’s mother says after fatal shooting in Tulsa]\n“That big, bad dude mattered,” Crutcher’s twin sister, Tiffany, said after the shooting. “That big bad dude was a father, that big bad dude was a son, that big bad dude was enrolled at Tulsa Community College just wanting to make us all proud, that big bad dude loved God, that big bad dude was in church singing with all of his flaws every week.”\nAfter Wednesday’s verdict, Shelby’s attorney said: “She’s ready to get back to her life.”\nMore from Morning Mix\n‘I think we’re in impeachment territory,’ says David Gergen, former aide to Nixon and Clinton\nYale dean once championed cultural sensitivity. Then she called people ‘white trash’ on Yelp.\n‘I was in total shock’: Ohio police officer accidentally overdoses after traffic stop",
  "title": "Tulsa officer acquitted in fatal shooting of unarmed black man",
  "url": "https://www.washingtonpost.com/news/morning-mix/wp/2017/05/18/tulsa-officer-acquitted-in-fatal-shooting-of-unarmed-black-man/"
}