{
  "author": null,
  "descendant": false,
  "description": "Jury acquits white Tulsa police officer Betty Jo Shelby, who fatally shot Terence Crutcher in September 2016",
  "downloadDate": "2017-05-18 12:47:22",
  "filename": "news__1495111642.html",
  "image": "http://cbsnews1.cbsistatic.com/hub/i/2017/05/18/000b6d35-acc8-4e61-b548-826816d1ec55/tulsa-protest-after-betty-shelby-acquittal-051717.jpg",
  "language": "en",
  "localpath": "/Users/felix/news-please//data/2017/05/18/cbsnews.com/news__1495111642.html",
  "modifiedDate": "2017-05-18 12:47:22",
  "pageTitle": "Protests follow Tulsa cop’s acquittal in fatal shooting of unarmed black man - CBS News",
  "publish_date": "2017-05-18 03:15:13",
  "rss_title": "NULL",
  "sourceDomain": "cbsnews.com",
  "text": "TULSA, Okla. -- A jury on Wednesday acquitted a white Oklahoma police officer who says she fired out of fear last year when she killed an unarmed black man who had his hands above his head. The verdict led almost immediately to protests.\nTerence Crutcher's family burst into tears and expressed outrage after jurors found Tulsa officer Betty Jo Shelby not guilty of first-degree manslaughter in the Sept. 16 shooting.\n\"Let it be known that I believe in my heart that Betty Shelby got away with murder,\" Crutcher's father, Rev. Joey Crutcher, said after the verdict was announced.\nCBS Tulsa affiliate KOTV reports Tiffany Crutcher, Terence's twin sister, called the verdict a tough pill to swallow. She said her brother was murdered by Shelby and police covered it up. She said Shelby was the aggressor, not her brother.\nA lawyer for Shelby said the officer was \"elated\" that the jury found her not guilty. \"She's ready to get back to her life,\" Defense Attorney Shannon McMurray said.\nSue Ogrocki / AP\nShelby looked stone-faced when the verdict was read, but Crutcher's family was quickly ushered out of the courtroom sobbing and wailing.\nAt least four of the 12 jurors were crying as they left the courtroom and they did not look at either the family of Crutcher or Shelby. The jury comprised eight women and four men and included three African-Americans.\nAbout 100 demonstrators gathered in a plaza outside the courthouse Wednesday evening to protest the verdict. They chanted: \"No Justice, No Peace. No Racist Police.\" A smaller group later blocked a major downtown road.\nMarq Lewis, organizer of the local civil rights group We The People Oklahoma, said the verdict was a blow to Tulsa's black community.\n\"When is it going to stop - just officer-related shootings? When will the police change policy?\" he asked.\nThings got heated at times, KOTV tweeted from the scenes:\nTulsa Police telling protestors to stop blocking road or \"chemical agents may be used.\" @NewsOn6 pic.twitter.com/teQlnCVp41 — Annie Chang (@AnnieNewsOn6) May 18, 2017\nProtesters still at 5th and Denver across from the courthouse. Several have left but still plenty around. Lot of officers here. @NewsOn6 pic.twitter.com/BX3Hes6FAp — Joseph Holloway (@a_cupof_JOE) May 18, 2017\nThe killing of 40-year-old Crutcher was among a spate of officer-involved shootings in recent years that helped galvanize the Black Lives Matter movement and prompted calls for more police accountability.\nThe NAACP Legal Defense Fund issued a statement saying in part, \"We are deeply disappointed that yet another police officer has eluded conviction for killing an unarmed African American. Officer Shelby continually altered her account of the incident, apparently changing the details based on the influence of counsel and discoveries by her fellow officers instead of her own recollection.\"\nTulsa has a long history of troubled race relations dating back to a 1921 race riot that left about 300 black residents dead. In 2015, a poorly-trained white voluntary deputy, Robert Bates, shot and killed a black man after Bates said he mistakenly reached for his gun rather than a Taser. The shooting led to the departure of the sheriff.\nSix days after the Crutcher shooting, Tulsa County District Attorney Steve Kunzweiler charged Shelby. An affidavit accused her of \"becoming emotionally involved to the point that she overreacted.\"\nDefense attorney McMurray argued that prosecutors rushed to charge Shelby for political reasons, fearing civil unrest like the angry street protests that erupted in Charlotte, North Carolina, after the fatal shooting of 43-year-old Keith Lamont Scott four days after Crutcher was killed. But the reaction in Tulsa was more muted, with protests but no violence.\nShelby testified that she fired her weapon out of fear because she said Crutcher didn't obey her commands to lie on the ground and appeared to reach inside his SUV for what she thought was a gun. Crutcher was unarmed.\nProsecutors told jurors that Shelby overreacted. They noted Crutcher had his hands in the air and wasn't combative - part of which was confirmed by police video taken from a dashboard camera and helicopter that showed Crutcher walking away from Shelby, hands held above his head.\nShelby's attorneys argued that in the two minutes before cameras began recording the encounter, Shelby repeatedly ordered Crutcher to stop walking away from her and get on the ground.\nShelby also said she feared Crutcher was under the influence of PCP, a powerful hallucinogenic known as Angel Dust that makes users erratic, unpredictable and combative.\nAn autopsy showed PCP was in Crutcher's system, and police said they found a vial of it in his SUV.\nCrutcher's family said police attempted to \"demonize\" Crutcher over the drug possession to deflect attention from the fact officers didn't find a gun inside his SUV.\nIn an exclusive interview with \"60 Minutes\" last month, Shelby said she felt almost any police officer in her position would have acted as she did. Shelby said race was not a factor in the shooting.\n\"I'm feeling that his intent is to do me harm and I keep thinking, 'Don't do this. Please don't do this. Don't make this happen,\"' Shelby told \"60 Minutes.\"\nShe said she felt Crutcher's death was his own fault.\n\"I have sorrow that this happened that this man lost his life but he caused the situation to occur,\" Shelby said. \"So in the end, he caused his own.\"\nBut Tiffany Crutcher told \"60 Minutes\" Shelby's actions were unjustified.\n\"My brother's dead because she didn't pause. And because she didn't pause, my family, we've had to pause,\" Tiffany Crutcher said. \"We've had to stop. We've had to lay down every single night with tears in our eyes.\"",
  "title": "Protests follow Tulsa cop’s acquittal in fatal shooting of unarmed black man",
  "url": "http://www.cbsnews.com/news/betty-shelby-acquittal-terence-crutcher-protests-tulsa-cop/"
}