{
  "author": "['Mike Debonis Covers Congress', 'National Politics For The Washington Post. He Previously Covered D.C. Politics', 'Government To', 'David Weigel Is A National Political Correspondent Covering Congress', \"Grassroots Political Movements. He'S The Author Of\", 'The Show That Never Ends', 'A History Of Progressive Rock Music.']",
  "descendant": false,
  "description": "\"You have to be very careful when you’re using humor,” said Rep. Dana Rohrabacher (R-Calif.), excusing Kevin McCarthy's suggestion that he'd been paid by Vladimir Putin. “Kevin didn’t mean any harm.\"",
  "downloadDate": "2017-05-18 12:47:41",
  "filename": "news_powerpost_wp_2017_05_17__1495111661.html",
  "image": "https://img.washingtonpost.com/rf/image_1484w/2010-2019/WashingtonPost/2015/10/09/National-Politics/Images/2015-10-08T190114Z_01_WAS926_RTRIDSP_3_USA-CONGRESS-REPUBLICANS-4189.jpg",
  "language": "en",
  "localpath": "/Users/felix/news-please//data/2017/05/18/washingtonpost.com/news_powerpost_wp_2017_05_17__1495111661.html",
  "modifiedDate": "2017-05-18 12:47:41",
  "pageTitle": "Putin paid Trump? Republicans think McCarthy’s statement has to be a joke. - The Washington Post",
  "publish_date": "2017-05-17 00:00:00",
  "rss_title": "NULL",
  "sourceDomain": "washingtonpost.com",
  "text": "The Post's Adam Entous discusses a 2016 conversation between GOP leaders in which House Majority Leader Kevin McCarthy (R-Calif.) made an explosive claim about Donald Trump. (Bastien Inzaurralde/The Washington Post)\nRep. Kevin McCarthy’s Republican colleagues were ready Wednesday to accept the House majority leader’s explanation that he was joking in his private comments last year suggesting that then-candidate Donald Trump was being paid by Russian President Vladimir Putin.\n“It was a bad attempt at a joke,” McCarthy (R-Calif.) told reporters Wednesday evening, moments after The Washington Post published an account of the remark based on a recording of a June 2016 meeting of GOP leaders. “That’s all there is to it. Nobody believes it to be true.”\nAmong those willing to give the Californian a pass was another GOP figure whom McCarthy identified as possibly being on Putin’s payroll: Rep. Dana Rohrabacher (R-Calif.).\nMcCarthy found Rohrabacher on the House floor Wednesday evening and assured him the remark captured on the recording obtained by the Post — “There’s two people I think Putin pays: Rohrabacher and Trump,” McCarthy said — was not to be taken seriously.\nRohrabacher agreed and compared the situation to a lunge at humor that had haunted him for years.\n“You have to be very careful when you’re using humor,” Rohrabacher said in a short interview Wednesday evening. “I remember that I was trying to make fun of the scientists who claimed that cow flatulence make global warming. So at a hearing, I said, ‘Oh, do you think the dinosaurs disappeared because of dinosaur flatulence?’ ”\n“To this day, you have these environmental wackos saying ‘Dana Rohrabacher believes that flatulence killed the dinosaurs,’ ” he added. “It was humor, but you’ve got to watch out for it. Kevin didn’t mean any harm.”\nThe meeting included House Speaker Paul D. Ryan (R-Wis.), who swore its attendees to secrecy by saying they were all “family” and should not leak the contents of the discussion.\nTwo of the GOP leaders who were in the room with McCarthy last June said Wednesday they did not recall the majority leader’s remark.\n“No, but I’ll review my notes,” said Rep. Patrick T. McHenry (R-N.C.), the chief deputy whip.\n“I never heard him say that,” House Republican Conference Chairwoman Cathy McMorris Rodgers (R-Wash.) told reporters.\nOther Republicans, meanwhile, flatly dismissed McCarthy’s comment as misunderstood humor.\n“It had to be a joke,” said Rep. Bill Flores (R-Tex.). “I just can’t imagine he’d say something like that seriously. I wouldn’t put any credibility in that statement being what he actually thinks.”\nSaid Rep. David Valadao (R-Calif.), a close friend of McCarthy’s, explained, “With Kevin, he does have a sense of humor, and so it wouldn’t surprise me for him to joke about. This one I can’t comment on. But we joke with each other all day long.”\nOne GOP member, who spoke on the condition of anonymity to speak frankly, was skeptical that McCarthy would have any special knowledge of Putin’s activities.\n“There is no way Kevin McCarthy had that kind of intel up here on the Hill,” the member said. “It’s just a joke.”\nSome Democrats, however, had a different reaction.\n“I want to hear the recording,” said Rep. Eric Swalwell (D-Calif.), a member of the House Permanent Select Committee on Intelligence who has called for a more vigorous probe of Trump’s ties to Russia. “What’s concerning to me is, if it was said, had their own concerns, and so far have done nothing to address concerns about the president’s ties to Russia.”\n“Did he have knowledge of a relationship that the president had with Russia, and did he pass that along to anyone? And if he did have knowledge, why have we not acted?” Swalwell asked of McCarthy. “We have a responsibility as a coequal branch of government to investigate this.”\nA spokesman for House Minority Leader Nancy Pelosi (D-Calif.) also noted the disconnect between McCarthy’s comment and the GOP’s public posture at the time he made it.\n“For weeks last summer, Russia’s hacking of our democratic institutions yielded only silence from these Republican leaders,” said the spokesman, Drew Hammill. “Apparently, Leader McCarthy could only be bothered to speak out from the comforts of a private backroom in the Capitol.”\nBut other Democrats didn’t quite know what to make of the report.\n“That one has to sink in for a while,” said Rep. Mike Quigley (D-Ill.), another member of the intelligence panel.\n“We almost made it through a day without a major breaking story,” said Rep. Jim Himes (D-Conn.). “But, no, we’re not making it to cocktail hour.”\nRep. Adam B. Schiff (Calif.), the House Intelligence Committee’s ranking Democrat, said it “fits in the category of surreal.”\n“But probably the most surreal is the fact that you have Vladimir Putin vouching for the president of the United States about something that took place in the Oval Office,” he added, referring to Putin’s Wednesday offer to release “records” of his envoys’ meeting with Trump last week.\nRohrabacher made his joke about dinosaur flatulence 10 years ago, during a hearing on climate change that took place shortly after Democrats won back the House. A climate-change skeptic, Rohrabacher asked a group of scientists if they could really, with confidence, say why atmospheric carbon dioxide levels were higher in the Paleocene-Eocene era.\n“We don’t know what those other cycles were caused by in the past,” he said. “Could be dinosaur flatulence, you know, or who knows? We do know the CO2 in the past had its time when it was greater as well.”\nSince then, Rohrabacher has been reelected easily. But in 2016, for the first time, his district voted for the Democrats’ presidential candidate, picking Hillary Clinton over President Trump by 1.7 points. Democrats have for the first time worked hard to recruit a credible challenger, and the climate story has been part of their argument.\nThat challenger, businessman Harley Rouda, issued a statement late Wednesday calling for a federal probe based on McCarthy’s remark.\n“Dana Rohrabacher’s devout support of and advocacy for Russia’s brutal regime is widely known, and given the ongoing investigation of Trump’s possible collusion with Russia in the 2016 election along with Rohrabacher’s deep ties to Trump, it’s become abundantly clear that this spider web of ties must be investigated,” Rouda said.\nEd O’Keefe and Karoun Demirjian contributed to this report.",
  "title": "Putin paid Trump? Republicans think McCarthy’s statement has to be a joke.",
  "url": "https://www.washingtonpost.com/news/powerpost/wp/2017/05/17/putin-paid-trump-republicans-think-mccarthys-statement-has-to-be-a-joke/"
}