{
  "author": "['The Associated Press']",
  "descendant": false,
  "description": "",
  "downloadDate": "2017-05-18 12:47:17",
  "filename": "news_index.ssf_2017_05_soundgarden_audioslave_singer_1495111637.html",
  "image": "http://image.al.com/home/bama-media/width620/img/alphotos/photo/2017/05/09/22646768-large.jpg",
  "language": "en",
  "localpath": "/Users/felix/news-please//data/2017/05/18/al.com/news_index.ssf_2017_05_soundgarden_audioslave_singer_1495111637.html",
  "modifiedDate": "2017-05-18 12:47:17",
  "pageTitle": "\tSoundgarden, Audioslave singer Chris Cornell dead at 52 | \t\t\t\t\t\tAL.com",
  "publish_date": "2017-05-18 10:55:22",
  "rss_title": "NULL",
  "sourceDomain": "al.com",
  "text": "Rocker Chris Cornell, who gained fame as the lead singer of the bands Soundgarden and later Audioslave, has died at age 52, according to his representative.\nCornell, who had been on tour, died Wednesday night in Detroit, Brian Bumbery said in a statement to The Associated Press. Cornell had performed a Detroit concert with Soundgarden that night.\nBumbery called the death \"sudden and unexpected\" and said his wife and family were shocked by it. The statement said the family would be working closely with the medical examiner to determine the cause and asked for privacy.\nNews of Cornell's death prompted scores of tweets expressing sadness. Aerosmith guitarist Joe Perry tweeted: \"Very sad news about Chris Cornell today. A sad loss of a great talent to the world, his friends and family. Rest In Peace.\"\nWith his powerful, nearly four-octave vocal range, Cornell was one of the leading voices of the 1990s grunge movement with Soundgarden, which emerged as one of the biggest bands out of Seattle's emerging music scene, joining the likes of Nirvana, Pearl Jam and Alice in Chains.\nFormed in 1984 by Cornell, guitarist Kim Thayil and bassist Hiro Yamamoto, Soundgarden's third studio album, \"Badmotorfinger,\" in 1991 spawned popular singles \"Jesus Christ Pose,\" ''Rusty Cage\" and \"Outshined\" that received regular play on alternative rock radio stations.\nCornell also collaborated with members of what would become Pearl Jam to form Temple of the Dog, which produced a self-titled album in 1991 in tribute to friend Andrew Wood, former frontman for Mother Love Bone.\nThree years later, Soundgarden broke through on mainstream radio with the album \"Superunknown,\" which debuted at No. 1 on the Billboard 200 and was nominated for a Grammy for Best Rock Record in 1995. It included hit singles \"Spoonman,\" ''Fell on Black Days,\" ''Black Hole Sun,\" ''My Wave\" and \"The Day I Tried to Live.\"\nCelebrities we've lost in 2017\nSoundgarden disbanded in 1997 due to tensions in the band, and Cornell pursued a solo career. In 2001, he joined Audioslave, a supergroup that included former Rage Against the Machine members Tom Morello, Brad Wilk and Tim Commerford. The band released three albums in six years and also performed at a concert billed as Cuba's first outdoor rock concert by an American band, though some Cuban artists have disputed that claim.\nAudioslave disbanded in 2007, but Cornell and Soundgarden reunited in 2012 and released the band's sixth studio album, \"King Animal\" in 2012.\nCornell also released four solo studio albums and a solo live album. He also released the single \"The Promise\" in March on iTunes, with all proceeds going to the International Rescue Committee, a global humanitarian aid, relief, and development non-governmental organization.\nIn addition to his music, Cornell also became involved in philanthropy and started the Chris and Vicky Cornell Foundation to support children facing challenges, including homelessness, poverty, abuse and neglect.",
  "title": "Soundgarden, Audioslave singer Chris Cornell dead at 52",
  "url": "http://www.al.com/news/index.ssf/2017/05/soundgarden_audioslave_singer.html"
}