{
  "author": null,
  "descendant": false,
  "description": "Iranians head to the polls tomorrow in what's increasingly seen as a referendum on its next supreme leader.",
  "downloadDate": "2017-05-18 12:47:38",
  "filename": "news_monkey-cage_wp_2017_05_18__1495111658.html",
  "image": "https://img.washingtonpost.com/rf/image_1484w/2010-2019/WashingtonPost/2017/05/16/National-Security/Images/05968124.jpg",
  "language": "en",
  "localpath": "/Users/felix/news-please//data/2017/05/18/washingtonpost.com/news_monkey-cage_wp_2017_05_18__1495111658.html",
  "modifiedDate": "2017-05-18 12:47:38",
  "pageTitle": "What’s really at stake in Iran’s presidential election - The Washington Post",
  "publish_date": "2017-05-18 00:00:00",
  "rss_title": "NULL",
  "sourceDomain": "washingtonpost.com",
  "text": "A veiled Iranian woman supporting conservative presidential candidate Ebrahim Raisi wears a picture of him on her finger during an election campaign rally in Tehran on May 16. (Abedin Taherkenareh/European Pressphoto Agency)\nTomorrow, Iran will hold its 12th presidential election. The election is now a two-man race between incumbent President Hassan Rouhani, the centrist-reformist candidate, and Ebrahim Raisi, the candidate closest to Supreme Leader Ali Khamenei. In the past week, polls show Rouhani over the 50 percent threshold he needs to win, but also show that almost 50 percent of voters are either undecided or don’t express their preference.\nThe election results are anything but a foregone conclusion. Those who call these elections window dressing will continue to miss both the intricate politics on display and the underlying issues that inform them.\nPost-Rafsanjani Iran\nThis is the first election after the death of former president Ali Akbar Hashemi Rafsanjani in January. Rafsanjani and another former president, Mohammad Khatami, established a moderate coalition — supported by a wide range of political parties — to oppose hard-liners, gradually becoming a diverse power block. This coalition led to Rouhani’s surprising presidential victory in 2013, as well as successful candidates in parliamentary elections.\n[Listen: Iran’s Election Preview]\nBut some say that Rafsanjani was merely using the reformists in his power struggle with Khamenei. Now, the reformists could improve their relationship with Khamenei directly without having to go through Rafsanjani. In the weeks that followed Rafsanjani’s death, Eshaq Jahangiri — the current vice president who withdrew his candidacy for president Tuesday — met with Khamenei and announced that he would act as the link between the leader and the reformists.\nAs the leader of the reformists, Khatami also called for a “national reconciliation” to publicly bring together reformists and hard-liners together against the possibility of external threats. Khamenei rejected this idea, and said he saw no need for it. While these are weak signs, Khamenei’s victory over the reformists over the past decade may have given him the confidence to open up some kind of rapprochement in the future.\nA Khamenei successor\nWith rumors surrounding the health of the 78-year-old Khamenei, political actors in Iran have begun to consider his possible successor. Based on the makeup of its executive committee, the current Assembly of Experts — which could choose the next supreme leader — is closely aligned with Khamenei. Khamenei had been a two-term president and a member of the Assembly of Experts when chosen as leader in 1989 — an experience that parallels Rouhani’s.\nKhamenei’s death would end his control over an Assembly of Experts that contains many clerics that came to power in 2016 through the Rafsanjani/Khatami-engineered reformist-centrist alliance, enabling a Rouhani run for the leadership position.\nFor the central command of the Islamic Revolutionary Guard Corps (IRGC), it’s important that when there is a change in leadership in Iran, the reformists not gain significant power. A second term for Rouhani poses a threat to them. This explains why the IRGC backed the candidacy of Raisi, the trustee of one of the richest religious sites in the Shiite world who has held important positions in the judiciary and is a member of the Assembly of Experts. Raisi represents the most radical religious parts of Iran and those most loyal to Khamenei.\nIf he becomes the next president, Raisi will be well positioned to become Khamenei’s successor. In that case, his proximity to the leadership and his position in the assembly may even create a situation like that of Cuba in 2008, where the successor became the face of the country’s leadership even though the leader was still alive and in power.\nBut the same dynamic applies to Rouhani, who will lose his chance of becoming the next leader if he loses the presidential election, no matter who controls the next administration. However, if he wins by more than 20 million votes, Rouhani will be in a strong position for leadership in a post-Khamenei Iran.\nMessaging in the campaign’s last days\nIran’s unemployment crisis is the single most important campaign issue this election. Rouhani’s opponents use it to criticize his handling of Iran’s post-nuclear agreement economy. While the economic crisis is real — and its roots go further back than the nuclear issue — no candidate, regardless of their political leaning, will be in a position to solve it in a short time span.\nTo pivot away from this insoluble problem, Rouhani stepped up his criticism of political repression. He called to lift house arrests on the leaders of the Green Movement. Rouhani also used campaign speeches to link this election to the one that gave birth to the reform movement when Iranians elected Khatami in 1997.\nRouhani also publicly criticized the IRGC for its missile tests, attacks on the Saudi embassy and its provocations in the region, as the reason for the low level of investments in Iran’s economy, and by extension, the unemployment crisis.\nBy embracing the reform movement, Rouhani hopes to mobilize his base and convince those who are on the sidelines to vote for him tomorrow. While his rise in polls show this to be a short-term strategy to win the election, it may have the longer-term effect of breaking up the reformist-centrist alliance that has been so successful since 2013.\nAs Rouhani leans further into reformist rhetoric, he may alienate the center and right-leaning blocs in the coalition — groups that have a longer history of conflict than alliance. The death of Rafsanjani, who alone had significant pull among these groups, would mean that should the coalition break, its chances of repair are very low.\nThis, more than any other reason, may explain why the most silent man in this election has been none other than the supreme leader.\nSeyedamir Hossein Mahdavi is a researcher at the Crown Center for Middle East Studies at Brandeis University and a graduate student at Harvard University.\nNaghmeh Sohrabi is the Charles (Corky) Goodman Professor of Middle East History and associate director for research at the Crown Center for Middle East Studies at Brandeis University.\nThis piece was adapted from a longer analysis published by the Crown Center for Middle East Studies at Brandeis University.",
  "title": "What’s really at stake in Iran’s presidential election",
  "url": "https://www.washingtonpost.com/news/monkey-cage/wp/2017/05/18/whats-really-at-stake-in-irans-presidential-election/"
}