{
  "author": "['Eric Tucker', 'Julie Pace', 'Nancy Benac', 'Associated Press']",
  "descendant": false,
  "description": "WASHINGTON (AP) — President Donald Trump lashed out at the appointment of a special counsel to investigate allegations that his campaign collaborated with Russia to sway the 2016 election, tweeting Thursday that it is \"the single greatest witch hunt of a politician in American history!\" The surprise announcement to hand the probe over to Mueller, a lawman with deep bipartisan respect, was a striking shift for Trump's Justice Department, which had resisted increasingly loud calls from Democrats for an outside prosecutor. In another Twitter post Thursday, Trump said: \"With all of the illegal acts that took place in the Clinton campaign & Obama Administration, there was never a special councel (sic) appointed!\" He did not provide examples or evidence of any alleged \"illegal acts.\" [...] GOP lawmakers have grown increasingly anxious since Trump fired Comey, who had been leading the bureau's probe — and after Comey associates said he had notes from a meeting in which Trump asked him to shut down the investigation into the Russia ties of former National Security Adviser Michael Flynn. First reactions from Congress were mainly positive. Trump has repeatedly slammed the FBI and congressional investigations as a \"hoax\" and blamed disgruntled officials at intelligence agencies for leaking information related to the probes. No less a commentator than Russia's Vladimir Putin called the dramatic charges swirling around Trump evidence of \"political schizophrenia spreading in the U.S.\" He offered to furnish a \"record\" of the Trump-diplomats meeting in the Oval Office if the White House desired it. Both of the explosive revelations — that the president pressed his FBI director to drop a federal investigation before later firing him, and that he disclosed classified information to senior Russian officials — came from anonymous sources, and the White House was quick to denounce the leaks and deny any impropriety. The Senate intelligence committee also asked acting FBI Director Andrew McCabe to turn over any notes Comey might have made regarding discussions he had with White House or Justice Department officials about Russia's efforts to influence the election. Separately, McClatchy News Service reported Wednesday that before Trump took office, Flynn had blocked an Obama administration military plan, opposed by Turkey, against the Islamic State group.",
  "downloadDate": "2017-05-18 12:47:30",
  "filename": "news_politics_article_Special-prosecutor-abruptly-named-to-probe-11155029_1495111650.html",
  "image": "http://ww2.hdnux.com/photos/61/22/61/12921969/3/rawImage.jpg",
  "language": "",
  "localpath": "/Users/felix/news-please//data/2017/05/18/sfgate.com/news_politics_article_Special-prosecutor-abruptly-named-to-probe-11155029_1495111650.html",
  "modifiedDate": "2017-05-18 12:47:30",
  "pageTitle": "Trump assails 'witch hunt' after naming of special counsel - SFGate",
  "publish_date": "2017-05-18 05:19:00",
  "rss_title": "NULL",
  "sourceDomain": "sfgate.com",
  "text": "Trump assails 'witch hunt' after naming of special counsel\nWASHINGTON (AP) — President Donald Trump lashed out at the appointment of a special counsel to investigate allegations that his campaign collaborated with Russia to sway the 2016 election, tweeting Thursday that it is \"the single greatest witch hunt of a politician in American history!\"\nThe Justice Department on Wednesday appointed former FBI Director Robert Mueller to lead the investigation. Mueller will have sweeping powers and the authority to prosecute any crimes he uncovers.\nThe surprise announcement to hand the probe over to Mueller, a lawman with deep bipartisan respect, was a striking shift for Trump's Justice Department, which had resisted increasingly loud calls from Democrats for an outside prosecutor. It immediately escalated the legal stakes — and the potential political damage — for a president who has tried to dismiss the matter as partisan witch hunt and a \"hoax.\"\nIn another Twitter post Thursday, Trump said: \"With all of the illegal acts that took place in the Clinton campaign & Obama Administration, there was never a special councel (sic) appointed!\" He did not provide examples or evidence of any alleged \"illegal acts.\"\nThe announcement, the latest in the shock-a-day Washington saga, was made by deputy Attorney General Rod Rosenstein. The White House counsel's office was alerted only after the order appointing Mueller was signed, said a senior White House official, who was not authorized to speak publicly by name and commented only on condition of anonymity.\nPhoto: Susan Walsh, AP Image 1 of / 35 Caption Close Image 1 of 35 President Donald Trump gestures as he gives the commencement address at the U.S. Coast Guard Academy in New London, Conn., Wednesday, May 17, 2017. President Donald Trump gestures as he gives the commencement address at the U.S. Coast Guard Academy in New London, Conn., Wednesday, May 17, 2017. Photo: Susan Walsh, AP Image 2 of 35 House Speaker Paul Ryan of Wis. takes questions from reporters at the Republican National Committee Headquarters in Washington, Wednesday, May 17, 2017. Ryan said Congress \"can't deal with speculation and innuendo\" and must gather all relevant information before \"rushing to judgment\" on President Donald Trump's firing of FBI Director James Comey. less House Speaker Paul Ryan of Wis. takes questions from reporters at the Republican National Committee Headquarters in Washington, Wednesday, May 17, 2017. Ryan said Congress \"can't deal with speculation and ... more Photo: J. Scott Applewhite, AP Image 3 of 35 FILE - In this May 8, 2017, file photo, then-FBI Director James Comey speaks to the Anti-Defamation League National Leadership Summit in Washington. The White House is disputing a report that President Donald Trump asked Comey to shut down an investigation into ousted national security adviser Michael Flynn. less FILE - In this May 8, 2017, file photo, then-FBI Director James Comey speaks to the Anti-Defamation League National Leadership Summit in Washington. The White House is disputing a report that President Donald ... more Photo: Susan Walsh, AP Image 4 of 35 President Donald Trump poses for a photo with U.S. Coast Guard Academy graduate Liam Christian Otto during commencement exercises at the U.S. Coast Guard Academy in New London, Conn., Wednesday, May 17, 2017. President Donald Trump poses for a photo with U.S. Coast Guard Academy graduate Liam Christian Otto during commencement exercises at the U.S. Coast Guard Academy in New London, Conn., Wednesday, May 17, 2017. Photo: Susan Walsh, AP Image 5 of 35 FILE - In this June 19, 2013, file photo, former FBI Director Robert Mueller testifies on Capitol Hill in Washington. On May 17, 2017, the Justice Department said is appointing Mueller as special counsel to oversee investigation into Russian interference in the 2016 presidential election. less FILE - In this June 19, 2013, file photo, former FBI Director Robert Mueller testifies on Capitol Hill in Washington. On May 17, 2017, the Justice Department said is appointing Mueller as special counsel to ... more Photo: J. Scott Applewhite, AP Image 6 of 35 FILE - In this Aug. 21, 2013, file photo, then-FBI director Robert Mueller speaks during an interview at FBI headquarters in Washington. The Justice Department on May 17, 2017, appointed Mueller as a special counsel to oversee a federal investigation into potential coordination between Russia and the Trump campaign during the 2016 presidential election. less FILE - In this Aug. 21, 2013, file photo, then-FBI director Robert Mueller speaks during an interview at FBI headquarters in Washington. The Justice Department on May 17, 2017, appointed Mueller as a special ... more Photo: Evan Vucci, AP Image 7 of 35 FILE - In this June 21, 2013, file photo, President Barack Obama, followed by outgoing FBI Director Robert Mueller, right, and his choice to succeed Mueller, James Comey, left, walks towards the podium in the Rose Garden of the White House in Washington. The Justice Department on May 17, 2017, appointed Mueller as a special counsel to oversee a federal investigation into potential coordination between Russia and the Trump campaign during the 2016 presidential election. less FILE - In this June 21, 2013, file photo, President Barack Obama, followed by outgoing FBI Director Robert Mueller, right, and his choice to succeed Mueller, James Comey, left, walks towards the podium in the ... more Photo: Pablo Martinez Monsivais, AP Image 8 of 35 FILE - In this Nov. 14, 1991, file photo, then-Assistant Attorney General Robert Mueller points to a photo of the reconstructed wreckage of Pan Am Flight 103, which exploded over Lockerbie Scotland in 1988, killing 270 people. Mueller once again finds himself catapulted into the midst of historic events: The Justice Department has named him special counsel to investigate potential coordination between Russia and the Donald Trump team during the 2016 presidential election and related matters. less FILE - In this Nov. 14, 1991, file photo, then-Assistant Attorney General Robert Mueller points to a photo of the reconstructed wreckage of Pan Am Flight 103, which exploded over Lockerbie Scotland in 1988, ... more Photo: Barry Thumma, AP Image 9 of 35 Former Connecticut Sen. Joe Lieberman waves to members of the media as he leaves the West Wing of the White House in Washington, Wednesday, May 17, 2017. The White House says President Donald Trump will be interviewing four potential candidates to lead the FBI. less Former Connecticut Sen. Joe Lieberman waves to members of the media as he leaves the West Wing of the White House in Washington, Wednesday, May 17, 2017. The White House says President Donald Trump will be ... more Photo: Pablo Martinez Monsivais, AP Image 10 of 35 FILE - In this Jan. 3, 2017, file photo, Michael Flynn, then - President-elect Donald Trump's nominee for National Security Adviser arrives at Trump Tower in New York. FILE - In this Jan. 3, 2017, file photo, Michael Flynn, then - President-elect Donald Trump's nominee for National Security Adviser arrives at Trump Tower in New York. Photo: Andrew Harnik, AP Image 11 of 35 | Politicians react to Comey firing Rep. Barbara Lee, D-Calif., comments on President Donald Trump firing FBI Director James Comey. After Comey's dismissal twitter lit up with comments from politicians. Rep. Barbara Lee, D-Calif., comments on President Donald Trump firing FBI Director James Comey. After Comey's dismissal twitter lit up with comments from politicians. Photo: Twitter Screen Grab Image 12 of 35 | Politicians react to Comey firing Sen. Elizabeth Warren, D-Mass., comments on President Donald Trump firing FBI Director James Comey. After Comey's dismissal twitter lit up with comments from politicians. Sen. Elizabeth Warren, D-Mass., comments on President Donald Trump firing FBI Director James Comey. After Comey's dismissal twitter lit up with comments from politicians. Photo: Twitter Screen Grab Image 13 of 35 | Politicians react to Comey firing Sen. John McCain, R-Ariz., comments on President Donald Trump firing FBI Director James Comey. After Comey's dismissal twitter lit up with comments from politicians. Sen. John McCain, R-Ariz., comments on President Donald Trump firing FBI Director James Comey. After Comey's dismissal twitter lit up with comments from politicians. Photo: Twitter Screen Grab Image 14 of 35 | Politicians react to Comey firing Rep. Jackie Speier, D-Calif., comments on President Donald Trump firing FBI Director James Comey. After Comey's dismissal twitter lit up with comments from politicians. Rep. Jackie Speier, D-Calif., comments on President Donald Trump firing FBI Director James Comey. After Comey's dismissal twitter lit up with comments from politicians. Photo: Twitter Screen Grab Image 15 of 35 | Politicians react to Comey firing Sen. Ted Cruz, R-Texas, comments on President Donald Trump firing FBI Director James Comey. After Comey's dismissal twitter lit up with comments from politicians. Sen. Ted Cruz, R-Texas, comments on President Donald Trump firing FBI Director James Comey. After Comey's dismissal twitter lit up with comments from politicians. Photo: Twitter Screen Grab Image 16 of 35 | Politicians react to Comey firing Chris Murphy, D-Conn., comments on President Donald Trump firing FBI Director James Comey. After Comey's dismissal twitter lit up with comments from politicians. Chris Murphy, D-Conn., comments on President Donald Trump firing FBI Director James Comey. After Comey's dismissal twitter lit up with comments from politicians. Photo: Twitter Screen Grab Image 17 of 35 | Politicians react to Comey firing Sen. Joe Donnelly, D-Ind., comments on President Donald Trump firing FBI Director James Comey. After Comey's dismissal twitter lit up with comments from politicians. Sen. Joe Donnelly, D-Ind., comments on President Donald Trump firing FBI Director James Comey. After Comey's dismissal twitter lit up with comments from politicians. Photo: Twitter Screen Grab Image 18 of 35 | Politicians react to Comey firing Sen. Richard Burr, R-N.C., comments on President Donald Trump firing FBI Director James Comey. After Comey's dismissal twitter lit up with comments from politicians. Sen. Richard Burr, R-N.C., comments on President Donald Trump firing FBI Director James Comey. After Comey's dismissal twitter lit up with comments from politicians. Photo: Twitter Screen Grab Image 19 of 35 | Politicians react to Comey firing Sen. Elizabeth Warren, D-Mass., comments on President Donald Trump firing FBI Director James Comey. After Comey's dismissal twitter lit up with comments from politicians. Sen. Elizabeth Warren, D-Mass., comments on President Donald Trump firing FBI Director James Comey. After Comey's dismissal twitter lit up with comments from politicians. Photo: Twitter Screen Grab Image 20 of 35 | Politicians react to Comey firing Rep. Karen Bass, D-Calif., comments on President Donald Trump firing FBI Director James Comey. After Comey's dismissal twitter lit up with comments from politicians. Rep. Karen Bass, D-Calif., comments on President Donald Trump firing FBI Director James Comey. After Comey's dismissal twitter lit up with comments from politicians. Photo: Twitter Screen Grab Image 21 of 35 | Politicians react to Comey firing Rep. Karen Bass, D-Calif., comments on President Donald Trump firing FBI Director James Comey. After Comey's dismissal twitter lit up with comments from politicians. Rep. Karen Bass, D-Calif., comments on President Donald Trump firing FBI Director James Comey. After Comey's dismissal twitter lit up with comments from politicians. Photo: Twitter Screen Grab Image 22 of 35 | Politicians react to Comey firing Sen. Jeff Flake, R-Ariz., comments on President Donald Trump firing FBI Director James Comey. After Comey's dismissal twitter lit up with comments from politicians. Sen. Jeff Flake, R-Ariz., comments on President Donald Trump firing FBI Director James Comey. After Comey's dismissal twitter lit up with comments from politicians. Photo: Twitter Screen Grab Image 23 of 35 | Politicians react to Comey firing Rep. Karen Bass, D-Calif., comments on President Donald Trump firing FBI Director James Comey. After Comey's dismissal twitter lit up with comments from politicians. Rep. Karen Bass, D-Calif., comments on President Donald Trump firing FBI Director James Comey. After Comey's dismissal twitter lit up with comments from politicians. Photo: Twitter Screen Grab Image 24 of 35 | Politicians react to Comey firing Rep. Karen Bass, D-Calif., comments on President Donald Trump firing FBI Director James Comey. After Comey's dismissal twitter lit up with comments from politicians. Rep. Karen Bass, D-Calif., comments on President Donald Trump firing FBI Director James Comey. After Comey's dismissal twitter lit up with comments from politicians. Photo: Twitter Screen Grab Image 25 of 35 | Politicians react to Comey firing Sen. Michael Bennet, D-Colo., comments on President Donald Trump firing FBI Director James Comey. After Comey's dismissal twitter lit up with comments from politicians. Sen. Michael Bennet, D-Colo., comments on President Donald Trump firing FBI Director James Comey. After Comey's dismissal twitter lit up with comments from politicians. Photo: Twitter Screen Grab Image 26 of 35 | Politicians react to Comey firing Sen. Michael Bennet, D-Colo., comments on President Donald Trump firing FBI Director James Comey. After Comey's dismissal twitter lit up with comments from politicians. Sen. Michael Bennet, D-Colo., comments on President Donald Trump firing FBI Director James Comey. After Comey's dismissal twitter lit up with comments from politicians. Photo: Twitter Screen Grab Image 27 of 35 | Politicians react to Comey firing Sen. Brian Schatz, D-Hawaii, comments on President Donald Trump firing FBI Director James Comey. After Comey's dismissal twitter lit up with comments from politicians. Sen. Brian Schatz, D-Hawaii, comments on President Donald Trump firing FBI Director James Comey. After Comey's dismissal twitter lit up with comments from politicians. Photo: Twitter Screen Grab Image 28 of 35 | Politicians react to Comey firing Sen. Richard Blumenthal, D-Conn., comments on President Donald Trump firing FBI Director James Comey. After Comey's dismissal twitter lit up with comments from politicians. Sen. Richard Blumenthal, D-Conn., comments on President Donald Trump firing FBI Director James Comey. After Comey's dismissal twitter lit up with comments from politicians. Photo: Twitter Screen Grab Image 29 of 35 | Politicians react to Comey firing Sen. Dianne Feinstein, D-Calif., comments on President Donald Trump firing FBI Director James Comey. After Comey's dismissal twitter lit up with comments from politicians. Sen. Dianne Feinstein, D-Calif., comments on President Donald Trump firing FBI Director James Comey. After Comey's dismissal twitter lit up with comments from politicians. Photo: Twitter Screen Grab Image 30 of 35 | Politicians react to Comey firing Sen. Cory Booker, D-N.J., comments on President Donald Trump firing FBI Director James Comey. After Comey's dismissal twitter lit up with comments from politicians. Sen. Cory Booker, D-N.J., comments on President Donald Trump firing FBI Director James Comey. After Comey's dismissal twitter lit up with comments from politicians. Photo: Twitter Screen Grab Image 31 of 35 | Politicians react to Comey firing Sen. Tim Kaine, D-Virg., comments on President Donald Trump firing FBI Director James Comey. After Comey's dismissal twitter lit up with comments from politicians. Sen. Tim Kaine, D-Virg., comments on President Donald Trump firing FBI Director James Comey. After Comey's dismissal twitter lit up with comments from politicians. Photo: Twitter Screen Grab Image 32 of 35 | Politicians react to Comey firing Sen. Kamala Harris, D-Calif., comments on President Donald Trump firing FBI Director James Comey. After Comey's dismissal twitter lit up with comments from politicians. Sen. Kamala Harris, D-Calif., comments on President Donald Trump firing FBI Director James Comey. After Comey's dismissal twitter lit up with comments from politicians. Photo: Twitter Screen Grab Image 33 of 35 | Politicians react to Comey firing Sen. Bill Nelson, D-Fl., comments on President Donald Trump firing FBI Director James Comey. After Comey's dismissal twitter lit up with comments from politicians. Sen. Bill Nelson, D-Fl., comments on President Donald Trump firing FBI Director James Comey. After Comey's dismissal twitter lit up with comments from politicians. Photo: Twitter Screen Grab Image 34 of 35 | Politicians react to Comey firing Sen. Chris Murphy, D-Conn., comments on President Donald Trump firing FBI Director James Comey. After Comey's dismissal twitter lit up with comments from politicians. Sen. Chris Murphy, D-Conn., comments on President Donald Trump firing FBI Director James Comey. After Comey's dismissal twitter lit up with comments from politicians. Photo: Twitter Screen Grab Image 35 of 35 Trump assails 'witch hunt' after naming of special counsel 1 / 35 Back to Gallery\nIn a written statement, Trump insisted anew there were no nefarious ties between his campaign and Russia.\n\"A thorough investigation will confirm what we already know — there was no collusion between my campaign and any foreign entity,\" he declared. \"I look forward to this matter concluding quickly.\"\nMueller's broad mandate gives him not only oversight of the Russia probe, but also \"any matters that arose or may arise directly from the investigation.\" That would surely include Trump's firing last week of FBI Director James Comey.\nMueller, a former federal prosecutor at the Justice Department, was confirmed as FBI director days before the Sept. 11, 2001, attacks that would ultimately shape his tenure. The FBI's counterterror mission was elevated in those years, as the U.S. intelligence agencies adjusted to better position America to prevent another attack of such magnitude. He was so valued that President Barack Obama asked him to stay on two years longer than his 10-year term.\nComey succeeded him, appointed by Obama.\nMueller was appointed Wednesday by Rosenstein, who had faced criticism as the author of a memo that preceded Comey's firing. Rosenstein said the appointment was \"necessary in order for the American people to have full confidence in the outcome.\"\nRepublicans have largely stood behind Trump in the first months of his presidency as the FBI and congressional investigations into Russia's election meddling intensified. But GOP lawmakers have grown increasingly anxious since Trump fired Comey, who had been leading the bureau's probe — and after Comey associates said he had notes from a meeting in which Trump asked him to shut down the investigation into the Russia ties of former National Security Adviser Michael Flynn.\nFirst reactions from Congress were mainly positive.\nHouse Speaker Paul Ryan said the appointment was consistent with his goal of ensuring that \"thorough and independent investigations are allowed to follow the facts wherever they may lead.\"\nRepublican Jason Chaffetz of Utah, chairman of the House Oversight Committee, said Mueller was a \"great selection. Impeccable credentials. Should be widely accepted.\"\nAnd not a moment too soon, Democrats said.\n\"I believe Mueller will be independent, he will be thorough and he will be fair and he's not going to be easily swayed,\" said Elijah Cummings of Maryland, top Democrat on the oversight panel. Cummings has vigorously urged such an appointment, suggesting it could lead to accusations of obstruction of justice.\nIn the 1990s, Democrats complained that independent counsel Kenneth Starr, who investigated President Bill Clinton, overstepped his authority.\nThe latest political storm, coupled with the still-potent fallout from Trump's recent disclosure of classified information to Russian diplomats at the White House, has overshadowed all else in the capital and beyond. Stocks fell sharply on Wall Street Wednesday as investors worried the latest turmoil in Washington could hinder Trump's pro-business agenda\nTrump has repeatedly slammed the FBI and congressional investigations as a \"hoax\" and blamed disgruntled officials at intelligence agencies for leaking information related to the probes. During a commencement address Wednesday at the Coast Guard Academy, he complained bitterly about criticism he's faced.\n\"No politician in history, and I say this with great surety, has been treated worse or more unfairly,\" he said. \"You can't let the critics and the naysayers get in the way of your dreams. ... I guess that's why we won. Adversity makes you stronger. Don't give in, don't back down. ... And the more righteous your fight, the more opposition that you will face.\"\nNo less a commentator than Russia's Vladimir Putin called the dramatic charges swirling around Trump evidence of \"political schizophrenia spreading in the U.S.\" He offered to furnish a \"record\" of the Trump-diplomats meeting in the Oval Office if the White House desired it.\nThere was no word on what that record might entail, a question many were likely to raise in light of Trump's recent warning to Comey that he had \"better hope\" there were no tapes of a discussion they'd had.\nThe White House has disputed Comey's account of his February conversation with Trump concerning Flynn but has not offered specifics. Several congressional Republicans said Wednesday that if Trump did suggest that Comey \"let this go\" regarding Flynn's Russian contacts, it was probably just a joke, light banter.\nBoth of the explosive revelations — that the president pressed his FBI director to drop a federal investigation before later firing him, and that he disclosed classified information to senior Russian officials — came from anonymous sources, and the White House was quick to denounce the leaks and deny any impropriety. Trump aides said he never tried to squelch the Flynn investigation nor made inappropriate disclosures to the Russians.\nOn Capitol Hill, Comey was clearly the man in demand, with three committees working to seat him at their witness tables soon, two in the Senate and one in the House.\nThe Senate intelligence committee also asked acting FBI Director Andrew McCabe to turn over any notes Comey might have made regarding discussions he had with White House or Justice Department officials about Russia's efforts to influence the election.\nMcCabe had other matters on his mind, too. He was one of four potential candidates to lead the FBI that Trump was interviewing. The others were former Connecticut Sen. Joe Lieberman, former Oklahoma Gov. Frank Keating and Richard McFeely, a former top FBI official.\nTrump is preparing to leave town Friday on his first foreign trip, and aides have been hopeful the journey will be a chance for the administration to get back on track after weeks of chaos and distractions.\nSen. Lindsey Graham, R-S.C., speculated Trump was probably happy to get out of town — \"and a lot of us are glad he's leaving for a few days.\"\nHis advice to the president: \"Stay disciplined, stay focused and deliver on the world stage.\"\nSeparately, McClatchy News Service reported Wednesday that before Trump took office, Flynn had blocked an Obama administration military plan, opposed by Turkey, against the Islamic State group. Unknown to the Obama administration, Flynn had been paid more than $500,000 to advocate for Turkey's interests.\nMcClatchy says Flynn declined to OK a request from Obama officials to approve a military operation involving the IS stronghold of Raqqa, effectively delaying the operation. The Trump team had been asked since the operation was likely to be carried out after Trump took office. Turkey has long opposed U.S. forces working with Kurdish forces.\nThe plan was eventually approved by the Trump administration, but not until after Flynn had been fired.\n___\nAssociated Press writers Deb Riechmann, Eileen Sullivan, Erica Werner, Matthew Daly and Mary Clare Jalonick contributed to this report",
  "title": "Trump assails 'witch hunt' after naming of special counsel",
  "url": "http://www.sfgate.com/news/politics/article/Special-prosecutor-abruptly-named-to-probe-11155029.php"
}