{
  "author": "[\"Travis M. Andrews Is A Reporter For The Washington Post'S Morning Mix. Previously He Was An Editor For Southern Living\", 'A Pop Culture', 'Tech Contributor For Mashable.', \"J. Freedom Du Lac Is The Editor Of The Post'S General Assignment News Desk. He Was Previously A Local Enterprise Reporter\", 'Before That', 'The Paper S Pop Music Critic.']",
  "descendant": false,
  "description": "Cornell was in the middle of a nationwide tour with Soundgarden, his original Seattle band.",
  "downloadDate": "2017-05-18 12:47:40",
  "filename": "news_morning-mix_wp_2017_05_18__1495111660.html",
  "image": "https://images.washingtonpost.com/?url=http://img.washingtonpost.com/news/morning-mix/wp-content/uploads/sites/21/2017/05/AP_17138288239056.jpg&w=1484&op=resize&opt=1&filter=antialias",
  "language": "en",
  "localpath": "/Users/felix/news-please//data/2017/05/18/washingtonpost.com/news_morning-mix_wp_2017_05_18__1495111660.html",
  "modifiedDate": "2017-05-18 12:47:40",
  "pageTitle": "Soundgarden frontman Chris Cornell, a founding father of grunge, dead at 52 - The Washington Post",
  "publish_date": "2017-05-18 00:00:00",
  "rss_title": "NULL",
  "sourceDomain": "washingtonpost.com",
  "text": "Chris Cornell, the founder and frontman of the bands Soundgarden and Audioslave, died on May 17 in Detroit. He was a key figure in the '90s grunge rock movement. (Amber Ferguson/The Washington Post)\nChris Cornell, a key figure in the grunge rock movement as the co-founder and banshee-voiced frontman of Soundgarden, died Wednesday night in Detroit after playing a show with the Grammy-winning band. He was 52.\nBrian Bumbery, a publicist for Cornell, confirmed the singer’s death to the Associated Press, calling it “sudden and unexpected.” The cause of death was not immediately known, Bumbery said in a statement.\nCornell was in the middle of a national tour with Soundgarden, which was in the midst of writing and recording its first new album in five years. The band performed, as scheduled, Wednesday at Detroit’s Fox Theatre.\n“Finally back to Rock City!!!!” Cornell tweeted just hours before his death.\nAlongside the likes of Nirvana, Mudhoney and Alice in Chains, Soundgarden was one of the seminal bands in the loosely defined grunge movement that roared out of the Pacific Northwest in the 1990s and ushered in a new era of rock.\nCo-founded in Seattle in 1984 by Cornell, guitarist Kim Thayil and bassist Hiro Yamamoto, Soundgarden made loud and sludgy music that evoked the proto-heavy metal of the 1970s, though with a jagged punk edge. The band eventually became one of the first grunge acts to sign with a major label, but only after making several independent recordings — first with SubPop, the small Seattle record label that helped launch the culture-changing grunge movement.\nCornell played rhythm guitar but was best known for his throaty, multi-octave voice, which he once called “unapologetically male.”\n“He comes from the Robert Plant school of vocalists, more banshee wailing than guttural bellowing, and possesses a set of pipes that ensures his voice is the focal point of whatever he’s singing, no matter what other musical mayhem may unfold,” The Washington Post once wrote of Cornell.\nSoungarden’s music resonated with listeners at a time when hair metal and New Wave competed for chart space. The band’s songs were laden with emotion — and more often than not, that emotion was anger.\n“For me to make a connection with music it has to either have a visceral nature, whether it’s anger or aggression or that kind of passion which shows up in rock music, or there has to be some sort of melancholy and introspection, something about it that makes you feel your own pain,” Cornell told Rolling Stone.\nOf the band’s sound, perhaps the heaviest in grunge, Cornell told the Guardian: “If you’re an American kid, you can’t help but be influenced by Led Zeppelin, Black Sabbath and the Rolling Stones because they’re always on the radio. But from 17 to 19, all I listened to was Elvis Costello and the Beat. When Soundgarden formed we were post-punk — pretty quirky. Then somehow we found this neo-Sabbath psychedelic rock that fitted well with who we were.”\nAs grunge became increasingly mainstream, Soundgarden’s reach grew.\nThe group’s major-label debut, 1991’s “Badmotorfinger,” went multi-platinum and produced Soundgarden’s first MTV and radio hit, “Rusty Cage,” which Spin later called “emblematic of grunge’s rock-mutt DNA. It was punk spirit tempered with rock-star bravado, metal riffs forged with pop smarts.” The magazine added that “Soundgarden’s sound was a raw, threatening ferocity that made radio metal seem immediately gauche, but played with arena-ready chops that could beat them at their own game — and you can hear both in frontman Chris Cornell’s fire engine wail.”\n#scary. I remember @chriscornell on tour with us so long ago. Remember drinking beer after the Melvins. Always thought we'd meet again RIP — Sebastian Bach (@sebastianbach) May 18, 2017\nSO SO stunned to hear about Chris Cornell! Such a terrible and sad loss! Thinking of his family tonight! RIP — Dave Navarro (@DaveNavarro) May 18, 2017\nThe band’s next album, 1994’s “Superunknown,” topped the Billboard 200 charts and dominated rock radio, with hit single (“Spoonman”) after hit single (“Black Hole Sun”) after hit single (“Fell on Black Days”). A follow-up album, “Down on the Upside,” peaked at No. 2 in 1996.\nSoundgarden went on hiatus the following year, though most fans assumed the group had broken up.\nIn a 2009 interview with The Washington Post, Cornell casually referenced “the split-up of Soundgarden.”\n“So at some point, might we see a Soundgarden reunion?” The Post then asked.\n“You never know,” Cornell replied.\n“Every time I did an interview, I was asked, ‘Is Soundgarden ever going to get back together? Will the band ever do anything again?’” Cornell told Gibson.com in 2011.\nIndeed, it would.\nThe band returned at the end of 2012 with the well-received “King Animal.” Its fans were still around and hungry for new music, it seemed, as the album reached No. 5 on the big Billboard chart.\nWith Soundgarden on hiatus, Cornell founded the rock supergroup Audioslave with Tom Morello, Tim Commerford and Brad Wilk, three members of Rage Against the Machine. That band eventually broke up but reunited in January to play a Southern California concert in protest of President Trump.\nCornell’s beginnings were a little more humble than his success might suggest.\n“I was going to be a musician, no matter what it took,” he told ESPN. “I supported myself with blue-collared jobs so I could write music and be in a band and play shows.”\nAnd musician he was, but he found himself playing in a cover band called the Shemps when he was 18. He wanted to write and perform his own music, as he recalled to Richmond’s Style Weekly.\n“I was driving home from a restaurant gig thinking: ‘It doesn’t matter to me if it’s hugely successful, it matters that we get to create our own songs and art. I don’t care if I have to break concrete if that supports the art,’” he said. “I didn’t want to play Police covers in the back of a Chinese restaurant, that’s not me. … Something felt really settled in me when I thought that.”\nWith Soundgarden, Cornell found creative satisfaction — and, eventually, fame.\n“We weren’t a band that had overnight success, it came slowly and with a lot of effort,” he told Style Weekly.\n“The thing that was amazing about Soundgarden is that they were just so natural; it was just like this effortlessness to the whole thing,” SubPop co-founder Jonathan Poneman once told an interviewer. “There was this unholy mixture of Black Sabbath and the Butthole Surfers, which at the time was totally revolutionary. … There was some [Led] Zeppelin thrown in there, and there was more than a little Black Flag thrown in there, particularly in Kim’s guitar playing.”\nThe fame Cornell’s music brought came with a steep price. He spent time in rehab for “various things,” but “mainly for drinking,” he told Spin. According to Cornell, it was a way of escaping his fame, which he found isolating.\n“I’m Irish: If I could get the cap off something, I would drink it. And drinking was really an extension of becoming isolated from all my other relationships,” he told the magazine, remembering the first time he was recognized “at four in the morning, in the middle of Mississippi” after the music video for his song “Outshined” played on MTV for the first time.\nAfter that, he tried avoiding the public. Drinking made that easy.\n“I never liked being recognized to begin with, and I was never much of a social person, so this gave me a chance to play the ‘I don’t want to go out’ card,” he said. “I would just stay in and drink.”\n“I could drink a lot, and I tended to have violent outbursts,” he added.\nIn 2002, he “had to come to the conclusion, the sort of humbling conclusion that, guess what, I’m no different than anybody else, I’ve got to sort of ask for help — not something I ever did, ever, as he told Blabbermouth, so he checked himself into rehab.\n“I actually like rehab a lot,” he told Spin. “It’s like school; it’s interesting. I’m learning that I can be teachable at age 38.”\nMan. Gone too soon. Rest in power chris Cornell. One of my favorite songs right here. Damn!!!!! https://t.co/xvcAqkjcLE — DJ Lethal (@djlethal) May 18, 2017\nRIP Chris Cornell @chriscornell @Audioslave @soundgarden Thoughts go out to his family and friends. Tragic loss — OVERKILL (@OverkillBand) May 18, 2017\nMore from Morning Mix\nJimmy Fallon says people ‘have a right to be mad’ at his friendly hair tousling of Trump\nDutch king reveals secret life — as a KLM airline co-pilot\nTulsa officer acquitted in fatal shooting of unarmed black",
  "title": "Soundgarden frontman Chris Cornell, a founding father of grunge, dead at 52",
  "url": "https://www.washingtonpost.com/news/morning-mix/wp/2017/05/18/soundgarden-frontman-chris-cornell-dead-at-52/"
}