{
  "author": "['Erik Ortiz', 'Phil Helsel']",
  "descendant": false,
  "description": "Tulsa police officer Betty Shelby has been found not guilty in the September 2016 shooting death of an unarmed black man.",
  "downloadDate": "2017-05-18 12:47:24",
  "filename": "news_us-news_jury-acquits-tulsa-officer-shooting-death-terence-crutcher-n761206_1495111644.html",
  "image": "https://media3.s-nbcnews.com/j/newscms/2017_20/2003421/170517-betty-shelby-mn-14456_ebfb467212d9ce76a8499378677b5c2a.nbcnews-fp-1200-800.jpg",
  "language": "en",
  "localpath": "/Users/felix/news-please//data/2017/05/18/nbcnews.com/news_us-news_jury-acquits-tulsa-officer-shooting-death-terence-crutcher-n761206_1495111644.html",
  "modifiedDate": "2017-05-18 12:47:24",
  "pageTitle": "Jury Acquits Tulsa Officer Betty Shelby in Shooting Death of Terence Crutcher - NBC News",
  "publish_date": "2017-05-18 00:00:00",
  "rss_title": "NULL",
  "sourceDomain": "nbcnews.com",
  "text": "A jury on Wednesday acquitted a white Oklahoma police officer in the shooting death of an unarmed black man in Tulsa last year.\nTulsa police officer Betty Shelby, 43, had been charged with manslaughter in the September 2016 shooting death of Terence Crutcher, 40, during an encounter that began with the report of a stalled vehicle.\nThe district attorney's office announced a verdict had been reached shortly after 9 p.m. local time (10 p.m. ET), more than eight hours after deliberations began, NBC affiliate KJRH reported.\nThe manslaughter trial against Shelby opened May 10 with prosecutors laying out how the five-year veteran of the Tulsa Police Department encountered Crutcher — what should have been a routine traffic matter that went too far, they said.\nInstead, Crutcher's death — another involving an unarmed black man at the hands of police — touched off Black Lives Matter protests and calls for greater transparency from local authorities.\nPlay Facebook\nTwitter\nEmbed Terence Crutcher's Family Responds to Officer's Acquittal 2:23 autoplay autoplay Copy this code to your website or blog\nCrutcher's family called the verdict a disappointment, and called the police department \"corrupt\" after being led out of the courtroom filled with emotion. Crutcher's twin sister, Tiffany Crutcher, said her brother's hands were up, that he was not an imminent threat or attack her and didn't deserve to be shot.\n\"Terence was not the aggressor; Betty Shelby was the aggressor,\" she said. \"Betty Shelby had the gun. Betty Shelby was following him with his hands up.\"\nShelby was among the officers who responded to reports of a stalled SUV left abandoned in the middle of a road just after 7:30 p.m. local time, prosecutors said.\nRelated: Trial Starts for Oklahoma Officer in Terence Crutcher Shooting\nPolice said Crutcher approached the vehicle but failed to listen to commands from officers. Shelby asked Crutcher if the car was his, but only mumbled to himself and didn't respond, according to an affidavit.\nCrutcher was seen walking to his car with his hands up before reaching into the driver's side window. One of the officers fired his Taser at him. Shelby also fired her gun — striking the father of four in the lung, police said.\nVideo footage taken from helicopter and cruiser dashcams don't provide clear views of the moment she shot him.\nPlay Facebook\nTwitter\nEmbed SEPT. 2016: Unarmed Man With Hands Up Fatally Shot by Tulsa Police, Video Shows 1:11 autoplay autoplay Copy this code to your website or blog\nAn attorney for Shelby later said that she believed Crutcher was under the influence of hallucinogenic drugs. Shelby, a former deputy for the Tulsa County Sheriff's Office, had previously completed drug-recognition expert training.\nA toxicology report revealed that Crutcher was on two hallucinogenic drugs, including PCP, during the encounter. It took at least two minutes after Crutcher was shot before police attempted aid, according to officers.\nDuring the trial, Shelby testified that police training videos taught her to be careful about suspects pulling guns when they reach into their vehicles, according to The Associated Press.\nShe fired her weapon, she told a Tulsa County courthouse on Monday, because \"I feared for my life.\"\n\"I did everything I could to stop this,\" she added. \"Crutcher's death is his fault.\"\nProsecuting attorney Kevin Gray told the court that Crutcher was never aggressive toward police or actually produced a gun, and that Shelby was merely \"guessing\" that he had one.\nHer defense attorney, Shannon McMurray, argued that it was unfair for the prosecution to repeatedly say Crutcher was unarmed. No weapon was found inside the SUV.\nTiffany Crutcher, center, sister of Terence Crutcher, talks with the media following a verdict in the trial of Tulsa police officer Betty Jo Shelby in Tulsa, Okla., Wednesday, May 17, 2017. Sue Ogrocki / AP\n\"To somehow imply that she was supposed to see what was in this door panel is absurd. It's deceitful and you should disregard it,\" McMurray told jurors, according to the AP.\nJudge Doug Drummond, however, said his being unarmed was a relevant factor in the case.\nAn attorney for the Crutcher family, Benjamin Crump, raised the deaths of other black men in encounters with police, like Michael Brown and Freddie Gray, in expressing his disappointment with the verdict.\n\"The list just goes on and on, of unarmed African American men being killed by white police officers, and they get away with it,\" Crump said.\nJerad Lindsey, chairman of Tulsa Fraternal Order of Police, said that the jury's verdict was the right one, but said the shooting was a tragedy. \"There's no winners in this,\" he said. \"There's still a family that has dealt with a tragedy here, the Crutchers, and we still extend our deepest sympathies to them.\"\n\"And now that we've reached a verdict, Tulsa's gonna have to figure out how to get its arms around this and be able to move forward in a positive way,\" Lindsey said.\nBetty Shelby leaves the courtroom with her husband, Dave Shelby, right, after the jury in her case began deliberations in Tulsa, Oklahoma, on May 17. Sue Ogrocki / AP\nBoth Shelby's family, including her husband, who is a fellow Tulsa police officer, and Crutcher's family have been at the courthouse since the trial began.\nShelby was placed on paid administrative leave amid the investigation, then on unpaid leave. Shelby did not speak to the media after Wednesday's verdict. McMurray said Shelby is \"elated and very proud of her jury.\"\nTulsa County District Attorney Stephen Kunzweiler in a statement Wednesday night thanked jurors and said \"there can be no doubt that the decision rendered by this jury was only after a long and deliberative process.\"\nThe NAACP Legal Defense Fund in a statement called Wednesday's verdict disappointing, and said it is hopeful the Justice Department files charges. The DOJ announced shortly after the shooting that it was opening a civil rights investigation.",
  "title": "Jury Acquits Tulsa Officer Betty Shelby in Shooting Death of Terence Crutcher",
  "url": "http://www.nbcnews.com/news/us-news/jury-acquits-tulsa-officer-shooting-death-terence-crutcher-n761206"
}