{
  "author": null,
  "descendant": false,
  "description": "The party's manifesto includes big changes to social care funding - and aims to balance the budget by 2025.",
  "downloadDate": "2017-05-18 12:47:19",
  "filename": "news_election-2017-39956541_1495111639.html",
  "image": "https://ichef-1.bbci.co.uk/news/1024/cpsprodpb/10ED2/production/_96103396_mediaitem96103395.jpg",
  "language": "en",
  "localpath": "/Users/felix/news-please//data/2017/05/18/bbc.com/news_election-2017-39956541_1495111639.html",
  "modifiedDate": "2017-05-18 12:47:19",
  "pageTitle": "Conservative manifesto: Theresa May targets mainstream Britain' - BBC News",
  "publish_date": "2017-05-18 13:32:22",
  "rss_title": "NULL",
  "sourceDomain": "bbc.com",
  "text": "Media playback is unsupported on your device Media caption Theresa May: \"A manifesto to see us through Brexit and beyond\"\nPrime minister Theresa May has promised a \"mainstream government that would deliver for mainstream Britain\".\nLaunching the Conservative manifesto, Mrs May said a strong economy and delivering Brexit were top priorities.\nThe manifesto does not include the 2015 pledge not to raise income tax or National Insurance and has big changes to social care funding in England.\nPeople worth more than £100,000 would have to pay for their care - but could defer payment until after their death.\nLabour leader Jeremy Corbyn accused the Conservatives of proposing a \"tax on dementia\".\nMrs May, speaking at the manifesto launch in Halifax, said: \"We must take this opportunity to build a great meritocracy in Britain. It means making Britain a country that works, not for the privileged few, but for everyone.\"\nShe said there were five priorities: a strong economy, facing up to the consequences of Brexit and a changing world, tackling \"enduring\" social divisions, responding to the challenges of an ageing society and harnessing the power of fast-changing technology.\nManifesto measures include:\nBalancing the budget by 2025\nNo increase in VAT - but scrapping a 2015 election pledge not to raise income tax or National Insurance\nIncreasing the national living wage to 60% of the median earnings by 2020\nRestating the commitment to bring net immigration down to tens of thousands a year\nIncreasing NHS spending by a minimum of £8bn in real terms over the next five years\nA pledge that a referendum on Scottish independence cannot take place until the Brexit process is completed\nScrapping winter fuel payments to better-off pensioners - at the moment, all pensioners qualify for one-off payments of between £100 and £300 each winter\nA reduction of the so-called \"triple lock\" on pensions to a \"double lock\" with the state pension to rise by the higher of average earnings or inflation - but to no longer go up by 2.5% if they are both lower than that\nAn extra £4bn on schools in England by 2022 - partly funded by an end to the current provision of free school lunches for all infant pupils in England\nScrapping the ban on setting up new grammar schools\nMeasures on immigration, including asking firms to pay more to hire migrant workers, who will in turn be asked to pay more to use the NHS\nMrs May was asked whether her plans spelled a move away from Conservative policies of recent years, and in particular those of Margaret Thatcher.\nShe said: \"Margaret Thatcher was a Conservative, I am a Conservative, this is a Conservative manifesto.\"\nShe later added: \"There is no Mayism. There is good solid Conservatism, which puts the interests of the country and the interests of ordinary working people at the heart of everything we do in government.\"\nMedia playback is unsupported on your device Media caption Theresa May tells Laura Kuenssberg there are \"hard choices\" for the future\nThe social care changes proposed are that the value of someone's property would be included in the means test for receiving free care in their own home - currently only their income and savings are taken into account.\nPeople will be able to defer paying for their care until after their death. Those in residential care - whose property is already taken into account in the means test - can already do this.\nThere will also be an increase in the amount of wealth someone can have - savings and the value of their home - from the current £23,250 to £100,000 - before they lose the right to free care.\nThat means that however much is spent on social care, it becomes free once someone is down to their last £100,000.\nSir Andrew Dilnot produced a report on the social care system for the Coalition government in 2011, which recommended that individuals' contributions to their care costs should be capped at £35,000.\n\"The disappointment about these proposals is that they fail to tackle the biggest problem of all in social care: there is nothing that you can do to protect yourself against care costs,\" he told BBC Radio 4's Today programme.\n\"People will be left helpless, knowing that what will happen if they are unlucky enough to suffer the need for care costs, is that they will be entirely on their own until they are down to their last £100,000 of all of their wealth, including their house.\"\nSocial care: the winners and losers\nImage copyright Science Photo Library\nBy Nick Triggle, BBC health correspondent\nWhat the Conservatives have proposed for elderly care is pretty complex.\nThey are changing certain thresholds as well as what can be defined as assets and how long you wait before you have to pay your bill.\nBut in the end it can be summed up quite easily - they want people to pay more towards the cost of their care, but are prepared to wait until you die before taking it from your estate.\nSome elements of their plans sound generous and certainly some people will benefit, but large numbers won't.\nWhy? Because we are a nation of homeowners and these plans make sure that whatever sort of care you need, the value of your home can be taken into account.\nHealth Secretary Jeremy Hunt defended the manifesto proposal, telling BBC Breakfast: \"Everyone will have the security of knowing that they can pass on £100,000 to their children and grandchildren. At the moment, you can be cleaned out to as little as £23,000 so that's four times more.\"\n\"We are saying to pay for that there's a trade-off,\" Mr Hunt added.\nIn Scotland the SNP government has maintained a policy of free personal care.\nBBC political editor Laura Kuenssberg said Mrs May had put forward an \"uncompromising\" message on immigration, saying high levels can harm community cohesion, and would re-commit to bringing net migration down to the tens of thousands.\nThe plan to stick with the net migration target has caused controversy, with critics saying it will be nearly impossible to meet without doing damage to the economy.\nNet migration, the difference between people coming to the UK for more than a year and those leaving, stood at 273,000 in the year to last September. It was last below 100,000 in 1997.\nMedia playback is unsupported on your device Media caption Sir Andrew Dilnot tells Today that Tory social care plans \"fail to tackle\" the central problem\nLabour said the Conservatives had broken 50 promises over the past two years on living standards, NHS spending, school funding and the deficit, and could not be trusted.\nEd Davey, for the Liberal Democrats, said: \"It is clear the more you need, the more you pay with May. Theresa May is betraying working families by snatching school lunches from their children and their homes when they die.\"\nThe SNP said Theresa May wanted a \"free hand to dismantle the welfare state and to push through their reckless plans for a hard Brexit which threaten jobs, investment and livelihoods\".\nGet news from the BBC in your inbox, each weekday morning",
  "title": "Conservative manifesto: Theresa May targets mainstream Britain'",
  "url": "http://www.bbc.com/news/election-2017-39956541"
}