{
  "author": "['Krishnadev Calamur']",
  "descendant": false,
  "description": "Reuters is reporting 18 new contacts between April and November 2016—when the presidential race was in full swing.",
  "downloadDate": "2017-05-18 12:47:37",
  "filename": "news_archive_2017_05_trump-campaign-russia__1495111657.html",
  "image": "https://cdn.theatlantic.com/assets/media/img/mt/2017/05/RTX36CPE/facebook.jpg?1495104208",
  "language": "en",
  "localpath": "/Users/felix/news-please//data/2017/05/18/theatlantic.com/news_archive_2017_05_trump-campaign-russia__1495111657.html",
  "modifiedDate": "2017-05-18 12:47:37",
  "pageTitle": "Just How Many Times Did Trump's Presidential Campaign Contact Russia? - The Atlantic",
  "publish_date": "2017-05-16 05:00:00",
  "rss_title": "NULL",
  "sourceDomain": "theatlantic.com",
  "text": "Donald Trump’s advisers, including Michael Flynn, contacted Russian officials at least 18 times in phone calls and emails during the last seven months of the U.S. presidential race in 2016, Reuters is reporting this morning. The news agency is citing anonymous current and former U.S. officials familiar with the exchanges as its sources for the story. The officials also told Reuters that the new contacts so far provide no evidence of wrongdoing or collusion between Trump’s presidential campaign and Russia. The 18 telephone calls and emails were made between April and November 2016, coinciding with the Russia-directed interference of the U.S. presidential election. U.S. intelligence agencies have concluded that while there is evidence of Russian interference in the election, there is no evidence to suggest such action affected the outcome of the vote in which Trump defeated his rival, Hillary Clinton, who had been heavily favored to win.\nHere’s more from Reuters: The previously undisclosed interactions form part of the record now being reviewed by FBI and congressional investigators probing Russian interference in the U.S. presidential election and contacts between Trump’s campaign and Russia. Six of the newly revealed contacts were phone calls between Sergei Kislyak, the Russian ambassador to the U.S., and Flynn and other Trump advisers. Flynn’s misrepresentation of his contacts with Kislyak to Vice President Mike Pence and others resulted in his resignation in early February as Trump’s first national-security adviser. Reuters adds: Conversations between Flynn and Kislyak accelerated after the Nov. 8 vote as the two discussed establishing a back channel for communication between Trump and Russian President Vladimir Putin that could bypass the U.S. national security bureaucracy, which both sides considered hostile to improved relations, four current U.S. officials said. The disclosure is the latest revelation about Trump’s campaign—leaks that have come at a steady rate since last week and threaten to undermine Trump’s young presidency even before it gets off the ground. The latest leaks started after the president fired FBI Director James Comey on May 9 for his handling of an investigation into Clinton’s use of a private email server while she served as U.S. secretary of state. A day later, the White House appeared to change its rationale for why Comey was fired. And on May 11, Trump told NBC that Comey was fired because the president was upset about the bureau’s investigation into the Trump campaign’s contacts with Russia. Comey’s associates fired back, saying Trump had asked the FBI chief for a loyalty pledge—but didn’t receive one.",
  "title": "Just How Many Times Did Trump's Presidential Campaign Contact Russia?",
  "url": "https://www.theatlantic.com/news/archive/2017/05/trump-campaign-russia/527160/"
}