{
  "author": null,
  "descendant": false,
  "description": "The justice department says an outsider must look into alleged Russian meddling in the US election.",
  "downloadDate": "2017-05-18 12:47:18",
  "filename": "news_world-us-canada-39957358_1495111638.html",
  "image": "https://ichef-1.bbci.co.uk/news/1024/cpsprodpb/925D/production/_96096473_mueller_976reu.jpg",
  "language": "en",
  "localpath": "/Users/felix/news-please//data/2017/05/18/bbc.com/news_world-us-canada-39957358_1495111638.html",
  "modifiedDate": "2017-05-18 12:47:18",
  "pageTitle": "Trump Russia inquiry: Former FBI boss to lead probe - BBC News",
  "publish_date": "2017-05-18 13:11:08",
  "rss_title": "NULL",
  "sourceDomain": "bbc.com",
  "text": "Image copyright Reuters Image caption Robert Mueller (L) with his successor at the FBI James Comey, whose dismissal prompted calls for a wider investigation\nA former FBI boss has been named special counsel to oversee an inquiry into Russia's alleged meddling in the election and any Trump campaign ties.\nIn naming Robert Mueller, the deputy attorney general said it was in the public interest to have an outsider.\nThe appointment was widely endorsed by politicians from both sides.\nIn a tweet President Donald Trump described the situation as \"the single greatest witch hunt of a politician in American history\".\nHe also questioned why his election opponent Hillary Clinton and his predecessor President Barack Obama had had not been investigated.\n\"With all of the illegal acts that took place in the Clinton campaign and the Obama Administration, there was never a special councel [sic] appointed,\" he wrote.\nCalls for a special investigation had mounted since Mr Trump fired the most recent FBI director, James Comey, last week.\nThe announcement apparently took the White House by surprise, with Mr Trump only being informed of it after Deputy Attorney General Rod Rosenstein had signed the order.\nThe FBI and Congress are looking into potential links between Mr Trump's campaign team and Russia. Mr Mueller will take over the FBI investigation.\nUS intelligence agencies believe Moscow tried to tip the election in favour of Mr Trump.\nMeanwhile the New York Times reports that Trump aide Michael Flynn had told his transition team in early January - earlier than was previously thought - that he was under investigation for working as a paid lobbyist for Turkey during the election campaign.\nMr Trump appointed Mr Flynn as his national security adviser weeks later despite the warning, but he was sacked after just 24 days.\nImage copyright AFP Image caption Mr Flynn was sacked for misleading the vice-president about his contacts with Russian officials\nIn his statement announcing Mr Mueller's appointment, Mr Rosenstein said: \"The public interest requires me to place this investigation under the authority of a person who exercises a degree of independence from the normal chain of command.\"\nMr Mueller, who will have wide-ranging powers, said simply: \"I accept this responsibility and will discharge it to the best of my ability.\"\nHow the latest events unfolded:\nMonday 17:00 (22:00 GMT): Washington Post reports that Mr Trump disclosed classified intelligence to Russia\nTuesday 13:30: New York Times reports that the intelligence came from Israel\n17:15: New York Times reports on Comey memo stating Mr Trump asked him to end investigation into ex-national security adviser Mike Flynn\nWednesday 18:00: Justice department announces appointment of special counsel, Deputy Attorney General Rod Rosenstein signs order\n21:15: New York Times reports that Trump transition team knew of Flynn investigation before he became president\nWhat was the reaction?\nJust over an hour after the news of Mr Mueller's appointment emerged, President Trump predicted the new investigation would clear him and his team.\n\"A thorough investigation will confirm what we already know - there was no collusion between my campaign and any foreign entity,\" said the president.\nMedia playback is unsupported on your device Media caption Putin laughs at political chaos in US\nThe top Democrat in the Senate, Chuck Schumer, said Mr Mueller was \"exactly the right kind of individual for this job\". But House minority leader Nancy Pelosi was more cautious.\n\"A special prosecutor is the first step, but it cannot be the last,\" she said, calling for a \"truly independent, outside commission\".\nFor the Republicans, Senate Majority Leader Mitch McConnell said the appointment \"confirms that the investigation... will continue\".\nHouse Speaker Paul Ryan said the appointment was consistent with the goal of ensuring \"thorough and independent investigations are allowed to follow the facts wherever they may lead\".\nThe stakes just rose: analysis by Anthony Zurcher, BBC News, Washington\nIn announcing the appointment of a special counsel, Mr Rosenstein cited the \"unusual circumstances\" of the ongoing FBI Russia investigation. That's an understatement.\nThe circumstances are not just unusual, they are unprecedented. The nation has never had an administration so embattled so early in its term. There have never been such grave allegations of electoral meddling by a foreign power in a US presidential election.\nThen again there has never been a president quite like Donald Trump.\nNow the Russia story enters a new, more serious phase. Robert Mueller has a sterling reputation in Washington, DC. He worked with Mr Comey when the latter served as deputy attorney general in George W Bush's administration. He understands pressure-cooker politics and knows how to navigate the corridors of power.\nHe has wide latitude to conduct his investigation and bring criminal charges, if necessary.\nWhile Mr Mueller is technically still part of the justice department and ultimately reports to Mr Trump, his stature is such that he is unlikely to be cowed by the president.\nIndependent investigations often take on a life of their own and can reach unexpected conclusions. With Mr Mueller in the game, the stakes just went up.\nWhat powers will Mr Mueller have?\nNormally US prosecutors answer to the attorney general. However, for investigations into high-ranking officials in the executive branch the attorney general - or in this case Mr Rosenstein - can appoint a special counsel with greater independence from the executive.\nBut while special counsels are free from day-to-day supervision by the justice department, they must notify the attorney general of any \"significant\" action and they would need to ask permission to expand the investigation beyond their mandate.\nMr Mueller has the authority to investigate not only links or co-ordination between Russia and Trump campaign officials, but also \"any matters that arose or may arise directly from the investigation\".\nThe role should not be confused with that of independent counsel, a role introduced in legislation by Congress after the 1970s Watergate scandal.\nAppointed by a three-judge panel, the independent counsel operated outside the jurisdiction of the justice department.\nBut after the experiences of the Iran-Contra investigation during the Reagan administration and the inquiry into President Bill Clinton's Whitewater land deal, the law fell out of favour with both Republicans and Democrats, and Congress failed to renew it in 1999.\nWhat's the background to this?\nThe White House has been engulfed in crisis following Mr Comey's abrupt dismissal and allegations that Mr Trump asked the ousted FBI chief to drop an inquiry into links between his ex-national security adviser and Russia.\nMr Trump's national security adviser, Michael Flynn, was forced out in February after he misled the vice-president about his conversations with Russia's ambassador before Mr Trump took office.\nMedia playback is unsupported on your device Media caption Trump supporters stick with him despite scandal\nThe White House has denied it put pressure on Mr Comey but the revelations fuelled Democratic claims that Mr Trump had tried to conceal his team's connection to Russia.\nMr Mueller, 72, served as FBI director for 12 years under Presidents George W Bush and Barack Obama as the longest serving bureau chief since J Edgar Hoover.\nHe is expected to announce his resignation from a private law firm to avoid conflicts of interest.",
  "title": "Trump Russia inquiry: Former FBI boss to lead probe",
  "url": "http://www.bbc.com/news/world-us-canada-39957358"
}