{
  "author": "['Jon Levine']",
  "descendant": false,
  "description": "You can now add this to your daily bombshell.",
  "downloadDate": "2017-05-18 12:47:26",
  "filename": "online__1495111646.html",
  "image": "http://static01.mediaite.com/med/wp-content/uploads/2017/05/Screen-Shot-2017-05-18-at-6.31.19-AM.jpg",
  "language": "en",
  "localpath": "/Users/felix/news-please//data/2017/05/18/mediaite.com/online__1495111646.html",
  "modifiedDate": "2017-05-18 12:47:26",
  "pageTitle": "New Bombshell: Trump Campaign Had at Least 18 Previously Undisclosed Contacts With Russia During Campaign | Mediaite",
  "publish_date": "2017-05-18 06:36:25",
  "rss_title": "NULL",
  "sourceDomain": "mediaite.com",
  "text": "You can now add this to your daily bombshell.\nApparently during the 2016 campaign, aids and advisers to Donald Trump, including Lt. Gen. Michael Flynn, had no fewer than 18 contacts with senior Russian officials close to Vladimir Putin. Front and center of those contacts — the Russian ambassador, Sergey Kislyak.\nReuters reported in any early morning exclusive Thursday, that the ambassador and man who would become National Security Adviser were looking to create a secret backchannel directly to Vladimir Putin and go-around the traditional U.S. national security community.\nPer Reuters\nThe people who described the contacts to Reuters said they had seen no evidence of wrongdoing or collusion between the campaign and Russia in the communications reviewed so far. But the disclosure could increase the pressure on Trump and his aides to provide the FBI and Congress with a full account of interactions with Russian officials and others with links to the Kremlin during and immediately after the 2016 election.\nAs Donald Trump prepares for his first overseas trip, he has been forced to watch scandals surrounding Flynn and his former FBI director James Comey explode into public view. After firing Comey — itself an earthquake — news has emerged that the ex-director secretly wrote memos documenting meetings with Trump including one in which he supposedly asked Comey to shut down the Flynn investigation entirely.\nAll things for the president to think about on that long flight to Saudi Arabia.\n[image via screengrab]\nHave a tip we should know? tips@mediaite.com",
  "title": "New Bombshell: Trump Campaign Had at Least 18 Previously Undisclosed Contacts With Russia During Campaign",
  "url": "http://www.mediaite.com/online/new-bombshell-trump-campaign-had-at-least-18-contacts-with-russia-during-2016-campaign/"
}