{
  "author": "['Joseph Tanfani']",
  "descendant": false,
  "description": "",
  "downloadDate": "2017-05-18 12:47:24",
  "filename": "politics_la-na-politics-rosenstein-senate-20170518-story_1495111644.html",
  "image": "http://www.trbimg.com/img-591d755c/turbine/la-na-politics-rosenstein-senate-20170518",
  "language": "en",
  "localpath": "/Users/felix/news-please//data/2017/05/18/latimes.com/politics_la-na-politics-rosenstein-senate-20170518-story_1495111644.html",
  "modifiedDate": "2017-05-18 12:47:24",
  "pageTitle": "Rod Rosenstein heads to Capitol Hill after appointing special counsel - LA Times",
  "publish_date": "2017-05-18 00:00:00",
  "rss_title": "NULL",
  "sourceDomain": "latimes.com",
  "text": "The second-ranking official at the Justice Department heads to Capitol Hill on Thursday to brief the Senate about his appointment of an independent special counsel for the Russia investigation, the firing of FBI Director James B. Comey and reports that President Trump asked Comey to end a criminal investigation.\nDeputy Atty. Gen. Rod Rosenstein, who appointed former FBI Director Robert S. Mueller III to oversee the investigation into Russian meddling in the 2016 election, is expected to be pressed on those issues and others in an unusual closed-door session with the full Senate.\nThe briefing was scheduled before Rosenstein signed an order Wednesday naming Mueller to take over an expanding counterintelligence investigation that has roiled Washington for weeks and could lead into the White House, and potentially to criminal charges.\nIn a statement, Rosenstein said he had decided to hand off the high-profile inquiry to a figure outside the normal government chain of command, including the White House, “in order for the American people to have full confidence in the outcome.”\nPart of Mueller’s charge is to determine whether any of Trump’s campaign aides actively cooperated with Russian intelligence efforts to influence the U.S. election last year. The FBI began the investigation last July and disclosed it to Congress in March.\nRosenstein, a career federal prosecutor, had overseen the inquiry because Atty. Gen. Jeff Sessions recused himself after news reports revealed he had failed to disclose in his Senate confirmation hearing that he’d had meetings with Russia’s ambassador to Washington.\nBut Rosenstein came under intense pressure from Democratic lawmakers to step aside and name an independent prosecutor after he became embroiled in the political fight over why Comey was fired on May 9, a battle that raised questions of whether Rosenstein was sufficiently independent of the White House.\nAt Trump’s request, Rosenstein had written a letter that harshly criticized Comey and accused him of overstepping his role and breaking Justice Department protocol during the FBI’s investigation into Hillary Clinton’s email practices while she was secretary of State.\nThe White House released the letter when Trump fired Comey and initially said that the president had simply followed a recommendation by Rosenstein and Sessions.\nTrump later acknowledged that he had decided to fire Comey regardless of their recommendation because of what he called “the Russia thing.”\nTrump has denounced the FBI investigation as a witch hunt and a charade, and said Wednesday that Mueller would find no evidence that his presidential campaign cooperated with Russian intelligence.\n“As I have stated many times, a thorough investigation will confirm what we already know — there was no collusion between my campaign and any foreign entity,” Trump said in a statement.\nMueller will decide the scope of his inquiry — for example, whether it will include a federal grand jury in Virginia that has subpoenaed documents involving Michael Flynn, who served as Trump’s national security advisor until he was forced out in February for lying to officials, including Vice President Mike Pence, about his conversations with the Russian ambassador.\nUnder the law, Mueller will have authority to choose his own staff and request his own budget from the Justice Department.\nRosenstein will not directly supervise Mueller’s work but can request that he explain any steps he’s taking, and may overrule them.\nThe statute says the attorney general — Rosenstein in this case because Sessions has recused himself — should “give great weight to the views of the special counsel,” and inform the Judiciary committees in the House and Senate if he decides something should not be pursued.\nRosenstein was overwhelmingly confirmed by the Senate last month for the No. 2 job at the Justice Department. Democrats who had questioned his integrity for his role in the Comey firing praised him broadly late Wednesday for naming a special prosecutor.\nRosenstein also is likely to face questions about whether the Justice Department will cooperate with congressional investigators seeking memos that Comey reportedly wrote after his conversations with the president.\nIn one of them, Comey wrote that Trump had asked him to end the FBI’s investigation into former national security advisor Flynn’s dealings with Russia.\nThe Senate Intelligence and Judiciary committees and the House Oversight Committee have already requested those memos.\nIn a speech in Baltimore this week, Rosenstein said he didn’t spent much time worrying about the controversy.\n“If you ask me,” he said, “one of the main problems in Washington, D.C., is everybody is so busy running around trying to protect their reputation instead of protecting the republic, which is what they're supposed to be doing.”\nCaption President Donald Trump gives a commencement speech at the Coast Guard Academy in Connecticut on Wednesday. President Donald Trump gives a commencement speech at the Coast Guard Academy in Connecticut on Wednesday. Caption President Donald Trump gives a commencement speech at the Coast Guard Academy in Connecticut on Wednesday. President Donald Trump gives a commencement speech at the Coast Guard Academy in Connecticut on Wednesday. Caption Russian Foreign Minister Sergei Lavrov on Comey: 'Was he fired? You’re kidding' Russian Foreign Minister Sergei Lavrov on Comey: 'Was he fired? You’re kidding' Caption Students at Bethune-Cookman University booed and turned their backs while Donald Trump's education chief Betsy DeVos gave a commencement speech on Wednesday. Students at Bethune-Cookman University booed and turned their backs while Donald Trump's education chief Betsy DeVos gave a commencement speech on Wednesday. Caption Sen. Dianne Feinstein called for a special prosecutor to investigate Russian meddling in the presidential election at Wednesday morning's Senate Judiciary Committee hearing. Sen. Dianne Feinstein called for a special prosecutor to investigate Russian meddling in the presidential election at Wednesday morning's Senate Judiciary Committee hearing. Caption Former Director of National Intelligence James R. Clapper explains unmasking. Former Director of National Intelligence James R. Clapper explains unmasking.\njoseph.tanfani@latimes.com\nTwitter: @jtanfani\nALSO\nSpecial counsel is named to take over investigation of Russia and Trump associates\nHere's what you need to know about the newly appointed special counsel\nOpinion: Naming Robert Mueller as special counsel isn't enough — because Trump can get rid of him",
  "title": "Rod Rosenstein heads to Capitol Hill after appointing special counsel",
  "url": "http://www.latimes.com/politics/la-na-politics-rosenstein-senate-20170518-story.html"
}