{
  "author": "['Raymond Colitt', 'More Stories Raymond Colitt']",
  "descendant": false,
  "description": "Brazil plunged back into crisis after O Globo newspaper reported that President Michel Temer was involved in an alleged cover-up scheme with the jailed former speaker of the lower house of Congress. Temer’s office denied the allegation, but markets were roiled and at least one legislator called for an impeachment hearing. The allegations are the latest development in Operation Carwash, a sprawling corruption probe that has implicated many of Brazil’s business and political elite, including some",
  "downloadDate": "2017-05-18 12:47:33",
  "filename": "politics_articles_2017-05-18_how-brazil-s-new-political-crisis-might-play-out-quicktake-q-a_1495111653.html",
  "image": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/iycnZLfMoFNo/v0/1200x675.jpg",
  "language": "",
  "localpath": "/Users/felix/news-please//data/2017/05/18/bloomberg.com/politics_articles_2017-05-18_how-brazil-s-new-political-crisis-might-play-out-quicktake-q-a_1495111653.html",
  "modifiedDate": "2017-05-18 12:47:33",
  "pageTitle": "Your Guide to Brazil’s New Political Crisis - Bloomberg",
  "publish_date": "2017-05-18 10:45:08",
  "rss_title": "NULL",
  "sourceDomain": "bloomberg.com",
  "text": "Brazil plunged back into crisis after O Globo newspaper reported that President Michel Temer was involved in an alleged cover-up scheme with the jailed former speaker of the lower house of Congress. Temer’s office denied the allegation, but markets were roiled and at least one legislator called for an impeachment hearing. The allegations are the latest development in Operation Carwash, a sprawling corruption probe that has implicated many of Brazil’s business and political elite, including some in the president’s party.\n1. What did the report say?\nO Globo reported that executives from JBS, a meat-packing company, have submitted a tape to the Supreme Court of a secret recording of Temer approving payment to Eduardo Cunha, who was instrumental in the impeachment of former president Dilma Rousseff. Both JBS and its holding company, J&F, declined to comment.\n2. How did Temer respond?\nThe presidential press office was quick to deny the O Globo report, saying \"President Michel Temer never requested payments” to silence people. Temer, whose political career spans half a century, said through his office that a “deep and wide investigation” was needed into the media claims.\n3. What about other politicians?\nLegislators from five opposition parties called for Temer’s resignation, and at least one has already filed for impeachment hearings against the president.\n4. How likely is that?\nFor Congress to initiate proceedings, Rodrigo Maia, the leader of the lower house and Temer’s ally, would have to sign off on the move. Even then, it would trigger a lengthy process involving several rounds of voting in both houses that require two-thirds majorities to find Temer guilty of wrongdoing. In the case of Rousseff, the entire process took eight months. Temer could file appeals at the Supreme Court at any stage. And even if Temer resigns or is impeached, Congress would elect an interim president until the next scheduled vote in October 2018. An early election could only be held with a constitutional amendment approved by lawmakers.\n5. How did the Brazilian people react?\nAmid growing protests in Brasilia after the O Globo report, military police moved into position around the presidential palace and one of the judges on Brazil’s Supreme Court called for calm. Residents of Sao Paulo could be heard shouting \"Out With Temer\" and banging pots and pans as night fell. The legislative drive to impeach Rousseff in 2016 followed protests that brought millions to the streets -- exceeding the demonstrations that preceded the fall of Brazil’s 21-year military dictatorship in 1985.\n6. Has Temer faced allegations before?\nGet the latest on global politics in your inbox, every day. Get our newsletter daily.\nIn testimony that a Brazilian court released in mid-April, a former construction company executive said he paid a $40 million bribe to Temer’s party in exchange for a Petrobras construction contract. Temer denies the charge, but he already had been touched by an influence-trafficking scandal that forced his top congressional liaison to step down. Allegations of interference with the Carwash investigation also led several cabinet members to resign in the early weeks of Temer’s government.\n7. Anything else to watch for?\nIf the past 18 months is anything to go by, more surprises await. Some analysts say that Brazil’s top electoral court, which is investigating irregularities in campaign financing during the 2014 presidential elections, could decide to scrap the results of that vote. It’s never happened before, but if the court nullifies the 2014 vote, Brazil’s constitution states that Congress must elect a new president within 30 days. The court is slated to resume hearing testimony in the case in coming days.\nThe Reference Shelf",
  "title": "Your Guide to Brazil’s New Political Crisis",
  "url": "https://www.bloomberg.com/politics/articles/2017-05-18/how-brazil-s-new-political-crisis-might-play-out-quicktake-q-a"
}