{
  "author": "['Jack Shafer', 'Isaac Arnsdorf', 'Benjamin Oreskes']",
  "descendant": false,
  "description": "Dana Rohrabacher’s pro-Russia views made him an outcast. But in Trump’s Washington, he could fit right in.",
  "downloadDate": "2017-05-18 12:47:25",
  "filename": "story_2016_11_putin-congress-rohrabacher-trump-231775_1495111645.html",
  "image": "http://static.politico.com/62/b8/49df012141db9719f67b3354def1/161121-dana-rohrabacher-2-gty-1160.jpg",
  "language": "",
  "localpath": "/Users/felix/news-please//data/2017/05/18/politico.com/story_2016_11_putin-congress-rohrabacher-trump-231775_1495111645.html",
  "modifiedDate": "2017-05-18 12:47:25",
  "pageTitle": "Putin’s favorite congressman - POLITICO",
  "publish_date": "2016-11-23 05:03:54",
  "rss_title": "NULL",
  "sourceDomain": "politico.com",
  "text": "This summer, Rep. Dana Rohrabacher used information he received directly from the Russian government to promote one of President Vladimir Putin’s top priorities: removing the name of the martyred Russian lawyer Sergei Magnitsky from a global anti-corruption law.\nMultiple independent investigations blamed Russian officials for the death in jail of Magnitsky, a whistle-blowing attorney who allegedly uncovered evidence of a $230 million theft by officials of the Putin regime.\nStory Continued Below\nIn 2012, Congress banned officials allegedly involved in the Magnitsky murder from visiting the U.S. and from using its banking system. Now, lawmakers want to expand the act to hold officials in other countries accountable for human-rights atrocities.\nPutin, however, considers the Magnitsky Act an international outrage and terminated U.S. adoptions of Russian children in retaliation. A Putin associate implicated in the case has also unleashed a furious lobbying campaign against the new bill, seeking to remove the Magnitsky name.\nPutin’s top congressional ally is Rohrabacher, the 69-year-old chairman of the House subcommittee on Europe and Eurasia. A former Cold Warrior, Rohrabacher has since morphed into a supporter of better relations with Putin’s Russia, for reasons similar to those articulated by President-elect Donald Trump.\nIndeed, Rohrabacher’s sympathy for Putin seems to have resonated with some of Trump’s aides, as the 14-term California congressman — an outspoken Trump enthusiast before the election — has been mentioned as a dark-horse candidate for secretary of state.\n“Some people seem to be looking at me, that's all I know,” Rohrabacher said of the rumors.\nBut the story of the Russian government’s tireless efforts to co-opt Rohrabacher, and gain his support for removing the Magnitsky name from the global anti-corruption bill, illustrates just how deeply Putin’s influence is being felt in Washington on the cusp of the Trump era.\nOn a trip to Moscow, Rohrabacher met with a close Putin confidant and accepted documents from Russian prosecutors claiming Magnitsky wasn’t a whistleblower, but a thief. Back in Washington, Rohrabacher’s senior aide escorted anti-Magnitsky lobbyists to meet other lawmakers and entered testimony endorsing Russia’s version of events into the official congressional record.\nRohrabacher, for his part, says he was merely seeking to find the truth in an international dispute and to avoid gratuitously demonizing Russia.\n“I get pushback whenever I’m asking for an honest assessment of a situation in which Russia is being vilified,” he told POLITICO. “I don’t know where this is all coming from but there’s clearly a herculean effort to push us back into a cold war.”\nFor Rohrabacher, who often boasts about having literally gone to Afghanistan and fought the Soviets alongside the Afghan mujahedeen, the role of pro-Russia congressman is a dramatic change. He was a White House speechwriter for President Ronald Reagan, and in the 1990s he famously arm-wrestled Putin, then a lowly deputy mayor, in a Washington dive bar.\nEver since, Rohrabacher’s transformation from Cold Warrior to Kremlin champion has puzzled colleagues. In Rohrabacher’s telling, Americans have gratuitously antagonized Russia instead of seeking common ground against greater threats from China and Islamic terrorism. That worldview has made him a fixture in Russian state media.\n\" 'Stupidity hurts us all': US decision makers ignorant about Russia -- Congressman Rohrabacher,\" blared a headline in RT, the state-controlled news outlet.\n“Rohrabacher, who comes from this Reganite background, has totally been turned around,” Anders Aslund, a senior fellow at the Atlantic Council, a non-partisan think tank, said. “Rohrabacher has been on this soapbox for many years and it's considered outside the norm.\"\nLast April, Rohrabacher traveled to Moscow on an official congressional trip with four other members of Congress and two staffers. Rohrabacher and his senior aide, Paul Behrends, met privately with Vladimir Yakunin, a Putin confidant whom the Treasury Department blacklisted in 2014 to punish Russia for invading Ukraine, according to an itinerary reviewed by POLITICO and confirmed by Rohrabacher.\nThere was nothing illegal about talking to Yakunin, but the rest of the delegation steered clear. At this meeting, one of the topics Yakunin, Rohrabacher and Behrends discussed, according to Rohrabacher, was the Magnitsky affair.\nLater that day, Rohrabacher rejoined the rest of the delegation to meet with Konstantin Kosachev, chairman of the International Affairs Committee in the Federation Council (Russia’s counterpart to the Senate). At that meeting, Kosachev urged Rohrabacher to consult with Russian prosecutors about the Magnitsky affair. Rohrabacher did and received a document questioning Magnitsky’s story, Rohrabacher told POLITICO.\n“[Kosachev was] the one who asked, would I accept information from the prosecutors and look at what they had to say on this particular case,” he said.\nView Photo gallery Politicians, moguls and even a few Democrats: Trump's revolving door of post-election visitors Political observers have closely watched Donald Trump’s every move as he goes about the massive task of filling the thousands of political appointee jobs, with acute interest in the makeup of his Cabinet. Hundreds of people have called on Trump’s Manhattan office, rural New Jersey getaway and Mar-a-Lago resort in Florida over the past two months; here’s a day-by-day look at some of the people who have visited since Trump was elected.\nThe document, which is marked “Confidential” and was obtained by POLITICO, blamed Magnitsky and his employer, an American-born investor named Bill Browder, for orchestrating the tax fraud. The letter proposed that if more members of Congress followed Rohrabacher’s lead in questioning the Magnitsky story, Russia would reconsider its ban on American adoptions, which Putin imposed in retaliation for the Magnitsky Act in 2012.\nThe document pointed Rohrabacher to supporting evidence in a New York court case. In 2013, federal prosecutors accused a Russian holding company of laundering $14 million stolen in the scheme that Magnitsky uncovered. The company’s owner, Denis Katsyv, is the son of a former transport minister and business associate of Yakunin’s.\nIn February, Katsyv and two other Russians formed a nonprofit organization in Delaware that purported to support restarting Russian adoptions and hired a lobbyist named Rinat Akhmetshin, lobbying and incorporation records show. Akhmetshin visited Rohrabacher’s office in May on the day before the House Foreign Affairs Committee was scheduled to consider the new global human-rights bill named for Magnitsky.\nAkhmetshin recruited Ron Dellums, a former Democratic congressman from California, lobbying records show. Dellums, reached by phone, distanced himself from the campaign. “I’m not doing that any longer. You’re invading my privacy,” he said, and hung up.\nBehrends, the Rohrabacher aide who traveled with him to Moscow, led Akhmetshin and Dellums around the House offices to seek out top committee Democrats Eliot Engel and Gregory Meeks, according to two people with direct knowledge of the interactions. It’s highly unusual for a staffer to shepherd around a lobbyist, especially one for foreign interests, current and former congressional staffers told POLITICO. Behrends declined to comment.\nStaffers and Foreign Affairs Committee colleagues repeatedly tried to show Rohrabacher the contradictions and distortions in the case against Magnitsky, Rohrabacher acknowledged. But he remained skeptical.\nAkhmetshin’s appearance caught the attention of Kyle Parker, a House Foreign Affairs Committee staffer who was a driving force behind the original Magnitsky Act. Parker blasted out an email to colleagues warning them that Akhmetshin used to spy for the Soviets and “specializes in active measures campaigns” (an old Cold War term for propaganda, disinformation and other dark ops), according to an e-mail obtained by POLITICO. Parker declined to comment on the email. Akhmetshin acknowledged having been a Soviet counterintelligence officer, but said he was drafted into the job.\n“Just because I was born in Russia doesn't mean I am an agent of [the] Kremlin,” Akhmetshin told POLITICO.\nAt the markup of the Global Magnitsky bill, on May 18, Rohrabacher proposed an amendment to strike Magnitsky’s name. He cast doubt on Browder’s account of the Magnitsky story and offered up the Russian version he had received in Moscow.\n“It is possible either one of those explanations could be true, but we don’t know enough,” he said at the meeting. “What we want to base this on is truth, not just some gratuitous slap at Russia.”\nA procession of Rohrabacher’s colleagues spoke out against him.\n“I felt listening to him like I was watching RT, Russian Television,” Gerald Connolly (D-Va.) said.\n“There are really no doubts about the veracity of the case of Sergei Magnitsky,” David Cicilline (D-R.I.) said.\nBut Rohrabacher insisted. “This is a murky issue,” he said. “It is not cut and dry. And I know that over and over again it has been repeated that it is cut and dry and it is not.\"\n“The downside of this, let me be very clear about this,” he continued, “the Russians feel it is a gratuitous slap just at them. And because of that, they have changed a law in Russia dealing with Americans’ ability to adopt children, Russian children.”\nThe committee voted down Rohrabacher’s amendment and approved the bill by voice vote. But the seed of doubt had been planted.\nThe 2009 death of Sergei Magnitsky, one of Vladimir Putin's foes, has been a point of contention in U.S.-Russia relations. | AP Photo\n“That’s what the Russians want: It’s muddying the waters,” a Hill source said.\nThe lobbying campaign continued into June: Katsyv’s organization hired another reporter-turned-consultant named Chris Cooper to organize a Washington screening of a new documentary called “The Magnitsky Act — Behind the Scenes.” The director, Andrei Nekrasov, previously had a reputation as a Putin critic, but his latest film tells the story the Kremlin wants known, the same one described in the documents given to Rohrabacher. (Nekrasov told POLITICO the documentary was funded by Northern European film organizations and television networks. Cooper declined to comment.)\nThe day after the screening, the House Foreign Affairs Committee held a hearing on U.S.-Russian relations. Nekrasov told POLITICO that Behrends, the Rohrabacher staffer, asked him to testify but later withdrew the invitation.\nAfter the hearing, Nekrasov and Akhmetshin dined with Rohrabacher and Behrends at the Capitol Hill Club.\nBehrends asked Nekrasov to submit a polished statement, the filmmaker told POLITICO.\nNekrasov’s testimony appeared in the hearing’s official transcript, as submitted by Rohrabacher’s office. It read: “To the best of my professional abilities to investigate the documents and to interview the people with direct knowledge of those events I came to conclusion that Mr. Magnitsky was not a whistleblower: there is no evidence of him uncovering any fraud, or accusing the police of committing it.”\nIn Moscow, it was a propaganda coup trumpeted in state media. In Washington, it was a sign of pro-Russian interests becoming more assertive, in the same year that U.S. intelligence officials accused Russia of meddling in the presidential election. After Trump’s victory, Russian influence efforts will not be easily marginalized.\n“The Russians never give up if something is really bothering them and clearly Magnitsky is really bothering them and they don’t want added attention to it,” said William Pomeranz, deputy director of the Kennan Institute for Advanced Russian Studies of the Woodrow Wilson Center. “We just don’t know yet the willingness of Republicans to oppose Trump’s Russia policy.”\nAuthors:",
  "title": "Putin’s favorite congressman",
  "url": "http://www.politico.com/story/2016/11/putin-congress-rohrabacher-trump-231775"
}