{
  "author": "['Burgess Everett', 'Nancy Cook', 'Jack Shafer']",
  "descendant": false,
  "description": "Investigations and subpoenas will eat into Congress' time, and some Republicans question whether the president will be an effective salesman for their priorities.",
  "downloadDate": "2017-05-18 12:47:28",
  "filename": "story_2017_05_18_trump-scandals-threaten-gop-agenda-238531_1495111648.html",
  "image": "http://static.politico.com/57/65/2d302e0444c7b31305f99b38e738/170517-donald-trump-gty-1160.jpg",
  "language": "",
  "localpath": "/Users/felix/news-please//data/2017/05/18/politico.com/story_2017_05_18_trump-scandals-threaten-gop-agenda-238531_1495111648.html",
  "modifiedDate": "2017-05-18 12:47:28",
  "pageTitle": "Trump scandals threaten GOP agenda - POLITICO",
  "publish_date": "2017-05-18 05:16:31",
  "rss_title": "NULL",
  "sourceDomain": "politico.com",
  "text": "Republicans’ long-held dreams of tweaking Medicaid, repealing Obamacare and overhauling the tax code appear in more jeopardy than ever as scandal and investigations beset President Donald Trump's White House.\nSome Republicans fear that subpoenas and congressional inquiries will swamp the time they need to pass a health care or tax bill in 2017 — not to mention renegotiate NAFTA, unify behind a $1 trillion infrastructure plan or build that border wall.\nStory Continued Below\n“Everything affects our work right now. The more controversy we have the more difficult it is to do things,” said Senate Finance Chairman Orrin Hatch (R-Utah). “But this place is filled with controversy, so if you don’t understand that, you’re in the wrong job.”\nThe Dow fell by more than 370 points on Wednesday, the largest drop since Trump took office, reflecting investors’ fears about the news out of Washington. That plunge was followed by the Justice Department's decision to appoint a special prosecutor to investigate alleged Russian involvement in the presidential election — just the latest in a series of furors involving ties between Trump's campaign and Russia.\nIt’s not just Republicans’ policy agenda on the line but the party’s own political future. Republicans control the White House and Congress and need to show they can govern, rather than just oppose, major policy packages. Many conservatives supported Trump precisely for that reason — the chance to enact a sweeping agenda. If that opportunity falls away as the White House’s credibility erodes, so too could Trump’s support among lawmakers, establishment Republicans and even his loyal base of voters.\n“What has swayed a lot of mainstream conservatives is the possibility that we could do dramatic conservative reform on issues we care about,” said Lanhee Chen, former policy director for the Romney-Ryan presidential campaign of 2012. “The ability to advance a conservative agenda they care about is a big reason why people skeptical of Trump have hung in there.”\nRepublican lawmakers and Trump supporters say they’re still determined to push through policy wins before the 2018 midterms — with or without the president’s high-profile help. They have had a handful of early victories, including Trump's appointment of Neil Gorsuch to the Supreme Court and the rollback of Obama-era regulations through the formerly little-used Congressional Review Act.\nBut the congressional calendar is tight, with long recesses in June and August. Floor time will be consumed by the passage of spending bills and action on the debt-ceiling limit this fall, not to mention the ongoing confirmation of Trump’s political appointees. Congress has only so much bandwidth — and now investigations related to Trump's campaign and Russia will be taking up a share.\n“There are all kinds of questions about hearing time and floor time, if the investigations get more serious and that gets in the way,” said Tevi Troy, a former domestic policy adviser to President George W. Bush. “The mantra of any administration is that you have limited amount of time to get stuff done, and you need to keep pushing to get things done.”\nLawmakers seem prepared for a go-it-alone strategy, as the Senate writes its own version of the health care bill and the House tax writing committee begins its first hearing on tax reform on Thursday. “It’s just something we’d have to confront,\" said Sen. Marco Rubio (R-Fla.). \"Would it be a lot easier to do this if other things weren’t ongoing? Of course. We’re just going to have to deal with what we have before us.\"\nThe problem with this approach, however, is that even a totally Republican-controlled Congress needs a president to help close a deal. That was certainly the case with the health care legislation that the House narrowly passed this month. In the final hours before the bill passed the House, earning just one more vote than the 216 it needed, Trump had to make several phone calls to win over nervous GOP lawmakers such as Michigan Rep. Fred Upton.\nSome Republicans wonder whether Trump will be able to play that role effectively for future votes.\n“Every piece of significant legislation gets to a point where it requires the president to deliver the votes for his or her party. I have a real doubt as to whether this administration can deliver the last four to five votes,” said one former Senate Republican leadership aide. “The margin for error is practically nothing and requires the administration to have some juice on the Hill to get anything done.”\nFor the second week in a row, Senate Republicans have ignored the rising scandal and controversy at their daily lunches, which have been completely devoted to health care. Majority Leader Mitch McConnell (R-Ky.) briefly mentioned Deputy Attorney General Rod Rosenstein’s upcoming briefing with senators on Thursday, but other than that there was no discussion of the matter, senators said.\nRepublicans want to show some independence from Trump and figure that continuing the work on legislation, despite the chaotic White House, will underscore their serious efforts at legislating.\nYet the president’s unpopularity with the broader electorate and penchant for controversy could make it harder to move legislation later this year, several senators acknowledged. One of the chief concerns is that if and when a health care deal emerges, damaging revelations from Trump’s White House could make it impossible to get across the finish line.\n“The bigger question is when we do get something that we think we could pass, what’s the political backdrop when we try to do it,” said Sen. Jeff Flake (R-Ariz.).\nThe same concerns could also hinder longer-term policy goals such as an infrastructure proposal or renegotiation of the free trade deal with Canada and Mexico.\nTransportation Secretary Elaine Chao said this week that the administration will “share its vision” by the end of May for Trump's still-unreleased infrastructure package, leaving Congress to fill in the blanks with legislation later in the year. But while rebuilding the nation's roads and bridges once seemed a fruitful area for Trump to build buy-in from Democrats, the multiplying questions about the president's actions make a kumbaya moment less likely.\nTrump and Comey: What's next? Sign up for POLITICO Huddle. A daily play-by-play of congressional news in your inbox. Email Sign Up By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.\nAs for trade, experts doubt that Canada and Mexico will be motivated to pursue talks in August — the earliest they can formally begin — with any seriousness if Trump's troubles worsen. That's especially true given Mexico's elections next year and the fact that neither country wanted to redo NAFTA in the first place.\nEven without the investigations and the threat of subpoenas, the White House has already fallen behind its policy agenda of quickly passing health care and tax overhauls through reconciliation and then moving onto other agenda items.\n“All of the predictions of productivity for the year were predicated on the assumption that Trump could bring the GOP together,” said one Republican lobbyist. “That assumption has proven faulty so far. The outlook will get even more grim if, instead of being a unifier, Trump becomes a liability. You’re seeing some disturbing signs that this is where this thing is headed.”\nTo the doubters and naysayers who argue that Republicans cannot work on domestic policy and handle incoming investigations, Trump supporters say: Just wait and see.\n“There is a tendency with the Beltway crowd, when there is a headwind, to count him out,” said David Tamasi, the former Washington, D.C., finance chairman of Trump Victory. \"Whoever has made that bet in the past has not done well.\"\nKathryn A. Wolfe and Doug Palmer contributed to this report.\nAuthors:",
  "title": "Trump scandals threaten GOP agenda",
  "url": "http://www.politico.com/story/2017/05/18/trump-scandals-threaten-gop-agenda-238531"
}