{
  "author": "['Adam Entous Writes About National Security', 'Foreign Policy', 'Intelligence For The Post. He Joined The Newspaper In After More Than Years With The Wall Street Journal', 'Reuters', 'Where He Covered The Pentagon', 'The Cia', 'The White House', 'Congress. He Covered President George W. Bush For Five Years After The September']",
  "descendant": false,
  "description": "Speaker Ryan responded: ‘What’s said in the family stays in the family.’ GOP leaders now cast the exchange as ‘an attempt at humor.’",
  "downloadDate": "2017-05-18 12:47:38",
  "filename": "world_national-security_hou_6d108a47f62701f0aa45d30d2453ddad_515f6f8a-3aff-11e7-8854-21f359183e8c_story_1495111658.html",
  "image": "https://img.washingtonpost.com/rf/image_1484w/2010-2019/WashingtonPost/2017/05/17/Others/Images/2017-05-17/mccarthy_ryan_mcmorrisrogers.jpg",
  "language": "en",
  "localpath": "/Users/felix/news-please//data/2017/05/18/washingtonpost.com/world_national-security_hou_6d108a47f62701f0aa45d30d2453ddad_515f6f8a-3aff-11e7-8854-21f359183e8c_story_1495111658.html",
  "modifiedDate": "2017-05-18 12:47:38",
  "pageTitle": "House majority leader to colleagues in 2016: ‘I think Putin pays’ Trump - The Washington Post",
  "publish_date": "2017-05-17 00:00:00",
  "rss_title": "NULL",
  "sourceDomain": "washingtonpost.com",
  "text": "(Bastien Inzaurralde/The Washington Post)\nA month before Donald Trump clinched the Republican nomination, one of his closest allies in Congress — House Majority Leader Kevin McCarthy — made a politically explosive assertion in a private conversation on Capitol Hill with his fellow GOP leaders: that Trump could be the beneficiary of payments from Russian President Vladimir Putin.\n“There’s two people I think Putin pays: Rohrabacher and Trump,” McCarthy (R-Calif.) said, according to a recording of the June 15, 2016, exchange, which was listened to and verified by The Washington Post. Rep. Dana Rohrabacher is a Californian Republican known in Congress as a fervent defender of Putin and Russia.\nHouse Speaker Paul D. Ryan (R-Wis.) immediately interjected, stopping the conversation from further exploring McCarthy’s assertion, and swore the Republicans present to secrecy.\nBefore the conversation, McCarthy and Ryan had emerged from separate talks at the Capitol with Ukrainian Prime Minister Vladi­mir Groysman, who had described a Kremlin tactic of financing populist politicians to undercut Eastern European democratic institutions.\nNews had just broken the day before in The Washington Post that Russian government hackers had penetrated the computer network of the Democratic National Committee, prompting McCarthy to shift the conversation from Russian meddling in Europe to events closer to home.\nSome of the lawmakers laughed at McCarthy’s comment. Then McCarthy quickly added: “Swear to God.”\nRyan instructed his Republican lieutenants to keep the conversation private, saying: “No leaks. . . . This is how we know we’re a real family here.”\nThe remarks remained secret for nearly a year.\n[Read the transcript of the conversation among GOP leaders obtained by The Post]\nThe conversation provides a glimpse at the internal views of GOP leaders who now find themselves under mounting pressure over the conduct of President Trump. The exchange shows that the Republican leadership in the House privately discussed Russia’s involvement in the 2016 election and Trump’s relationship to Putin, but wanted to keep their concerns secret. It is difficult to tell from the recording the extent to which the remarks were meant to be taken literally.\nThe House leadership has so far stood by the White House as it has lurched from one crisis to another, much of the turmoil fueled by contacts between Trump or his associates with Russia.\nHouse Republican leaders have so far resisted calls for the appointment of an independent commission or a special prosecutor to investigate Russian interference, though pressure has been mounting on them to do so after Trump’s firing of FBI Director James B. Comey and the disclosure that the president shared intelligence with Russian diplomats.\nLate Wednesday, Deputy Attorney General Rod J. Rosenstein announced he had appointed Robert S. Mueller III, a former prosecutor who served as the FBI director from 2001 to 2013, as special counsel to oversee the Russia probe.\n[Deputy attorney general appoints special counsel to oversee probe of Russian interference in election]\nEvan McMullin, who in his role as policy director to the House Republican Conference participated in the June 15 conversation, said: “It’s true that Majority Leader McCarthy said that he thought candidate Trump was on the Kremlin’s payroll. Speaker Ryan was concerned about that leaking.”\nMcMullin ran for president last year as an independent and has been a vocal critic of Trump.\nWhen initially asked to comment on the exchange, Brendan Buck, a spokesman for Ryan, said: “That never happened,” and Matt Sparks, a spokesman for McCarthy, said: “The idea that McCarthy would assert this is absurd and false.”\nAfter being told that The Post would cite a recording of the exchange, Buck, speaking for the GOP House leadership, said: “This entire year-old exchange was clearly an attempt at humor. No one believed the majority leader was seriously asserting that Donald Trump or any of our members were being paid by the Russians. What’s more, the speaker and leadership team have repeatedly spoken out against Russia’s interference in our election, and the House continues to investigate that activity.”\n“This was a failed attempt at humor,” Sparks said.\nKen Grubbs, a spokesman for Rohrabacher, said the congressman has been a consistent advocate of “working closer with the Russians to combat radical Islamism. The congressman doesn’t need to be paid to come to such a necessary conclusion.”\nWhen McCarthy voiced his assessment of whom Putin supports, suspicions were only beginning to swirl around Trump’s alleged Russia ties.\nAt the time, U.S. intelligence agencies knew that the Russians had hacked the DNC and other institutions, but Moscow had yet to start publicly releasing damaging emails through WikiLeaks to undermine Trump’s Democratic challenger, Hillary Clinton. An FBI counterintelligence investigation into Russian efforts to influence the presidential election would open the following month, in late July, Comey has said in testimony to Congress.\nTrump has sought to play down contacts between his campaign and the Russians, dismissing as a “witch hunt” the FBI and congressional investigations into Russian efforts to aid Trump and any possible coordination between the Kremlin and his associates. Trump denies any coordination with Moscow took place.\nPresidential candidate Trump’s embrace of Putin and calls for closer cooperation with Moscow put him at odds with the House Republican caucus, whose members have long advocated a harder line on Russia, with the exception of Rohrabacher and a few others.\nAmong GOP leaders in the House, McCarthy stood out as a Putin critic who in 2015 called for the imposition of “more severe” sanctions for its actions in eastern Ukraine and the annexation of Crimea.\nIn May 2016, McCarthy signed up to serve as a Trump delegate at the Republican National Convention, breaking ranks with Ryan, who said he still was not ready to endorse the candidate. McCarthy’s relationship with Trump became so close that the president would sometimes refer to him as “my Kevin.”\nTrump was by then the lone Republican remaining in the contest for the nomination. Though Ryan continued to hold out, Trump picked up endorsements from the remaining GOP leaders in the House, including Rep. Steve Scalise, the majority whip from Louisiana, and Republican Conference Chairman Cathy McMorris Rodgers (Wash.) — both of whom took part in the June 15 conversation.\nRyan announced on June 2 that he would vote for Trump to help “unite the party so we can win in the fall” but continued to clash with the candidate, including over Putin. While Trump sought to cast Putin as a better leader than then-President Obama, Ryan dubbed him an “aggressor” who didn’t share U.S. interests.\nOn the same day as Ryan’s endorsement, Clinton stepped up her attacks on Trump over his public statements praising Putin. “If Donald gets his way, they’ll be celebrating in the Kremlin,” she said.\nUkrainian officials were unnerved by Trump’s statements in support of Putin. Republicans, they had believed, were supposed to be tougher on Russia.\nWhen Trump named Paul Manafort as his campaign manager in April 2016, alarm bells in Kiev started ringing even louder. Manafort was already well known in Ukraine because of his influential role as a political consultant to Viktor Yanukovych, the country’s former Kremlin-friendly ruler until a popular uprising forced him to flee to Russia. Manafort had also consulted for a powerful Russian businessman with close ties to the Kremlin.\n“Ukraine was, in a sense, a testing ground for Manafort,” said Ukrainian political scientist Taras Berezovets, who became a grudging admirer of Manafort’s skills in the “dark arts” of political stagecraft while Berezovets was working for one of Yanukovych’s political rivals.\nAt the urging of Manafort, Yanukovych campaigned with populist slogans labeling NATO a “menace” and casting “elites” in the Ukrainian capital as out of touch, Berezovets said. Trump struck similar themes during the 2016 campaign.\nThe FBI is now investigating whether Manafort, who stepped down as Trump’s campaign manager in August, received off-the-books payments from Yanukovych’s party, U.S. officials said. As part of that investigation, FBI agents recently took possession of a newly discovered document that allegedly details payments totaling $750,000. Ukrainian lawmaker Sergii Leshchenko, who first disclosed the new document, declined to comment on his contacts with the FBI.\nA spokesman for Manafort has said that Trump’s former campaign manager has not been contacted by the FBI. Manafort has also disputed the authenticity of the newly discovered document.\nGroysman, on an official visit to Washington, met separately with Ryan and McCarthy on June 15 at the Capitol.\nHe told them how the Russians meddled in European politics and called for “unity” in addressing the threat, according to U.S. and Ukrainian officials. Ryan issued a statement after the meeting saying, “the United States stands with Ukraine as it works to rebuild its economy and confront Russian aggression.”\nLater, Ryan spoke privately with McCarthy, Rodgers, Scalise and Rep. Patrick T. McHenry (R-N.C.), the deputy whip, among others.\n1 of 39 Full Screen Autoplay Close Skip Ad × Who is Speaker of the House Paul Ryan? View Photos A look at the Wisconsin Republican’s life and career so far. Caption A look at the Wisconsin Republican’s life and career so far. Feb. 2, 2016 House Speaker Paul D. Ryan of Wisconsin speaks in Washington. J. Scott Applewhite/AP Buy Photo Wait 1 second to continue.\nRyan mentioned his meeting with Groysman, prompting Rodgers to ask: “How are things going in Ukraine?” according to the recording.\nThe situation was difficult, Ryan said. Groysman, he said, had told him that Russian-backed forces were firing 30 to 40 artillery shells into Ukrainian territory every day. And the prime minister described Russian tactics that include “financing our populists, financing people in our governments to undo our governments.”\nRyan said Russia’s goal was to “turn Ukraine against itself.” Groysman underlined Russia’s intentions, saying, “They’re just going to roll right through us and go to the Baltics and everyone else,” according to Ryan’s summary of the prime minister’s remarks in the recording.\n“Yes,” Rodgers said in agreement, noting that the Russians were funding nongovernmental organizations across Europe as part of a wider “propaganda war.”\n“Maniacal,” Ryan said. “And guess, guess who’s the only one taking a strong stand up against it? We are.”\nRodgers disagreed. “We’re not . . . we’re not . . . but, we’re not,” she said.\nThat’s when McCarthy brought the conversation about Russian meddling around to the DNC hack, Trump and Rohrabacher.\n“I’ll guarantee you that’s what it is. . . . The Russians hacked the DNC and got the opp [opposition] research that they had on Trump,” McCarthy said with a laugh.\nRyan asked who the Russians “delivered” the opposition research to.\n“There’s . . . there’s two people I think Putin pays: Rohrabacher and Trump,” McCarthy said, drawing some laughter. “Swear to God,” McCarthy added.\n“This is an off the record,” Ryan said.\nSome lawmakers laughed at that.\n“No leaks, all right?,” Ryan said, adding: “This is how we know we’re a real family here.”\n“That’s how you know that we’re tight,” Scalise said.\n“What’s said in the family stays in the family,” Ryan added.\nAndrew Roth in Moscow, Michael Birnbaum in Brussels and Robert Costa in Washington contributed to this report.\nRead more:\nPolitical chaos in Washington is a return on investment for Moscow\nWhite House offers shifting explanations of Trump’s disclosures to Russians\nTrump revealed highly classified information to Russian foreign minister and ambassador",
  "title": "House majority leader to colleagues in 2016: ‘I think Putin pays’ Trump",
  "url": "https://www.washingtonpost.com/world/national-security/house-majority-leader-to-colleagues-in-2016-i-think-putin-pays-trump/2017/05/17/515f6f8a-3aff-11e7-8854-21f359183e8c_story.html"
}