{
  "url": "http://www.bbc.com/news/world-middle-east-38995832",
  "sourceDomain": "bbc.com",
  "pageTitle": "Baghdad car bomb kills at least 48 - BBC News",
  "rss_title": "NULL",
  "localpath": "/Users/ianmackerracher/news-please//data/2017/03/03/bbc.com/news_world-middle-east-38995832_1488540827.html",
  "descendant": false,
  "downloadDate": "2017-03-03 11:33:47",
  "modifiedDate": "2017-03-03 11:33:47",
  "publish_date": "2017-02-16 17:00:00",
  "title": "Baghdad car bomb kills at least 48",
  "description": "A car bomb in southern Baghdad kills at least 48 people - the third such blast in three days.",
  "text": "Media caption Car dealer: \"They killed poor people\"\nAt least 48 people have been killed in Baghdad in the third blast in the Iraqi capital in three days, security and medical sources say.\nA car packed with explosives blew up near car dealerships in the Shia area of Bayaa in the south of the city. More than 50 people were injured.\nThe Islamic State (IS) group claimed the attack, saying it targeted \"a gathering of Shias\".\nAt least 24 people were killed in other attacks on Tuesday and Wednesday.\nBaghdad saw a wave of deadly suicide attacks by IS in the first few days of 2017, but the number had dropped until recently.\nAn AFP reporter at the scene of Thursday's bomb reported seeing numerous burnt-out vehicles, and blood on the ground.\nImage copyright AFP Image caption A large crater was left at the scene of the blast\nImage copyright AFP Image caption Numerous building were also destroyed in Thursday's blast\nSecurity sources said the bomb was detonated in a busy street and was the deadliest attack in Baghdad for several months. A plume of smoke from the blast could be seen above the Bayaa neighbourhood for much of the day.\nMedics have warned the number of fatalities and injuries could rise as they struggle to cope with scores of people wounded in the attack.\nIt is thought that car dealerships may present convenient targets for the militants because it is easy for them to leave vehicles laden with explosives alongside lots of other vehicles that are also parked in the same area.\nAs the clear-up operation gets underway, distressed relatives are reported to be at the scene desperate to find news of their loved ones.\nThe IS group has stepped up its attacks since the Iraqi army, aided by US-led coalition strikes, launched its campaign to dislodge the Sunni militant group from its stronghold of Mosul in the north four months ago.\nThe militants now control the west of the city, while the eastern part is held by Iraqi forces and their allies.\nImage copyright Reuters Image caption Baghdad has been hit by three bombings in as many days\nOn Wednesday, an attack on used-car dealers in the Habibya area of Sadr City, a suburb in the north of the Iraqi capital, left 18 dead.\nOn Tuesday, a car bomb in the south of Baghdad killed four people.\nOn 2 January, at least 35 people were killed in a bomb blast in Sadr City, in an attack claimed by IS.",
  "author": null,
  "image": "http://ichef.bbci.co.uk/news/1024/cpsprodpb/CC04/production/_94682225_mediaitem94681900.jpg",
  "language": "en"
}