{
  "url": "http://edition.cnn.com/2017/02/16/middleeast/iraq-baghdad-violence-bomb/",
  "sourceDomain": "edition.cnn.com",
  "pageTitle": "ISIS claims responsibility for deadly Baghdad car bomb blast - CNN.com",
  "rss_title": "NULL",
  "localpath": "/Users/ianmackerracher/news-please//data/2017/03/03/edition.cnn.com/2017_02_16_middleeast__1488540825.html",
  "descendant": false,
  "downloadDate": "2017-03-03 11:33:45",
  "modifiedDate": "2017-03-03 11:33:45",
  "publish_date": "2017-02-16 14:56:45",
  "title": "ISIS claims responsibility for deadly Baghdad blast",
  "description": "ISIS has claimed responsibility for a deadly car bomb explosion Thursday in southwestern Baghdad, according to a statement released by ISIS-affiliated Amaq News Agency.",
  "text": "Story highlights More than 50 people were killed and at least 51 were injured, an official said\nISIS has carried out several attacks across Iraq's capital since January\n(CNN) ISIS has claimed responsibility for a deadly car bomb explosion Thursday in southwestern Baghdad, according to a statement released by ISIS-affiliated Amaq News Agency.\nThe blast killed 51 people and wounded at least as many others, Gen. Saad Maan, spokesman for Baghdad's Operations Command, said in a statement.\nThe attack targeted a busy car market in the predominately Shiite al-Bayaa district of the Iraqi capital, a security official told CNN.\nEven before the ISIS statement began circulating among supporters on social media, the US State Department blamed the terror group for the massacre.\n\"We condemn in the strongest possible terms the horrible terrorist attacks carried out by ISIS targeting a car dealership in Baghdad, Iraq, today,\" said Mark Toner, the department's acting spokesman. \"We extend our deepest condolences to the victims' families and friends, and wish a full and quick recovery to those injured.\"\nSmoke rises from the site of a deadly explosion Thursday in Baghdad.\nRead More",
  "author": "['Yousuf Basil', 'Michelle Krupa']",
  "image": "http://i2.cdn.cnn.com/cnnnext/dam/assets/170216160156-02-baghdad-bombing-0216-super-tease.jpg",
  "language": ""
}