{
  "url": "http://timesofindia.indiatimes.com/world/middle-east/baghdad-car-bomb-claimed-by-islamic-state-kills-45/articleshow/57191661.cms",
  "sourceDomain": "timesofindia.indiatimes.com",
  "pageTitle": "​Baghdad car bomb: Baghdad car bomb claimed by Islamic State kills 45 - Times of India",
  "rss_title": "NULL",
  "localpath": "/Users/ianmackerracher/news-please//data/2017/03/03/timesofindia.indiatimes.com/world_middle-east_baghdad-c_2208dd0252df7373020d3f21c930ec68_57191661_1488540824.html",
  "descendant": false,
  "downloadDate": "2017-03-03 11:33:44",
  "modifiedDate": "2017-03-03 11:33:44",
  "publish_date": "2017-02-16 21:53:00",
  "title": "Baghdad car bomb claimed by Islamic State kills 45",
  "description": "A car bomb in Baghdad killed at least 45 people and wounded nearly 50 others on Thursday, Iraq's interior ministry said. Ministry spokesman Brig Gen Saad Maan confirmed the toll from the attack, which took place in the southwestern al-Bayaa neighborhood.",
  "text": "BAGHDAD: A car bomb in Baghdad killed at least 45 people and wounded nearly 50 others on Thursday, Iraq's interior ministry said.Ministry spokesman Brig Gen Saad Maan confirmed the toll from the attack, which took place in the southwestern al-Bayaa neighborhood.The Islamic State group claimed the bombing in an online statement circulated by its Aamaq news agency. The Sunni extremist group said it was targeting Shia Muslims.Iraqi officials said the bomb targeted car dealerships in the mostly Shia neighborhood.The extremist group has carried out near-daily attacks in Baghdad despite suffering military setbacks elsewhere in the country, including in the northern city of Mosul, where US-backed Iraqi forces have been waging a major operation since October.Another four attacks in and around Baghdad on Thursday killed eight people and wounded around 30, police and medical officials said. They spoke on condition of anonymity because they were not authorized to brief reporters.A day earlier, a suicide bomber detonated a pick-up truck on Wednesday in Baghdad's Sadr City suburb, killing at least 15 and wounding 50 more.On Tuesday, a car bomb explosion in southern Baghdad killed at least four people.",
  "author": null,
  "image": "http://timesofindia.indiatimes.com/photo/57191785.cms",
  "language": ""
}