{
  "url": "https://www.washingtonpost.com/world/at-least-45-people-are-killed-in-bombing-at-popular-car-market-in-baghdad/2017/02/16/6ff1211e-f45a-11e6-9fb1-2d8f3fc9c0ed_story.html?utm_term=.f51a22debb35",
  "sourceDomain": "washingtonpost.com",
  "pageTitle": " At least 45 people are killed in bombing at popular car market in Baghdad - The Washington Post",
  "rss_title": "NULL",
  "localpath": "/Users/ianmackerracher/news-please//data/2017/03/03/washingtonpost.com/world_at-least-45-people-ar_3f59fba033ba152587fbcbfc5f8ead50_6ff1211e-f45a-11e6-9fb1-2d8f3fc9c0ed_story.html_utm_term=.f51a22debb35_1488540826.html",
  "descendant": false,
  "downloadDate": "2017-03-03 11:33:46",
  "modifiedDate": "2017-03-03 11:33:46",
  "publish_date": "2017-02-16 00:00:00",
  "title": "At least 45 people are killed in bombing at popular car market in Baghdad",
  "description": "The government has found no solution to the regular bombings by the Islamic State militant group.",
  "text": "At least 45 people were killed and dozens more ­injured when a bomb detonated Thursday evening at a popular car market in southwestern Baghdad, the deadliest in a series of recent attacks in the Iraqi capital blamed on the Islamic State ­militant group, the Interior ­Ministry said.\nA ministry spokesman said the bomb was placed in a parked car at the market in the Bayaa neighborhood, between Baghdad International Airport and the Tigris River. The Islamic State asserted responsibility in a brief statement circulated on social media.\nThe attack was at least the third bombing in the capital in as many days, and it appeared to be aimed at diverting the ­government as it prepares an offensive to drive the Islamic State from the northern city of Mosul, the militants’ last major stronghold in Iraq.\nThe Iraqi government has spent years and untold sums ­trying to secure Baghdad, using checkpoints, blast walls and ­other measures, but militants have consistently found ways through, carrying out small-scale attacks with an alarming frequency and mass killings at regular intervals. In November, an explosion killed at least 70 people, most of them Iranian pilgrims, at a gas station south of Baghdad, in an attack claimed by the Islamic State.\n[A file on ISIS ‘problem’ foreign fighters shows some are refusing to fight ]\nBurnt vehicles at the scene of the blast. (Ahmad Mousa/AFP/Getty Images)\nMushtaq Talib, a 28-year-old dentist who lives about 2 1/2 miles from the car market, said the explosion shook his house. The market was crowded, as is typical on Thursdays and Fridays, with people visiting used-car shops and driving their own vehicles to the area, hoping for a sale.\nSoon after the explosion, Talib rushed to the scene, which he said had been secured by a single checkpoint before the attack, staffed by police officers.\n“It was horrible,” he said. “Dead bodies and body parts everywhere, they were all ­civilians.”\nCars not disabled by the blast were used to ferry the wounded to the hospital, as others waited for ambulances to arrive.\nVideos of the bombing that circulated on the Internet showed large-scale damage and terrible scenes: a line of white minibuses in flames, firefighters stumbling from one fire to the next and bodies everywhere, ­disfigured on the ground or ­bundled into a crude wheel­barrow with someone’s arm dangling over the side.\n“These are the Iraqi people,” a man, wailing, can be heard saying over and over in one of the video clips. In another video, a boy shouted that his father was lying under his food cart. It was not clear whether the man was alive.\nThe string of attacks comes as the militant group is trying to stave off defeat in Mosul. Iraqi military forces, backed by the United States, have secured the eastern party of the city and are expected to advance on western Mosul in the coming days. The remainder of the battle may turn out to be more grueling than its initial phase, which lasted nearly four months. Iraqi forces will be fighting in streets too narrow for armored vehicles to pass, in neighborhoods densely packed with civilians, against militants who may regard the fight for the strategic Iraqi city as a last stand.\nFahim reported from Istanbul.\nEastern side of Mosul recaptured from Islamic State, Iraqi prime minister says\nIraq has never seen this kind of fighting in its battles with ISIS\nToday’s coverage from Post correspondents around the world\nLike Washington Post World on Facebook and stay updated on foreign news",
  "author": "['Kareem Fahim Is A Middle East Correspondent For The Post.']",
  "image": "https://img.washingtonpost.com/rf/image_1484w/2010-2019/WashingtonPost/2017/02/16/Foreign/Images/AFP_LR5B1-4248.jpg",
  "language": "en"
}