{"url": "https://sputniknews.com/military/201411071014375183/", "sourceDomain": "sputniknews.com", "pageTitle": "Allegations of Russian Troops Advancing Toward Ukraine Unfounded: Ministry", "rss_title": "NULL", "localpath": "C:\\Users\\user/news-please//data/2017/05/23/sputniknews.com/military__1495555102.html", "descendant": false, "downloadDate": "2017-05-23 15:58:22", "modifiedDate": "2017-05-23 15:58:22", "publish_date": "2014-11-07 07:58:00", "title": "Allegations of Russian Troops Advancing Toward Ukraine Unfounded: Ministry", "description": "The Russian Defense Ministry on Friday called on the West to address the dangers of Russian troops near the Ukrainian border to the source that has invented them.", "text": "MOSCOW, November 7 (RIA Novosti) — Allegations voiced by Canadian Foreign Minister John Baird and a number of representatives from the United States and NATO about Russian troops supposedly moving toward the country's border with Ukraine have no grounds and are based on rumors, a Russian Defense Ministry spokesman said Friday.\n\"These announcements were made citing some 'reports' without any solid proof,\" the spokesman said.\nOn Wednesday, Baird said his country was seriously concerned about information that Russian troops were apparently moving toward the Ukrainian border.\nThe Defense Ministry said that such announcements directed at irritating the conflict in southeastern Ukraine are coming from a single source.\n\"[The source] is not Ukrainian but he is currently located in an administrative building in Kiev,\" the Defense Ministry spokesman said. \"We call on [our] Western partners to address these dangers of this false information of Russian military forces directly to the source that has invented them in the future,\" he added.\nSince the beginning of the military conflict in Ukraine in April, Kiev and the West have been accusing Russia of sending troops and arms to independence supporters in Ukraine's southeastern regions of Donetsk and Luhansk.\nEarlier this week, for example, Ukraine's Foreign Ministry submitted a protest note to Russia's Foreign Ministry, stating that Moscow is providing military aid to Donbas fighters.\nThese accusations, however, were never supported with any evidence. Russia has repeatedly stated that it is not involved in the conflict, calling it an internal matter, but has contributed to its peaceful resolution by acting as a mediator at talks in the Belarusian capital of Minsk that resulted in a ceasefire agreement between Kiev's forces and independence supporters of Ukraine's eastern regions.", "author": null, "image": "https://cdn1.img.sputniknews.com/images/101448/65/1014486552.jpg", "language": "en", "background": "255, 204, 204,1"}