{"url": "http://www.cnbc.com/2014/11/05/tank-column-crosses-from-russia-into-ukraine-kiev-military.html", "sourceDomain": "cnbc.com", "pageTitle": "Tank column crosses from Russia into Ukraine: Kiev military", "rss_title": "NULL", "localpath": "C:\\Users\\user/news-please//data/2017/05/18/cnbc.com/2014_11_05_tank-column-crosses-from-russia-into-ukraine-kiev-military_1495111197.html", "descendant": false, "downloadDate": "2017-05-18 12:39:57", "modifiedDate": "2017-05-18 12:39:57", "publish_date": "2014-11-07 15:29:00", "title": "Tank column crosses from Russia into Ukraine: Kiev military", "description": "NATO has seen an increase in Russian troops and equipment along the Ukraine border, a NATO military officer said on Friday.", "text": "NATO has seen an increase in Russian troops and equipment along the Ukraine border and is looking into reports of Russian tanks crossing the border into eastern Ukraine, a NATO military officer said on Friday.\n\"We are aware of the reports of Russian troops and tanks crossing the border between Ukraine and Russia and are looking into these reports. We can confirm a recent increase in Russian troops and equipment along the eastern border of Ukraine,\" the officer said, on condition of anonymity.\n\"If this crossing into Ukraine is confirmed it would be further evidence of Russia's aggression and direct involvement in destabilizing Ukraine,\" he said,\nIt comes after the Kiev military said a column of 32 tanks, 16 howitzer artillery systems and trucks carrying ammunition and fighters has crossed into eastern Ukraine from Russia.\n\"The deployment continues of military equipment and Russian mercenaries to the front lines,\" spokesman Andriy Lysenko said in a televised briefing referring to Thursday's cross-border incursion.", "author": "['Bulent Doruk', 'Anadolu Agency', 'Getty Images']", "image": "http://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2014/03/01/101458101-475552017.1910x1000.jpg", "language": "", "background": "230, 243, 255,1"}