{"url": "http://www.eaglenews.ph/international/tank-column-crosses-from-russia-into-ukraine-kiev-military/", "sourceDomain": "eaglenews.ph", "pageTitle": "Tank column crosses from Russia into Ukraine: Kiev military", "rss_title": "NULL", "localpath": "C:\\Users\\user/news-please//data/2017/05/18/eaglenews.ph/international__1495125431.html", "descendant": false, "downloadDate": "2017-05-18 16:37:11", "modifiedDate": "2017-05-18 16:37:11", "publish_date": "2014-11-07 19:23:40", "title": "Tank column crosses from Russia into Ukraine: Kiev military", "description": "A column of 32 tanks, 16 howitzer artillery systems and trucks carrying ammunition and fighters has crossed into eastern Ukraine from Russia, the Kiev military said on Friday.", "text": "A column of 32 tanks, 16 howitzer artillery systems and trucks carrying ammunition and fighters has crossed into eastern Ukraine from Russia, the Kiev military said on Friday.\n“The deployment continues of military equipment and Russian mercenaries to the front lines,” spokesman Andriy Lysenko said in a televised briefing referring to Thursday’s cross-border incursion.\nThe report of a new Russian movement of armor across the border follows a charge on Thursday by pro-Russian rebels in eastern Ukraine that Kiev government forces had launched a new offensive – which Kiev immediately denied.\nSporadic violence has continued since a Sept. 5 truce in a conflict that has cost over 4,000 lives.\nBut the ceasefire has looked particularly fragile this week, with separatists and the central government accusing each other of violations after separatist leaders held elections in self-proclaimed ‘people’s republics’ last Sunday.\n“Supplies of military equipment and enemy fighters from the Russian Federation are continuing,” Lysenko said. He added that five Ukrainian soldiers had been killed and 16 wounded in the past 24 hours despite the ceasefire.", "author": null, "image": "http://www.eaglenews.ph/wp-content/uploads/2014/11/s1.reutersmedia2.jpg", "language": "en", "background": "230, 243, 255,1"}