{"url": "http://tass.com/russia/758504", "sourceDomain": "tass.com", "pageTitle": "TASS: Russia - Statements on alleged Russian troops near Ukrainian border provocative — Defense Ministry", "rss_title": "NULL", "localpath": "C:\\Users\\user/news-please//data/2017/05/19/tass.com/russia_758504_1495197809.html", "descendant": false, "downloadDate": "2017-05-19 12:43:29", "modifiedDate": "2017-05-19 12:43:29", "publish_date": "2014-11-07 08:39:00", "title": "Statements on alleged Russian troops near Ukrainian border provocative - Defense Ministry", "description": "The statements on Russian troops' movement near the Ukrainian border were made with reference to certain reports with no p[roof provided, says a Russian Defense Ministry official", "text": "Canadian Foreign Minister John Baird’s statement that Russian troops are allegedly moving to Ukrainian border is provocative, Russian Defense Ministry’s official said Friday. We paid attention to the statement made by Canadian Foreign Minister John Baird and those by several US and NATO officials before him who voiced concerns over alleged movement of Russian troops to Ukrainian border. These statements were made with reference to certain reports without producing actual evidence. Even not speaking of hoary traditional arguments presented as rumours in social networks,” the Russian Defense Ministry’s official said. We would like to note that all such provocative reports aimed at further fuelling of tension over the conflict in south-eastern Ukraine have only one source. It is not of Ukrainian origin, though it is located at one of Kiev administrative buildings today,” he added. In this regard, the Russian Defense Ministry urged Western partners to address fears over untrue information about Russian armed forces directly to the source that invented it. John Baird said on Thursday that Canada was concerned over current reports on Russian troops moving near Ukrainian border. “We call on Russia to immediately withdraw its troops not only from border regions but also from Ukraine’s sovereign territory,” he noted. The Canadian minister also urged Russia to observe the Minsk peace deals.", "author": null, "image": "https://phototass3.cdnvideo.ru/width/1200_4ce85301/tass/m2/en/uploads/i/20141107/1068998.jpg", "language": "ru", "background": "255, 204, 204,1"}