{"url": "http://www.huffingtonpost.com/2014/11/07/ukraine-russia-conflict_n_6120124.html", "sourceDomain": "huffingtonpost.com", "pageTitle": "Ukraine Says Tank Column, Artillery Systems And Trucks Have Crossed Into Eastern Ukraine From Russia | HuffPost", "rss_title": "NULL", "localpath": "C:\\Users\\user/news-please//data/2017/05/18/huffingtonpost.com/2014_11_07_ukraine-russia-conflict_n_6120124_1495125230.html", "descendant": false, "downloadDate": "2017-05-18 16:33:50", "modifiedDate": "2017-05-18 16:33:50", "publish_date": "2014-11-07 11:49:00", "title": "Ukraine Says Tank Column, Artillery Systems And Trucks Have Crossed Into Eastern Ukraine From Russia", "description": "By Natalia Zinets and Vladimir Soldatkin KIEV/MOSCOW, Nov 7 (Reuters) - Ukraine's military accused Russia on Friday of sendi...", "text": "Ukraine's military accused Russia on Friday of sending a column of 32 tanks and truckloads of troops into the country's east to support pro-Russian separatists fighting government forces.\nThursday's cross-border incursion, if confirmed, is a significant escalation of a conflict that has killed more than 4,000 people since the separatists rose up in mid-April and would call into question Russia's commitment to a two-month-old ceasefire deal.\nThe truce has looked particularly fragile this week, with each side accusing the other of violations after separatist elections last Sunday condemned as illegitimate by the West.\n\"Supplies of military equipment and enemy fighters from the Russian Federation are continuing,\" military spokesman Andriy Lysenko told a briefing in Kiev, describing a column that included 16 big artillery guns and 30 trucks carrying troops and ammunition as well as 32 tanks.\nHe said five Ukrainian soldiers had been killed in the past 24 hours although Kiev has denied rebel charges of launching a new military offensive.\nRussian President Vladimir Putin summoned security chiefs on Thursday to discuss the deteriorating situation but announced no new moves afterwards.\nAlthough Russia blames the crisis on Kiev and the West, NATO says it has overwhelming evidence that Russia has aided the rebels militarily in the conflict and it has left Moscow's relations with the West at their lowest ebb since the Cold War.\nA NATO military officer said on Friday the alliance had seen an increase in Russian troops and equipment along the border and was looking into reports of Russian tanks crossing into eastern Ukraine.\n\"If this crossing into Ukraine is confirmed it would be further evidence of Russia's aggression and direct involvement in destabilizing Ukraine,\" he said.\nRussia denies arming the rebels but the ceasefire deal reached in the Belarussian capital, Minsk, now looks in tatters.\n\"The President noted a significant deviation from the implementation of the Minsk protocol, which is leading to further escalation of the conflict,\" a statement on the Ukrainian presidential website said after President Petro Poroshenko spoke to German Chancellor Angela Merkel by phone.\nAlthough Russia did not respond to Kiev's latest accusations, it said it still supported the ceasefire deal.\n\"We support the continuation of the Minsk process and advocate holding another meeting of the Contact Group (of negotiators),\" Kremlin foreign policy adviser Yuri Ushakov said. \"But not everything depends on us. There are a lot of factors.\"\nRISING TENSIONS\nRussia denies direct involvement in the conflict but stoked tensions by annexing the Crimean peninsula in March after the overthrow of a Moscow-backed president in Kiev.\nThe rebels rose up weeks later in the mainly Russian-speaking east and Western governments have imposed sanctions which have aggravated an economic downturn in Russia, whose rouble currency is in sharp decline.\nThe increase in tensions stems from Sunday's leadership elections in the Donetsk and Luhansk \"people's republics,\" which the West and Kiev say violated the Minsk agreements.\nThe Ukrainian government responded by revoking a law that would have granted the rebel-held eastern regions much more autonomy and would have provided them with cash.\nWith tension rising and Western pressure mounting on Russia not to recognize the separatist votes, Ushakov reiterated that Moscow respects the will of the voters but stopped short of using the word \"recognize\" for the votes.\n\"These are different words,\" he said. \"The word 'respect' was chosen deliberately.\"\nHis words could be intended to appease the West, which has threatened to impose new sanctions if the crisis persists.\nSome Western leaders fear Putin wants to create a \"frozen conflict\" in east Ukraine which would end Kiev's ability to control affairs there and allow Moscow to maintain influence as well as complicating Kiev's efforts to join mainstream Europe.\nPutin has not commented on the separatist votes, held one week after a parliamentary election in other parts of Ukraine which cemented Poroshenko's grip on power by increasing support for him in the assembly.\nDespite the tensions over Ukraine, the Russian leader will attend two summits in Asia in the next 10 days which offer a chance for talks on the crisis.\nUshakov said Putin would hold face-to-face talks with British Prime Minister David Cameron and French President Francois Hollande during a G20 summit in Brisbane on Nov. 15-16.\nPutin will also meet International Monetary Fund chief Christine Lagarde and Japanese Prime Minister Shinzo Abe during an Asia-Pacific summit in Beijing on Nov. 10-11.\nU.S. Secretary of State John Kerry and Russian Foreign Minister Sergei Lavrov will also meet in Beijing on Saturday, before the summit starts. No talks are scheduled between Putin and U.S. President Barack Obama although Washington and the Kremlin have not ruled out an informal conversation on the summit sidelines. (Additional reporting by Alessandra Prentice and Richard Balmforth in Kiev and by Katya Golubkova and Timothy Heritage in Moscow; writing by Timothy Heritage)", "author": null, "image": "http://i.huffpost.com/gen/2254828/images/o-RUSSIAN-TANK-facebook.jpg", "language": "en", "background": "230, 243, 255, 1"}